#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass AB_K31_Drone_SW00.AB_K31_Drone_SW00_C
	 * Size -> 0x0AF0 (FullSize[0x0DD0] - InheritedSize[0x02E0])
	 */
	class UAB_K31_Drone_SW00_C : public UK31DroneAnimInstance
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x02E0(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0x02E8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0x0320(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0x0348(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0x0370(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0x0398(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0x03C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0x03E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0x0410(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0x0438(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0x0460(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0x0488(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0x04B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0x04D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0x0500(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0x0528(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0x0550(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0x0578(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0x05A0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0x0620(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0x0658(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0x06D8(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0x0710(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0x0790(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0x07C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0x0848(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0x0880(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0x0900(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0x0938(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0x09B8(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0x09F0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0x0A70(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0x0AA8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0x0B28(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0x0B60(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0x0BE0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0x0C18(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0x0C98(0x0038)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0x0CD0(0x00B0)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot;                                      // 0x0D80(0x0050)

	public:
		void AnimGraph(struct FPoseLink* AnimGraph);
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_705D2D3949AAD85E4074D0914BA9F216();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_876FD404465408A92338A48C40A44D93();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_4BFE553B42F42C9097E843B0529AB1D5();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_1165791C4728D35F9929D5A94DC42FA6();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_32CFE95D49F5416722CFF680EA49A230();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_5E09C99C4A7E608D0ED899873F1E7093();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_6FA5AD214342AE2F2FCA298BB8B0E8E8();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_9CEB5D274D8EA01ACAC5D5ACBD0E7374();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_20DFB751402AC8571068C686F3801BDF();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_8507F89C4EA9EB6B3E3A4C85AA5CD8DA();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_F9DEEE334283F85D5C3957A5C74774A2();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_90B5ED4C40B4A31418674A9F74279CEE();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_93C0EB0A4E7158E365EA3380454D4128();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_FE86B32142BD91799B0455A684E68DE0();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_7D627FE941E27477A045B8B20A283523();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_K31_Drone_SW00_AnimGraphNode_TransitionResult_AC2DDE8B436224248903E6A59C1C8592();
		void ExecuteUbergraph_AB_K31_Drone_SW00(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
