#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimGraph
	 */
	struct UAB_Menu_Slasher28_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnInterrupted_FBF20A854C25DF62FA1C7FA581795689
	 */
	struct UAB_Menu_Slasher28_C_OnInterrupted_FBF20A854C25DF62FA1C7FA581795689_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnBlendOut_FBF20A854C25DF62FA1C7FA581795689
	 */
	struct UAB_Menu_Slasher28_C_OnBlendOut_FBF20A854C25DF62FA1C7FA581795689_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnCompleted_FBF20A854C25DF62FA1C7FA581795689
	 */
	struct UAB_Menu_Slasher28_C_OnCompleted_FBF20A854C25DF62FA1C7FA581795689_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyEnd_67A4A0524204789067E9DB964585A407
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyEnd_67A4A0524204789067E9DB964585A407_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyBegin_67A4A0524204789067E9DB964585A407
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyBegin_67A4A0524204789067E9DB964585A407_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnInterrupted_67A4A0524204789067E9DB964585A407
	 */
	struct UAB_Menu_Slasher28_C_OnInterrupted_67A4A0524204789067E9DB964585A407_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnBlendOut_67A4A0524204789067E9DB964585A407
	 */
	struct UAB_Menu_Slasher28_C_OnBlendOut_67A4A0524204789067E9DB964585A407_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnCompleted_67A4A0524204789067E9DB964585A407
	 */
	struct UAB_Menu_Slasher28_C_OnCompleted_67A4A0524204789067E9DB964585A407_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyEnd_4C173F2D43F0E1440D9CA18391F8991B
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyEnd_4C173F2D43F0E1440D9CA18391F8991B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyBegin_4C173F2D43F0E1440D9CA18391F8991B
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyBegin_4C173F2D43F0E1440D9CA18391F8991B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnInterrupted_4C173F2D43F0E1440D9CA18391F8991B
	 */
	struct UAB_Menu_Slasher28_C_OnInterrupted_4C173F2D43F0E1440D9CA18391F8991B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnBlendOut_4C173F2D43F0E1440D9CA18391F8991B
	 */
	struct UAB_Menu_Slasher28_C_OnBlendOut_4C173F2D43F0E1440D9CA18391F8991B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnCompleted_4C173F2D43F0E1440D9CA18391F8991B
	 */
	struct UAB_Menu_Slasher28_C_OnCompleted_4C173F2D43F0E1440D9CA18391F8991B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyEnd_99176BD143A279FCB5E9EB89DBE0DE89
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyEnd_99176BD143A279FCB5E9EB89DBE0DE89_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyBegin_99176BD143A279FCB5E9EB89DBE0DE89
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyBegin_99176BD143A279FCB5E9EB89DBE0DE89_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnInterrupted_99176BD143A279FCB5E9EB89DBE0DE89
	 */
	struct UAB_Menu_Slasher28_C_OnInterrupted_99176BD143A279FCB5E9EB89DBE0DE89_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnBlendOut_99176BD143A279FCB5E9EB89DBE0DE89
	 */
	struct UAB_Menu_Slasher28_C_OnBlendOut_99176BD143A279FCB5E9EB89DBE0DE89_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnCompleted_99176BD143A279FCB5E9EB89DBE0DE89
	 */
	struct UAB_Menu_Slasher28_C_OnCompleted_99176BD143A279FCB5E9EB89DBE0DE89_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyBegin_FBF20A854C25DF62FA1C7FA581795689
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyBegin_FBF20A854C25DF62FA1C7FA581795689_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.OnNotifyEnd_FBF20A854C25DF62FA1C7FA581795689
	 */
	struct UAB_Menu_Slasher28_C_OnNotifyEnd_FBF20A854C25DF62FA1C7FA581795689_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_D146C54949337FA1677E2380E865E8BE
	 */
	struct UAB_Menu_Slasher28_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_D146C54949337FA1677E2380E865E8BE_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_55BB68CC4DA86D28996257B1194195ED
	 */
	struct UAB_Menu_Slasher28_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_55BB68CC4DA86D28996257B1194195ED_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_29C65B7342F785B35FEC1A9909C527B2
	 */
	struct UAB_Menu_Slasher28_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_29C65B7342F785B35FEC1A9909C527B2_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_590FBB28457F43249CCC7AA583A29DDF
	 */
	struct UAB_Menu_Slasher28_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher28_AnimGraphNode_TransitionResult_590FBB28457F43249CCC7AA583A29DDF_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.BlueprintUpdateAnimation
	 */
	struct UAB_Menu_Slasher28_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.BlueprintInitializeAnimation
	 */
	struct UAB_Menu_Slasher28_C_BlueprintInitializeAnimation_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_GenerateRandom
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_GenerateRandom_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.BP_OnCustomizationAnimationMappingIDChanged
	 */
	struct UAB_Menu_Slasher28_C_BP_OnCustomizationAnimationMappingIDChanged_Params
	{
	public:
		int32_t                                                    animationMappingIndex;                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.UpdateAnimationSet
	 */
	struct UAB_Menu_Slasher28_C_UpdateAnimationSet_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_Idle
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_Idle_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_Interupt01Start
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_Interupt01Start_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_Interupt02Start
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_Interupt02Start_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_K24_Menu_Interrupt01
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_K24_Menu_Interrupt01_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_Hand_Start
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_Hand_Start_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.AnimNotify_IntroEnd
	 */
	struct UAB_Menu_Slasher28_C_AnimNotify_IntroEnd_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.ExecuteUbergraph_AB_Menu_Slasher28
	 */
	struct UAB_Menu_Slasher28_C_ExecuteUbergraph_AB_Menu_Slasher28_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.K28_IntroEnd_Menu_EventDispatcher__DelegateSignature
	 */
	struct UAB_Menu_Slasher28_C_K28_IntroEnd_Menu_EventDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function AB_Menu_Slasher28.AB_Menu_Slasher28_C.K28_IntroStart_Menu_EventDispatcher__DelegateSignature
	 */
	struct UAB_Menu_Slasher28_C_K28_IntroStart_Menu_EventDispatcher__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
