#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.AnimGraph
	 */
	struct UAB_Menu_Slasher26_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnNotifyEnd_179E1E3C4DD31E5A8CE35F98654474C7
	 */
	struct UAB_Menu_Slasher26_C_OnNotifyEnd_179E1E3C4DD31E5A8CE35F98654474C7_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnNotifyBegin_179E1E3C4DD31E5A8CE35F98654474C7
	 */
	struct UAB_Menu_Slasher26_C_OnNotifyBegin_179E1E3C4DD31E5A8CE35F98654474C7_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnInterrupted_179E1E3C4DD31E5A8CE35F98654474C7
	 */
	struct UAB_Menu_Slasher26_C_OnInterrupted_179E1E3C4DD31E5A8CE35F98654474C7_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnBlendOut_179E1E3C4DD31E5A8CE35F98654474C7
	 */
	struct UAB_Menu_Slasher26_C_OnBlendOut_179E1E3C4DD31E5A8CE35F98654474C7_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnCompleted_179E1E3C4DD31E5A8CE35F98654474C7
	 */
	struct UAB_Menu_Slasher26_C_OnCompleted_179E1E3C4DD31E5A8CE35F98654474C7_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.BlueprintInitializeAnimation
	 */
	struct UAB_Menu_Slasher26_C_BlueprintInitializeAnimation_Params
	{	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.BlueprintLinkedAnimationLayersInitialized
	 */
	struct UAB_Menu_Slasher26_C_BlueprintLinkedAnimationLayersInitialized_Params
	{	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnMenuAnimationStateChange_Event
	 */
	struct UAB_Menu_Slasher26_C_OnMenuAnimationStateChange_Event_Params
	{
	public:
		Enum_MenuAnimationState                                    State;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.ExecuteUbergraph_AB_Menu_Slasher26
	 */
	struct UAB_Menu_Slasher26_C_ExecuteUbergraph_AB_Menu_Slasher26_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
