#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.AnimGraph
	 */
	struct UAB_Menu_Slasher31_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnNotifyEnd_FF79019945E856B21A4DD7B9040097DE
	 */
	struct UAB_Menu_Slasher31_C_OnNotifyEnd_FF79019945E856B21A4DD7B9040097DE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnNotifyBegin_FF79019945E856B21A4DD7B9040097DE
	 */
	struct UAB_Menu_Slasher31_C_OnNotifyBegin_FF79019945E856B21A4DD7B9040097DE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnInterrupted_FF79019945E856B21A4DD7B9040097DE
	 */
	struct UAB_Menu_Slasher31_C_OnInterrupted_FF79019945E856B21A4DD7B9040097DE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnBlendOut_FF79019945E856B21A4DD7B9040097DE
	 */
	struct UAB_Menu_Slasher31_C_OnBlendOut_FF79019945E856B21A4DD7B9040097DE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnCompleted_FF79019945E856B21A4DD7B9040097DE
	 */
	struct UAB_Menu_Slasher31_C_OnCompleted_FF79019945E856B21A4DD7B9040097DE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnNotifyEnd_0A05E92D4B4424ABA1D3BABD878923E8
	 */
	struct UAB_Menu_Slasher31_C_OnNotifyEnd_0A05E92D4B4424ABA1D3BABD878923E8_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnNotifyBegin_0A05E92D4B4424ABA1D3BABD878923E8
	 */
	struct UAB_Menu_Slasher31_C_OnNotifyBegin_0A05E92D4B4424ABA1D3BABD878923E8_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnInterrupted_0A05E92D4B4424ABA1D3BABD878923E8
	 */
	struct UAB_Menu_Slasher31_C_OnInterrupted_0A05E92D4B4424ABA1D3BABD878923E8_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnBlendOut_0A05E92D4B4424ABA1D3BABD878923E8
	 */
	struct UAB_Menu_Slasher31_C_OnBlendOut_0A05E92D4B4424ABA1D3BABD878923E8_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnCompleted_0A05E92D4B4424ABA1D3BABD878923E8
	 */
	struct UAB_Menu_Slasher31_C_OnCompleted_0A05E92D4B4424ABA1D3BABD878923E8_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher31_AnimGraphNode_TransitionResult_4D69DF7844ADC3C46C7608990975E05A
	 */
	struct UAB_Menu_Slasher31_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher31_AnimGraphNode_TransitionResult_4D69DF7844ADC3C46C7608990975E05A_Params
	{	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.BlueprintUpdateAnimation
	 */
	struct UAB_Menu_Slasher31_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnCustoChange
	 */
	struct UAB_Menu_Slasher31_C_OnCustoChange_Params
	{
	public:
		int32_t                                                    animationMappingIndex;                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.BlueprintInitializeAnimation
	 */
	struct UAB_Menu_Slasher31_C_BlueprintInitializeAnimation_Params
	{	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.BlueprintLinkedAnimationLayersInitialized
	 */
	struct UAB_Menu_Slasher31_C_BlueprintLinkedAnimationLayersInitialized_Params
	{	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnMenuAnimationStateChange_Event
	 */
	struct UAB_Menu_Slasher31_C_OnMenuAnimationStateChange_Event_Params
	{
	public:
		Enum_MenuAnimationState                                    State;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.OnCustomizationAnimationMappingIDChanged
	 */
	struct UAB_Menu_Slasher31_C_OnCustomizationAnimationMappingIDChanged_Params
	{
	public:
		int32_t                                                    animationMappingIndex;                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Menu_Slasher31.AB_Menu_Slasher31_C.ExecuteUbergraph_AB_Menu_Slasher31
	 */
	struct UAB_Menu_Slasher31_C_ExecuteUbergraph_AB_Menu_Slasher31_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
