#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.AnimGraph
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           InPose;                                                  // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
		struct FPoseLink                                           AnimGraph;                                               // 0x0010(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.IsValidCarry
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_IsValidCarry_Params
	{
	public:
		class UObject*                                             animObject;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsValid;                                                 // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_1E0AB618474B57CB4F4B139CD2FF153F
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_1E0AB618474B57CB4F4B139CD2FF153F_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_D8D9B40B45225383413A8EBDDD151010
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_D8D9B40B45225383413A8EBDDD151010_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_3FE40A804DF9318CF70B05BA1D9A9CEB
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_3FE40A804DF9318CF70B05BA1D9A9CEB_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.AnimNotify_TurnEnd
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_AnimNotify_TurnEnd_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_08B24A344AB2AFE94EF76DA71BA99240
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_AnimGraphNode_TransitionResult_08B24A344AB2AFE94EF76DA71BA99240_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.BlueprintUpdateAnimation
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.BlueprintInitializeAnimation
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_BlueprintInitializeAnimation_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.SetLookAtAnimationFromMainAB
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_SetLookAtAnimationFromMainAB_Params
	{
	public:
		struct FAset_Slasher_LookAT                                LookAtAnimSet;                                           // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Slasher_SubGraph_LookAtTurn_00.AB_Slasher_SubGraph_LookAtTurn_00_C.ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00
	 */
	struct UAB_Slasher_SubGraph_LookAtTurn_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAtTurn_00_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_WZUK[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
