#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.AnimGraph
	 */
	struct UAB_Slasher_SubGraph_Menu_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_315C8E6444B60C3D4699AC863DECF763
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_315C8E6444B60C3D4699AC863DECF763_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_3E3ABF8E4F276B5FBBFA5697451292CF
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_3E3ABF8E4F276B5FBBFA5697451292CF_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_13069AA346A598DDCD65FEB86788577B
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_13069AA346A598DDCD65FEB86788577B_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_EE90647340D120A12EF9CD9BF02FCFA5
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_EE90647340D120A12EF9CD9BF02FCFA5_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_6D2F7FB540BF4660E4584AB0B255221D
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_6D2F7FB540BF4660E4584AB0B255221D_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_342F73ED4DFC794BEF5B00B8DC5E510A
	 */
	struct UAB_Slasher_SubGraph_Menu_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_342F73ED4DFC794BEF5B00B8DC5E510A_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.BlueprintUpdateAnimation
	 */
	struct UAB_Slasher_SubGraph_Menu_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.BlueprintInitializeAnimation
	 */
	struct UAB_Slasher_SubGraph_Menu_C_BlueprintInitializeAnimation_Params
	{	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.ChangeMenuInterrupt
	 */
	struct UAB_Slasher_SubGraph_Menu_C_ChangeMenuInterrupt_Params
	{
	public:
		int32_t                                                    MenuInterrupt;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       DebugPassCurrentAnimation;                               // 0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.SetMenuAnimationFromMainAB
	 */
	struct UAB_Slasher_SubGraph_Menu_C_SetMenuAnimationFromMainAB_Params
	{
	public:
		struct FAset_Slasher_Menu                                  MenuAnimSet;                                             // 0x0000(0x0030)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.ExecuteUbergraph_AB_Slasher_SubGraph_Menu
	 */
	struct UAB_Slasher_SubGraph_Menu_C_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ZI0Z[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
