#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct ASet_Slasher_28_Menu.ASet_Slasher_28_Menu
	 * Size -> 0x0038
	 */
	struct FASet_Slasher_28_Menu
	{
	public:
		class UAnimSequence*                                       IdleMenuSpawn_123_4D5243924018177CC29C54AC3D981E8E;      // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       IdleMenu_129_96306FF546B44FA2EB8D89A0A8AA4CE0;           // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       IdleMenuLobby_124_2B884AFC4FA984E1BF5577826945DF2D;      // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       IdleMenuBack_125_64F814E2466C3643A00575B4E7CD77CC;       // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       MenuInterrupt01_126_6F276602453E0DA38518098E022AEF89;    // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       MenuInterrupt02_127_2F8D955F4CA92BF28580CAA9DD1D08C8;    // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       MenuInterrupt03_128_A22D4D8F4458B8AB2FFE3CA00C80A4E0;    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
