#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnNotifyEnd_699133144A8A4CBB65233EA538E5F3E6
	 */
	struct ABP_Menu_Slasher24_C_OnNotifyEnd_699133144A8A4CBB65233EA538E5F3E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnNotifyBegin_699133144A8A4CBB65233EA538E5F3E6
	 */
	struct ABP_Menu_Slasher24_C_OnNotifyBegin_699133144A8A4CBB65233EA538E5F3E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnInterrupted_699133144A8A4CBB65233EA538E5F3E6
	 */
	struct ABP_Menu_Slasher24_C_OnInterrupted_699133144A8A4CBB65233EA538E5F3E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnBlendOut_699133144A8A4CBB65233EA538E5F3E6
	 */
	struct ABP_Menu_Slasher24_C_OnBlendOut_699133144A8A4CBB65233EA538E5F3E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnCompleted_699133144A8A4CBB65233EA538E5F3E6
	 */
	struct ABP_Menu_Slasher24_C_OnCompleted_699133144A8A4CBB65233EA538E5F3E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.ReceiveBeginPlay
	 */
	struct ABP_Menu_Slasher24_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.K24_FX_HideTentacle
	 */
	struct ABP_Menu_Slasher24_C_K24_FX_HideTentacle_Params
	{	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.K24_FX_ShowTentacle
	 */
	struct ABP_Menu_Slasher24_C_K24_FX_ShowTentacle_Params
	{	};

	/**
	 * Function BP_Menu_Slasher24.BP_Menu_Slasher24_C.ExecuteUbergraph_BP_Menu_Slasher24
	 */
	struct ABP_Menu_Slasher24_C_ExecuteUbergraph_BP_Menu_Slasher24_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
