#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature
	 */
	struct ABP_Menu_Slasher30_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature_Params
	{
	public:
		EAudioCustomizationCategory                                Category;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_P4T6[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              switchState;                                             // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.ReceiveBeginPlay
	 */
	struct ABP_Menu_Slasher30_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.ReceiveEndPlay
	 */
	struct ABP_Menu_Slasher30_C_ReceiveEndPlay_Params
	{
	public:
		EEndPlayReason                                             EndPlayReason;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.RemoveAssetsBeforeDestroy
	 */
	struct ABP_Menu_Slasher30_C_RemoveAssetsBeforeDestroy_Params
	{	};

	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.BeginSmokeIn
	 */
	struct ABP_Menu_Slasher30_C_BeginSmokeIn_Params
	{	};

	/**
	 * Function BP_Menu_Slasher30.BP_Menu_Slasher30_C.ExecuteUbergraph_BP_Menu_Slasher30
	 */
	struct ABP_Menu_Slasher30_C_ExecuteUbergraph_BP_Menu_Slasher30_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
