#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.OnNotifyEnd_2D489A3641E154EF5C2CBFA84C773EFE
	 */
	struct ABP_Menu_Slasher27_C_OnNotifyEnd_2D489A3641E154EF5C2CBFA84C773EFE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.OnNotifyBegin_2D489A3641E154EF5C2CBFA84C773EFE
	 */
	struct ABP_Menu_Slasher27_C_OnNotifyBegin_2D489A3641E154EF5C2CBFA84C773EFE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.OnInterrupted_2D489A3641E154EF5C2CBFA84C773EFE
	 */
	struct ABP_Menu_Slasher27_C_OnInterrupted_2D489A3641E154EF5C2CBFA84C773EFE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.OnBlendOut_2D489A3641E154EF5C2CBFA84C773EFE
	 */
	struct ABP_Menu_Slasher27_C_OnBlendOut_2D489A3641E154EF5C2CBFA84C773EFE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.OnCompleted_2D489A3641E154EF5C2CBFA84C773EFE
	 */
	struct ABP_Menu_Slasher27_C_OnCompleted_2D489A3641E154EF5C2CBFA84C773EFE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.PlayWeaponInterupt
	 */
	struct ABP_Menu_Slasher27_C_PlayWeaponInterupt_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.Play_K27_PostProcess_Interupt_02
	 */
	struct ABP_Menu_Slasher27_C_Play_K27_PostProcess_Interupt_02_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.Play_K27_PostProcess_Interrupt_01
	 */
	struct ABP_Menu_Slasher27_C_Play_K27_PostProcess_Interrupt_01_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.Destroy_K27_PostProcess_IdleInterrupt_02
	 */
	struct ABP_Menu_Slasher27_C_Destroy_K27_PostProcess_IdleInterrupt_02_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.Destroy_K27_PostProcess_IdleInterrupt_01
	 */
	struct ABP_Menu_Slasher27_C_Destroy_K27_PostProcess_IdleInterrupt_01_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.ReceiveBeginPlay
	 */
	struct ABP_Menu_Slasher27_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.ReceiveEndPlay
	 */
	struct ABP_Menu_Slasher27_C_ReceiveEndPlay_Params
	{
	public:
		EEndPlayReason                                             EndPlayReason;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.RemoveAssetsBeforeDestroy
	 */
	struct ABP_Menu_Slasher27_C_RemoveAssetsBeforeDestroy_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.DisableCloth
	 */
	struct ABP_Menu_Slasher27_C_DisableCloth_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.EnableCloth
	 */
	struct ABP_Menu_Slasher27_C_EnableCloth_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.BeginSmokeIn
	 */
	struct ABP_Menu_Slasher27_C_BeginSmokeIn_Params
	{	};

	/**
	 * Function BP_Menu_Slasher27.BP_Menu_Slasher27_C.ExecuteUbergraph_BP_Menu_Slasher27
	 */
	struct ABP_Menu_Slasher27_C_ExecuteUbergraph_BP_Menu_Slasher27_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_GEEE[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
