#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DBDBots.AIDisplayDebugInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIDisplayDebugInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIGoalGeneratorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIGoalGeneratorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIIntentionValidatorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIIntentionValidatorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIPathValidatorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIPathValidatorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill
	 * Size -> 0x00A0 (FullSize[0x00D0] - InheritedSize[0x0030])
	 */
	class UAISkill : public UObject
	{
	public:
		struct FGameplayTagContainer                               RunContexts;                                             // 0x0030(0x0020) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       StopIfPausedByNavLinkProxy;                              // 0x0050(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S4Z9[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RunTimeLimit;                                            // 0x0054(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RunCooldownTime;                                         // 0x0058(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RunCooldownTimeDeviation;                                // 0x005C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              SkillNavigationFilterClass;                              // 0x0060(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UAISenseConfig*>                              SkillSenseConfigs;                                       // 0x0068(0x0010) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FKillerFilterItem>                           KillerFilter;                                            // 0x0078(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UBehaviorTree*                                       DynamicSubtree;                                          // 0x0088(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BUM7[0x18];                                  // 0x0090(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UObject*>                                     _pausedByObjects;                                        // 0x00A8(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5EWF[0x10];                                  // 0x00B8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ADBDAIBTController*                                  _aiControllerOwner;                                      // 0x00C8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_DirectionalMinigame
	 * Size -> 0x0068 (FullSize[0x0138] - InheritedSize[0x00D0])
	 */
	class UAISkill_DirectionalMinigame : public UAISkill
	{
	public:
		struct FAIRoll                                             InputRoll;                                               // 0x00D0(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 InputTimeMinimum;                                        // 0x00F4(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 InputTimeVariance;                                       // 0x0104(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8SQJ[0x24];                                  // 0x0114(0x0024) MISSED OFFSET (PADDING)

	public:
		void OnMinigameStart(TArray<EDirectionalInputKey> Sequence, int32_t currentIndex);
		void OnMinigameEnd(EDirectionalMinigameResult Result);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Diversion
	 * Size -> 0x0050 (FullSize[0x0120] - InheritedSize[0x00D0])
	 */
	class UAISkill_Diversion : public UAISkill
	{
	public:
		class FName                                                perkId;                                                  // 0x00D0(0x000C) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X7ZC[0x4];                                   // 0x00DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      DiversionFromGoalClasses;                                // 0x00E0(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic
		EAIDifficultyLevel                                         ThrowOnInteractablesAtDifficultyLevel;                   // 0x00F0(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_36TV[0x3];                                   // 0x00F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxThrowOnInteractableHalfAngle;                         // 0x00F4(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxMoveToTargetDistance;                                 // 0x00F8(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             NavMeshFindLocationExtents;                              // 0x00FC(0x000C) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PlanInterval;                                            // 0x0108(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RCCZ[0x14];                                  // 0x010C(0x0014) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Find
	 * Size -> 0x0040 (FullSize[0x0110] - InheritedSize[0x00D0])
	 */
	class UAISkill_Find : public UAISkill
	{
	public:
		class UClass*                                              FindClass;                                               // 0x00D0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        BlackboardWishListTag;                                   // 0x00D8(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchInterval;                                          // 0x00E4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MustBeSeen;                                              // 0x00E8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SFLO[0x7];                                   // 0x00E9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UObject*>                                     _currentWishedObjects;                                   // 0x00F0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_W0IL[0x10];                                  // 0x0100(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable
	 * Size -> 0x0018 (FullSize[0x0128] - InheritedSize[0x0110])
	 */
	class UAISkill_FindInteractable : public UAISkill_Find
	{
	public:
		class FString                                              RequiredInteractionId;                                   // 0x0110(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputInteractionType                                      RequiredInteractionInputType;                            // 0x0120(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OF9M[0x7];                                   // 0x0121(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable
	 * Size -> 0x0008 (FullSize[0x0130] - InheritedSize[0x0128])
	 */
	class UAISkill_FindCollectable : public UAISkill_FindInteractable
	{
	public:
		int32_t                                                    CollectUnderItemCount;                                   // 0x0128(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollectOverItemChargeRatio;                              // 0x012C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Camper
	 * Size -> 0x0008 (FullSize[0x0138] - InheritedSize[0x0130])
	 */
	class UAISkill_FindCollectable_Camper : public UAISkill_FindCollectable
	{
	public:
		float                                                      CollectUnderItemWeight;                                  // 0x0130(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollectOverWeightRatioDifference;                        // 0x0134(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Hatchet
	 * Size -> 0x0000 (FullSize[0x0130] - InheritedSize[0x0130])
	 */
	class UAISkill_FindCollectable_Hatchet : public UAISkill_FindCollectable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Searchable
	 * Size -> 0x0018 (FullSize[0x0148] - InheritedSize[0x0130])
	 */
	class UAISkill_FindCollectable_Searchable : public UAISkill_FindCollectable
	{
	public:
		float                                                      SearchIntervalAfterOpenSearchable;                       // 0x0130(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OpenSearchableRelevancyDuration;                         // 0x0134(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z9VK[0x8];                                   // 0x0138(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ASearchable*                                         _relevantSearchable;                                     // 0x0140(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Trap
	 * Size -> 0x0000 (FullSize[0x0130] - InheritedSize[0x0130])
	 */
	class UAISkill_FindCollectable_Trap : public UAISkill_FindCollectable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_CloseTelevisionNearGenerator
	 * Size -> 0x0060 (FullSize[0x0188] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_CloseTelevisionNearGenerator : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 MaximumCondemnedPercentToCloseTelevision;                // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 DistanceBetweenGeneratorAndTelevisionThreshold;          // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 BaseValue;                                               // 0x0148(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CloseTelevisionDistanceLinearWeight;                     // 0x0158(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CloseTelevisionMaximumDistanceFromCamper;                // 0x0168(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 MaxHeightDifferenceToCloseTelevisions;                   // 0x0178(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_Drone
	 * Size -> 0x0048 (FullSize[0x0170] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_Drone : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 BaseActiveWeight;                                        // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 BaseScoutingWeight;                                      // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FGameplayTag                                        ClawTrapStateTag;                                        // 0x0148(0x000C) Edit, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WTL5[0x4];                                   // 0x0154(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      ValidGoalObjectClasses;                                  // 0x0158(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic
		float                                                      DroneRadiusMargin;                                       // 0x0168(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6GUU[0x4];                                   // 0x016C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveCondemned
	 * Size -> 0x0040 (FullSize[0x0168] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_SolveCondemned : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 NearCondemnedWeight;                                     // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 HighCondemnedThreshold;                                  // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 SolveCondemnedBasicWeight;                               // 0x0148(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CondemnedLevelProportionalWeight;                        // 0x0158(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveRBT
	 * Size -> 0x0020 (FullSize[0x0148] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_SolveRBT : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 UrgencyGoalWeight;                                       // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 PriorityGoalWeight;                                      // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveSickness
	 * Size -> 0x0030 (FullSize[0x0158] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_SolveSickness : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 BaseGoalWeight;                                          // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 UrgencyGoalWeight;                                       // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 InteractingGoalPenaltyWeight;                            // 0x0148(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_StatusEffect
	 * Size -> 0x0010 (FullSize[0x0138] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_StatusEffect : public UAISkill_FindInteractable
	{
	public:
		struct FGameplayTag                                        RequiredPerkFlag;                                        // 0x0128(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InvertCondition;                                         // 0x0134(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B24T[0x3];                                   // 0x0135(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_StatusEffect_Plague
	 * Size -> 0x0000 (FullSize[0x0138] - InheritedSize[0x0138])
	 */
	class UAISkill_FindInteractable_StatusEffect_Plague : public UAISkill_FindInteractable_StatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_Waker
	 * Size -> 0x0000 (FullSize[0x0128] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_Waker : public UAISkill_FindInteractable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction
	 * Size -> 0x00B0 (FullSize[0x0180] - InheritedSize[0x00D0])
	 */
	class UAISkill_Interaction : public UAISkill
	{
	public:
		EPawnInputPressTypes                                       inputType;                                               // 0x00D0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionSkillInputModes                                InputMode;                                               // 0x00D1(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPawnInputPressTypes                                       CancelInputType;                                         // 0x00D2(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionCancelInputModes                               CancelInputMode;                                         // 0x00D3(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoLockInput;                                           // 0x00D4(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OU8X[0x3];                                   // 0x00D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIRoll                                             StartRoll;                                               // 0x00D8(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3IMH[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              StartInteractionID;                                      // 0x0100(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StopInteractionID;                                       // 0x0110(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinHoldInputTime;                                        // 0x0120(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoReleaseHoldInputWhenCharged;                         // 0x0124(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ABII[0x5B];                                  // 0x0125(0x005B) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_AttachRBT
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_AttachRBT : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_Clairvoyance
	 * Size -> 0x0018 (FullSize[0x0198] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_Clairvoyance : public UAISkill_Interaction
	{
	public:
		struct FGameplayTag                                        DropCooldownTag;                                         // 0x0180(0x000C) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DropCooldownDuration;                                    // 0x018C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAddToExistingDuration;                                  // 0x0190(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MLL2[0x7];                                   // 0x0191(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_ForThePeople
	 * Size -> 0x0018 (FullSize[0x0198] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_ForThePeople : public UAISkill_Interaction
	{
	public:
		unsigned char                                              UnknownData_5ALN[0x8];                                   // 0x0180(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              BlockInteractionId;                                      // 0x0188(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_GeneratorSecondaryInteraction
	 * Size -> 0x0020 (FullSize[0x01A0] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_GeneratorSecondaryInteraction : public UAISkill_Interaction
	{
	public:
		TArray<struct FPerkIdDropdown>                             Perks;                                                   // 0x0180(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                GeneratorSecondaryInteractionId;                         // 0x0190(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7EZZ[0x4];                                   // 0x019C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_InLocker
	 * Size -> 0x0050 (FullSize[0x01D0] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_InLocker : public UAISkill_Interaction
	{
	public:
		struct FDataTableDropdown                                  perkId;                                                  // 0x0180(0x0030) Edit, NativeAccessSpecifierPublic
		struct FGameplayTag                                        CooldownTag;                                             // 0x01B0(0x000C) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InitialRunningTime;                                      // 0x01BC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       StartRefreshingTime;                                     // 0x01C0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5Q3T[0x3];                                   // 0x01C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RefreshTimeMargin;                                       // 0x01C4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RefreshTimeAmount;                                       // 0x01C8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VJIO[0x4];                                   // 0x01CC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_InLocker_BuiltToLast
	 * Size -> 0x0000 (FullSize[0x01D0] - InheritedSize[0x01D0])
	 */
	class UAISkill_Interaction_InLocker_BuiltToLast : public UAISkill_Interaction_InLocker
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_InLocker_Flashbang
	 * Size -> 0x0000 (FullSize[0x01D0] - InheritedSize[0x01D0])
	 */
	class UAISkill_Interaction_InLocker_Flashbang : public UAISkill_Interaction_InLocker
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_InLocker_HeadOn
	 * Size -> 0x0010 (FullSize[0x01E0] - InheritedSize[0x01D0])
	 */
	class UAISkill_Interaction_InLocker_HeadOn : public UAISkill_Interaction_InLocker
	{
	public:
		struct FAITunableParameter                                 MaxKillerNearbyDistance;                                 // 0x01D0(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_InLocker_InnerHealing
	 * Size -> 0x0000 (FullSize[0x01D0] - InheritedSize[0x01D0])
	 */
	class UAISkill_Interaction_InLocker_InnerHealing : public UAISkill_Interaction_InLocker
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_Kill
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_Kill : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_RecoverWhileCrawling
	 * Size -> 0x0010 (FullSize[0x0190] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_RecoverWhileCrawling : public UAISkill_Interaction
	{
	public:
		TArray<struct FPerkIdDropdown>                             Perks;                                                   // 0x0180(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_Reel
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_Reel : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_SendToDeathBed
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_SendToDeathBed : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_SetGeneratorTrap
	 * Size -> 0x0020 (FullSize[0x01C0] - InheritedSize[0x01A0])
	 */
	class UAISkill_Interaction_SetGeneratorTrap : public UAISkill_Interaction_GeneratorSecondaryInteraction
	{
	public:
		unsigned char                                              UnknownData_I9O4[0x4];                                   // 0x01A0(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CheckKillerDistanceInterval;                             // 0x01A4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinKillerApproachingSpeed;                               // 0x01A8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MinKillerApproachingFastStreak;                          // 0x01AC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAITerrorLevel                                             TerrorLevelToSetTrap;                                    // 0x01B0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAITerrorLevel                                             TerrorLevelToSetTrapImmediately;                         // 0x01B1(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WAZ1[0x2];                                   // 0x01B2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TerrorLevelCloseRange;                                   // 0x01B4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BS8C[0x8];                                   // 0x01B8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_StaticBlast
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_Interaction_StaticBlast : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap
	 * Size -> 0x0010 (FullSize[0x0190] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionSetTrap : public UAISkill_Interaction
	{
	public:
		class UClass*                                              TrapClass;                                               // 0x0180(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDistanceFromPointOfInterest;                          // 0x0188(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDistanceFromAnotherSetTrap;                           // 0x018C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_Demogorgon
	 * Size -> 0x0000 (FullSize[0x0190] - InheritedSize[0x0190])
	 */
	class UAISkill_InteractionSetTrap_Demogorgon : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_DreamPallet
	 * Size -> 0x0000 (FullSize[0x0190] - InheritedSize[0x0190])
	 */
	class UAISkill_InteractionSetTrap_DreamPallet : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_DreamSnare
	 * Size -> 0x0000 (FullSize[0x0190] - InheritedSize[0x0190])
	 */
	class UAISkill_InteractionSetTrap_DreamSnare : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_Phantom
	 * Size -> 0x0000 (FullSize[0x0190] - InheritedSize[0x0190])
	 */
	class UAISkill_InteractionSetTrap_Phantom : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget
	 * Size -> 0x00B0 (FullSize[0x0230] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionTarget : public UAISkill_Interaction
	{
	public:
		EInteractionTargetRequirements                             TargetRequirement;                                       // 0x0180(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoSwapBestStimulusWithBestTarget;                      // 0x0181(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1Z8C[0x2];                                   // 0x0182(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StartMinRange;                                           // 0x0184(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartMaxRange;                                           // 0x0188(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMinRange;                                            // 0x018C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMaxRange;                                            // 0x0190(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartMaxHalfAngle;                                       // 0x0194(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMaxHalfAngle;                                        // 0x0198(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsMaxHalfAngle2D;                                        // 0x019C(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       TestMaxHalfAngleOnPath;                                  // 0x019D(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AD4R[0x2];                                   // 0x019E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              MaxAngleFilterClass;                                     // 0x01A0(0x0008) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionTargetInSightModes                             InSightMode;                                             // 0x01A8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V0L8[0x3];                                   // 0x01A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OutOfSightModeDelay;                                     // 0x01AC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetMoveAwayTooFastStopDelay;                          // 0x01B0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetMoveAwayTooFastCooldown;                           // 0x01B4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AlwaysStrafeAroundTarget;                                // 0x01B8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P9PD[0x7];                                   // 0x01B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIDetectedStimulus>                         _unfilteredTargets;                                      // 0x01C0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		TArray<struct FAIDetectedStimulus>                         _filteredTargets;                                        // 0x01D0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		TMap<class AActor*, struct FTargetMoveAwayToFastInfo>      _targetsMoveAwayTooFastInfo;                             // 0x01E0(0x0050) Transient, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Aim
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Aim : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_AmbushAttack
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_AmbushAttack : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_AmbushMode
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_AmbushMode : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Cloak
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Cloak : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Dash
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Dash : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack
	 * Size -> 0x0010 (FullSize[0x0240] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DashAttack : public UAISkill_InteractionTarget_Dash
	{
	public:
		float                                                      DashAttackUnderMaxRange;                                 // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DashAttackUnderMaxHalfAngle;                             // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttackType                                                ExpectedAttackType;                                      // 0x0238(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZVIT[0x7];                                   // 0x0239(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Cannibal
	 * Size -> 0x0000 (FullSize[0x0240] - InheritedSize[0x0240])
	 */
	class UAISkill_InteractionTarget_DashAttack_Cannibal : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Chainsaw
	 * Size -> 0x0000 (FullSize[0x0240] - InheritedSize[0x0240])
	 */
	class UAISkill_InteractionTarget_DashAttack_Chainsaw : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Demogorgon
	 * Size -> 0x0000 (FullSize[0x0240] - InheritedSize[0x0240])
	 */
	class UAISkill_InteractionTarget_DashAttack_Demogorgon : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashHillbilly
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DashHillbilly : public UAISkill_InteractionTarget_Dash
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DeadHard
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DeadHard : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Fire
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Fire : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Frenzy
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Frenzy : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_LungeAttack
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_LungeAttack : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_PhaseWalk
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_PhaseWalk : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ReloadDeathSlinger
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_ReloadDeathSlinger : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ShockTherapy
	 * Size -> 0x0008 (FullSize[0x0238] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_ShockTherapy : public UAISkill_InteractionTarget
	{
	public:
		float                                                      TargetToEvadePointMaxDistance;                           // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CastShockTimeBuffer;                                     // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Stalk
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Stalk : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StalkGhost
	 * Size -> 0x0010 (FullSize[0x0240] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_StalkGhost : public UAISkill_InteractionTarget_Stalk
	{
	public:
		float                                                      CautiousModeUnderTargetRange;                            // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CautiousModeSpeedFactor;                                 // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BackFromCautiousDelay;                                   // 0x0238(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MWIB[0x4];                                   // 0x023C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StalkShape
	 * Size -> 0x0008 (FullSize[0x0238] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_StalkShape : public UAISkill_InteractionTarget_Stalk
	{
	public:
		int32_t                                                    StalkRangeLimitedAtEvilTier;                             // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxStalkRangeWhenLimitedByEvilTier;                      // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StealthGhost
	 * Size -> 0x0008 (FullSize[0x0238] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_StealthGhost : public UAISkill_InteractionTarget
	{
	public:
		float                                                      CrouchSwapDelay;                                         // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7LWO[0x4];                                   // 0x0234(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Throw
	 * Size -> 0x0078 (FullSize[0x02A8] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_Throw : public UAISkill_InteractionTarget
	{
	public:
		EAIThrowPredictionModes                                    ThrowPredictionMode;                                     // 0x0230(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VRK6[0x3];                                   // 0x0231(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxAddPitchAngle;                                        // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAIThrowProjectileModes                                    ThrowProjectileMode;                                     // 0x0238(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_436W[0x3];                                   // 0x0239(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAITunableParameter                                 HoldInputTimeRandDeviation;                              // 0x023C(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 PitchAngleRandDeviation;                                 // 0x024C(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6V1H[0x4C];                                  // 0x025C(0x004C) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ThrowHatchet
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UAISkill_InteractionTarget_ThrowHatchet : public UAISkill_InteractionTarget_Throw
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ThrowPlague
	 * Size -> 0x0010 (FullSize[0x02B8] - InheritedSize[0x02A8])
	 */
	class UAISkill_InteractionTarget_ThrowPlague : public UAISkill_InteractionTarget_Throw
	{
	public:
		struct FGameplayTag                                        ProjectileDamageSickTargetTag;                           // 0x02A8(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VXWX[0x4];                                   // 0x02B4(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_TormentAttack
	 * Size -> 0x0030 (FullSize[0x0260] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_TormentAttack : public UAISkill_InteractionTarget
	{
	public:
		int32_t                                                    AdvancedAtNbDetectedTargets;                             // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAIRoll                                             AdvancedStartRoll;                                       // 0x0234(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XWEY[0x8];                                   // 0x0258(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_TormentMode
	 * Size -> 0x0010 (FullSize[0x0240] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_TormentMode : public UAISkill_InteractionTarget
	{
	public:
		float                                                      ChasedTargetToEvadePointMaxDistance;                     // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartTormentInPatrolAboveChargeRatio;                    // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartTormentInChaseAboveChargeRatio;                     // 0x0238(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HT2P[0x4];                                   // 0x023C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleport
	 * Size -> 0x0008 (FullSize[0x0188] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionTeleport : public UAISkill_Interaction
	{
	public:
		float                                                      BlockTeleportWhenPathGoalUnderRange;                     // 0x0180(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B5V9[0x4];                                   // 0x0184(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal
	 * Size -> 0x0060 (FullSize[0x01E8] - InheritedSize[0x0188])
	 */
	class UAISkill_InteractionTeleportEthereal : public UAISkill_InteractionTeleport
	{
	public:
		float                                                      TeleportPlanInterval;                                    // 0x0188(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxTeleportAlignHalfAngle;                               // 0x018C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AbortNotWorkingTeleportDelay;                            // 0x0190(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AbortAddRunCooldownPenaltyTime;                          // 0x0194(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IJSA[0x18];                                  // 0x0198(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              _onStimulusInstigator;                                   // 0x01B0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7CDG[0x30];                                  // 0x01B8(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal_Blink
	 * Size -> 0x0010 (FullSize[0x01F8] - InheritedSize[0x01E8])
	 */
	class UAISkill_InteractionTeleportEthereal_Blink : public UAISkill_InteractionTeleportEthereal
	{
	public:
		float                                                      StartBlinkAtWarpLocationRange;                           // 0x01E8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ValidateBlinkWarpRange;                                  // 0x01EC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlinkAboveSavedPathLength;                               // 0x01F0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
