#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DBDCompetence.EnduranceEffect
	 * Size -> 0x0010 (FullSize[0x0360] - InheritedSize[0x0350])
	 */
	class UEnduranceEffect : public UStatusEffect
	{
	public:
		class UClass*                                              _enduranceHighlightEffectClass;                          // 0x0350(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_D6KQ[0x8];                                   // 0x0358(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivatableEnduranceEffect
	 * Size -> 0x0000 (FullSize[0x0360] - InheritedSize[0x0360])
	 */
	class UActivatableEnduranceEffect : public UEnduranceEffect
	{
	public:
		void Authority_Start(float Duration);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AdjustableCooldownStatusEffect
	 * Size -> 0x0010 (FullSize[0x0360] - InheritedSize[0x0350])
	 */
	class UAdjustableCooldownStatusEffect : public UStatusEffect
	{
	public:
		struct FGameplayTag                                        CooldownModifierType;                                    // 0x0350(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_ZSHS[0x4];                                   // 0x035C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ExhaustedEffect
	 * Size -> 0x0008 (FullSize[0x0368] - InheritedSize[0x0360])
	 */
	class UExhaustedEffect : public UAdjustableCooldownStatusEffect
	{
	public:
		float                                                      CooldownModifier;                                        // 0x0360(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FXK0[0x4];                                   // 0x0364(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivatableExhaustedEffect
	 * Size -> 0x0000 (FullSize[0x0368] - InheritedSize[0x0368])
	 */
	class UActivatableExhaustedEffect : public UExhaustedEffect
	{
	public:
		void Authority_Start(float Duration);
		void Authority_OnHookCamper(const struct FGameplayTag& GameEvent, const struct FGameEventData& GameEventData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivateOnEventTimedStatusEffect
	 * Size -> 0x0030 (FullSize[0x0380] - InheritedSize[0x0350])
	 */
	class UActivateOnEventTimedStatusEffect : public UStatusEffect
	{
	public:
		class UClass*                                              _activationStrategyClass;                                // 0x0350(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FGameplayTagContainer                               _eventsToActivateOn;                                     // 0x0358(0x0020) Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate
		class UActivateOnEventBaseActivationStrategy*              _activationStrategy;                                     // 0x0378(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivateOnEventBaseActivationStrategy
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UActivateOnEventBaseActivationStrategy : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivateOnEventAlwaysActivationStrategy
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UActivateOnEventAlwaysActivationStrategy : public UActivateOnEventBaseActivationStrategy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivateOnEventTargetActivationStrategy
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UActivateOnEventTargetActivationStrategy : public UActivateOnEventBaseActivationStrategy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ActivateOnEventInstigatorActivationStrategy
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UActivateOnEventInstigatorActivationStrategy : public UActivateOnEventBaseActivationStrategy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Adrenaline
	 * Size -> 0x0040 (FullSize[0x0408] - InheritedSize[0x03C8])
	 */
	class UAdrenaline : public UPerk
	{
	public:
		class FName                                                _exhaustedEffectID;                                      // 0x03C8(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UOHK[0x4];                                   // 0x03D4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _speedEffect;                                            // 0x03D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _exhaustionEffect;                                       // 0x03E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _movementSpeedDuration;                                  // 0x03E8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _movementSpeedPercentage;                                // 0x03EC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_EXBN[0x18];                                  // 0x03F0(0x0018) MISSED OFFSET (PADDING)

	public:
		void Multicast_DispatchAdrenalineEvents(bool IsHealthy, float HealAmount);
		void Authority_AttemptApplyPerk();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AlertKillerRevealEffect
	 * Size -> 0x0000 (FullSize[0x0350] - InheritedSize[0x0350])
	 */
	class UAlertKillerRevealEffect : public UStatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AllHexTotemsAreActive
	 * Size -> 0x0018 (FullSize[0x0100] - InheritedSize[0x00E8])
	 */
	class UAllHexTotemsAreActive : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_985K[0x18];                                  // 0x00E8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AnyActorPairQueryRangeIsTrue
	 * Size -> 0x0010 (FullSize[0x0100] - InheritedSize[0x00F0])
	 */
	class UAnyActorPairQueryRangeIsTrue : public URangeBasedCondition
	{
	public:
		unsigned char                                              UnknownData_7CE0[0x10];                                  // 0x00F0(0x0010) MISSED OFFSET (PADDING)

	public:
		void OnInRangeChanged(bool inRange);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AnyMeansNecessary
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UAnyMeansNecessary : public UPerk
	{
	public:
		float                                                      _actionSpeedBonus[0x3];                                  // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_OQY6[0x4];                                   // 0x03D4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _anyMeansNecessaryActionSpeedEffect;                     // 0x03D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void Authority_OnPalletPulledUp(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.AnySurvivorHasObjectState
	 * Size -> 0x0070 (FullSize[0x0158] - InheritedSize[0x00E8])
	 */
	class UAnySurvivorHasObjectState : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_5XQ7[0x50];                                  // 0x00E8(0x0050) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        _stateTag;                                               // 0x0138(0x000C) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_070S[0x14];                                  // 0x0144(0x0014) MISSED OFFSET (PADDING)

	public:
		void OnSurvivorRemoved(class ACamperPlayer* Survivor);
		void OnSurvivorAdded(class ACamperPlayer* Survivor);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Babysitter
	 * Size -> 0x0038 (FullSize[0x0400] - InheritedSize[0x03C8])
	 */
	class UBabysitter : public UPerk
	{
	public:
		float                                                      _scratchMarkHidingTime[0x3];                             // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _hasteEffect[0x3];                                       // 0x03D4(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _showAuraTime[0x3];                                      // 0x03E0(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _cooldownTime[0x3];                                      // 0x03EC(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _perkEffect;                                             // 0x03F8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BabysitterEffect
	 * Size -> 0x0000 (FullSize[0x0350] - InheritedSize[0x0350])
	 */
	class UBabysitterEffect : public UStatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BaseIsPerkUsableCondition
	 * Size -> 0x0008 (FullSize[0x00F0] - InheritedSize[0x00E8])
	 */
	class UBaseIsPerkUsableCondition : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_NCGG[0x8];                                   // 0x00E8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BaseIsPlayerPerformingInteraction
	 * Size -> 0x0030 (FullSize[0x0118] - InheritedSize[0x00E8])
	 */
	class UBaseIsPlayerPerformingInteraction : public UEventDrivenModifierCondition
	{
	public:
		struct FGameplayTagContainer                               _interactionSemantics;                                   // 0x00E8(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_IP99[0x10];                                  // 0x0108(0x0010) MISSED OFFSET (PADDING)

	public:
		void UpdateIsTrue(class UInteractionDefinition* InteractionDefinition);
		void SetInteractionSemantics(const struct FGameplayTagContainer& interactionSemantics);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BaseLingeringStatusEffect
	 * Size -> 0x0008 (FullSize[0x0358] - InheritedSize[0x0350])
	 */
	class UBaseLingeringStatusEffect : public UStatusEffect
	{
	public:
		float                                                      _lingerDuration;                                         // 0x0350(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_ID62[0x4];                                   // 0x0354(0x0004) MISSED OFFSET (PADDING)

	public:
		void SetLingerDuration(float lingerDuration);
		void Authority_DeactivateEffect();
		void Authority_ActivateEffect();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BetterTogether
	 * Size -> 0x0068 (FullSize[0x0430] - InheritedSize[0x03C8])
	 */
	class UBetterTogether : public UPerk
	{
	public:
		bool                                                       ShouldRevealKiller;                                      // 0x03C8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       ShouldRevealSurvivors;                                   // 0x03C9(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GCTC[0x2];                                   // 0x03CA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RevealDistance;                                          // 0x03CC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class ADBDPlayer*>                                  _affectedCampers;                                        // 0x03D0(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HIUA[0x8];                                   // 0x03E0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              _genToReveal;                                            // 0x03E8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _durationByLevel[0x3];                                   // 0x03F0(0x000C) Edit, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7J16[0x24];                                  // 0x03FC(0x0024) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _timedSurvivorRevealEffect;                              // 0x0420(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _timedKillerRevealEffect;                                // 0x0428(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void OnStartedGeneratorRepair(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
		float GetRevealDistance();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BlessedStatusEffect
	 * Size -> 0x0010 (FullSize[0x0360] - InheritedSize[0x0350])
	 */
	class UBlessedStatusEffect : public UStatusEffect
	{
	public:
		unsigned char                                              UnknownData_TDQU[0x8];                                   // 0x0350(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _vignetteControllerBlueprint;                            // 0x0358(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void OnExitBoonRange();
		void OnEnterBoonRange();
		class ATotem* GetBoundTotem();
		float GetBoonTotemBlessingRange();
		void Authority_OnSurvivorRemovedFromGame(class ACamperPlayer* Survivor);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BloodEcho
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UBloodEcho : public UPerk
	{
	public:
		struct FGameplayTag                                        _statusEffectDurationTag;                                // 0x03C8(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _cooldownDuration[0x3];                                  // 0x03D4(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		float GetCooldownDurationAtLevel();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BoonDestroyer
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UBoonDestroyer : public UPerk
	{
	public:
		float                                                      _survivorAuraRevealDuration[0x3];                        // 0x03C8(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_3E2V[0x4];                                   // 0x03D4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _survivorRevealEffect;                                   // 0x03D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BoonPerk
	 * Size -> 0x0060 (FullSize[0x0480] - InheritedSize[0x0420])
	 */
	class UBoonPerk : public UTotemBoundPerk
	{
	public:
		class UClass*                                              _blessedStatusEffectClass;                               // 0x0420(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UBlessedStatusEffect*                                _blessedStatusEffect;                                    // 0x0428(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_7N5W[0x50];                                  // 0x0430(0x0050) MISSED OFFSET (PADDING)

	public:
		void Authority_OnSurvivorRemoved(class ACamperPlayer* Survivor);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BoonTotemIsActive
	 * Size -> 0x0018 (FullSize[0x0100] - InheritedSize[0x00E8])
	 */
	class UBoonTotemIsActive : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_IZYT[0x18];                                  // 0x00E8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Breakout
	 * Size -> 0x0088 (FullSize[0x0450] - InheritedSize[0x03C8])
	 */
	class UBreakout : public UPerk
	{
	public:
		class ASlasherPlayer*                                      _slasher;                                                // 0x03C8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class ADBDPlayer*                                          _playerOwner;                                            // 0x03D0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _hasteStatusEffect;                                      // 0x03D8(0x0008) Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _wiggleStatusEffect;                                     // 0x03E0(0x0008) Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _hasteEffect[0x3];                                       // 0x03E8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _wiggleEffect;                                           // 0x03F4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _survivorDistanceMax;                                    // 0x03F8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _isPerkActive;                                           // 0x03FC(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_MUVX[0x53];                                  // 0x03FD(0x0053) MISSED OFFSET (PADDING)

	public:
		void OnSlasherSet(class ASlasherPlayer* Slasher);
		void OnRep_IsPerkActive();
		void Authority_OnRangeChanged(bool inRange);
		void Authority_ImposeWiggleStatusEffect(class ACamperPlayer* Survivor);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.BuckleUp
	 * Size -> 0x0020 (FullSize[0x03E8] - InheritedSize[0x03C8])
	 */
	class UBuckleUp : public UPerk
	{
	public:
		float                                                      _perkDuration[0x3];                                      // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _hasteValue;                                             // 0x03D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _revealKillerStatusEffect;                               // 0x03D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _hasteStatusEffect;                                      // 0x03E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.CalmSpirit
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UCalmSpirit : public UPerk
	{
	public:
		class UClass*                                              _calmSpiritEffectClass;                                  // 0x03C8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _actionSpeed[0x3];                                       // 0x03D0(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KHR5[0x4];                                   // 0x03DC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Camaraderie
	 * Size -> 0x0058 (FullSize[0x0420] - InheritedSize[0x03C8])
	 */
	class UCamaraderie : public UPerk
	{
	public:
		float                                                      _percentUseItem[0x3];                                    // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _pauseTimer[0x3];                                        // 0x03D4(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _camaraderieNotificationEffectClass;                     // 0x03E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_OF5J[0x38];                                  // 0x03E8(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.CollectableOwnerSubjectProvider
	 * Size -> 0x0018 (FullSize[0x0060] - InheritedSize[0x0048])
	 */
	class UCollectableOwnerSubjectProvider : public UModifierSubjectProvider
	{
	public:
		unsigned char                                              UnknownData_TZVZ[0x18];                                  // 0x0048(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.CorruptIntervention
	 * Size -> 0x0070 (FullSize[0x0438] - InheritedSize[0x03C8])
	 */
	class UCorruptIntervention : public UPerk
	{
	public:
		unsigned char                                              _blockedGeneratorCount[0x3];                             // 0x03C8(0x0003) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_OTRM[0x1];                                   // 0x03CB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _generatorBlockDuration[0x3];                            // 0x03CC(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FLinearColor                                        _generatorAuraColorForKiller;                            // 0x03D8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class AGenerator*>                                  _blockedGenerators;                                      // 0x03E8(0x0010) Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_C9LD[0x40];                                  // 0x03F8(0x0040) MISSED OFFSET (PADDING)

	public:
		void OnRep_BlockedGenerators();
		void LevelReadyToBlockedGenerators();
		float GetGeneratorBlockDuration();
		void Authority_TryActivatePerk();
		void Authority_OnLevelReadyToPlay();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Coulrophobia
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UCoulrophobia : public UPerk
	{
	public:
		class UClass*                                              _coulrophobiaEffect;                                     // 0x03C8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _healPenalty[0x3];                                       // 0x03D0(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_P5QR[0x4];                                   // 0x03DC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.CruelConfinement
	 * Size -> 0x00A0 (FullSize[0x0468] - InheritedSize[0x03C8])
	 */
	class UCruelConfinement : public UPerk
	{
	public:
		float                                                      _effectiveRadius[0x3];                                   // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _blockDuration[0x3];                                     // 0x03D4(0x000C) Edit, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FLinearColor                                        _windowAuraColor;                                        // 0x03E0(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TMap<class AGenerator*, struct FWindowBlockableList>       _blockableLists;                                         // 0x03F0(0x0050) Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_6K9G[0x28];                                  // 0x0440(0x0028) MISSED OFFSET (PADDING)

	public:
		float GetEffectiveRadiusAtLevel();
		float GetBlockDurationAtLevel();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DarkDevotion
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UDarkDevotion : public UPerk
	{
	public:
		class UTerrorRadiusEmitterComponent*                       _obsessionTerrorRadiusEmitter;                           // 0x03C8(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _obsessionTerrorRadius;                                  // 0x03D0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _simulatedFixedDistance;                                 // 0x03D4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_N6DW[0x8];                                   // 0x03D8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DarkSense
	 * Size -> 0x0048 (FullSize[0x0410] - InheritedSize[0x03C8])
	 */
	class UDarkSense : public UPerk
	{
	public:
		float                                                      _killerRevealDuration[0x3];                              // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _darkSenseRevealRange;                                   // 0x03D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _timedRevealEffect;                                      // 0x03D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_74KU[0x30];                                  // 0x03E0(0x0030) MISSED OFFSET (PADDING)

	public:
		void Authority_OnInRangeChanged(bool inRange);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DBDConditionFactory
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UDBDConditionFactory : public UBlueprintFunctionLibrary
	{
	public:
		class UIsPlayerPerformingInteraction* STATIC_IsPlayerPerformingInteraction(const struct FGameplayTagContainer& interactionSemantics);
		class UDoesPerkHaveToken* STATIC_DoesPerkHaveToken(class UPerk* Perk);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DeadMansSwitchEffect
	 * Size -> 0x0000 (FullSize[0x0350] - InheritedSize[0x0350])
	 */
	class UDeadMansSwitchEffect : public UStatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DeceptionEffect
	 * Size -> 0x0008 (FullSize[0x0358] - InheritedSize[0x0350])
	 */
	class UDeceptionEffect : public UStatusEffect
	{
	public:
		bool                                                       _hideBloodTrailsWhenCamperFakeEnterLocker;               // 0x0350(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ID28[0x7];                                   // 0x0351(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DecisiveStrike
	 * Size -> 0x00A0 (FullSize[0x0468] - InheritedSize[0x03C8])
	 */
	class UDecisiveStrike : public UPerk
	{
	public:
		float                                                      _timeAfterUnhook[0x3];                                   // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _skillCheckDelay;                                        // 0x03D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _skillCheckBuffer;                                       // 0x03D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _killerHearsSkillCheckCue;                               // 0x03DC(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_PLIZ[0x7B];                                  // 0x03DD(0x007B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _increaseObsessionChanceEffect;                          // 0x0458(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasBeenAttempted;                                       // 0x0460(0x0001) Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_1ZMD[0x7];                                   // 0x0461(0x0007) MISSED OFFSET (PADDING)

	public:
		void OnUnhookedTimerEnded();
		void OnSkillCheck(bool hadInput, bool success, bool Bonus, ESkillCheckCustomType Type, class ADBDPlayer* Player);
		void OnRep_HasBeenAttempted();
		void OnPickUpEnded(class ADBDPlayer* picker);
		void OnOwnerPickedUp(class ADBDPlayer* picker);
		float GetDurationAfterUnhook();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DejaVu
	 * Size -> 0x0058 (FullSize[0x0420] - InheritedSize[0x03C8])
	 */
	class UDejaVu : public UPerk
	{
	public:
		int32_t                                                    _numGeneratorsToReveal;                                  // 0x03C8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _perkEffectDurations[0x3];                               // 0x03CC(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _actionSpeeds[0x3];                                      // 0x03D8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FLinearColor                                        _generatorAuraColor;                                     // 0x03E4(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_MIHV[0x4];                                   // 0x03F4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class AGenerator*>                                  _revealedGenerators;                                     // 0x03F8(0x0010) Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WJB3[0x18];                                  // 0x0408(0x0018) MISSED OFFSET (PADDING)

	public:
		void OnRep_RevealedGenerators();
		void LevelReadyToRevealOutlineGenerators();
		float GetPerkDurationAtLevel();
		float GetActionSpeedsAtLevel();
		void Authority_TryActivatePerk();
		void Authority_OnGeneratorRepaired(int32_t activatedGeneratorCount);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DelayedHealEffect
	 * Size -> 0x0008 (FullSize[0x0358] - InheritedSize[0x0350])
	 */
	class UDelayedHealEffect : public UStatusEffect
	{
	public:
		unsigned char                                              UnknownData_XYUS[0x8];                                   // 0x0350(0x0008) MISSED OFFSET (PADDING)

	public:
		void Authority_OnOwningCamperPickedUp(class ADBDPlayer* picker);
		void Authority_OnOwningCamperHealthChanged(ECamperDamageState before, ECamperDamageState after);
		void Authority_OnActivationTimerComplete();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DidGameEventOccurred
	 * Size -> 0x0038 (FullSize[0x0120] - InheritedSize[0x00E8])
	 */
	class UDidGameEventOccurred : public UEventDrivenModifierCondition
	{
	public:
		struct FGameplayTag                                        EventTag;                                                // 0x00E8(0x000C) Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_OPP2[0x2C];                                  // 0x00F4(0x002C) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Distortion
	 * Size -> 0x0030 (FullSize[0x03F8] - InheritedSize[0x03C8])
	 */
	class UDistortion : public UPerk
	{
	public:
		float                                                      _activationDurations[0x3];                               // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _auraBlockIsActive;                                      // 0x03D4(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LTGH[0x3];                                   // 0x03D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _regainTokenDurationTimer;                               // 0x03D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_G54K[0x1C];                                  // 0x03DC(0x001C) MISSED OFFSET (PADDING)

	public:
		void OnRep_AuraBlockIsActive();
		void OnAuraBlockedCosmetic();
		bool AuraBlockCanBeActive();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DoesPerkHaveToken
	 * Size -> 0x0010 (FullSize[0x00F8] - InheritedSize[0x00E8])
	 */
	class UDoesPerkHaveToken : public UEventDrivenModifierCondition
	{
	public:
		TWeakObjectPtr<class UPerk>                                _perk;                                                   // 0x00E8(0x0008) ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_82A4[0x8];                                   // 0x00F0(0x0008) MISSED OFFSET (PADDING)

	public:
		void SetPerk(class UPerk* Perk);
		void OnRep_Perk();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DownedByBasicAttack
	 * Size -> 0x0058 (FullSize[0x0140] - InheritedSize[0x00E8])
	 */
	class UDownedByBasicAttack : public UEventDrivenModifierCondition
	{
	public:
		bool                                                       _replicatedIsTrue;                                       // 0x00E8(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ET6K[0x57];                                  // 0x00E9(0x0057) MISSED OFFSET (PADDING)

	public:
		void OnRep_ReplicatedIsTrue();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.DyingLight
	 * Size -> 0x0040 (FullSize[0x0408] - InheritedSize[0x03C8])
	 */
	class UDyingLight : public UPerk
	{
	public:
		TArray<float>                                              _actionSpeedPenaltyPerToken;                             // 0x03C8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPrivate
		float                                                      _obsessionActionSpeedBonus;                              // 0x03D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                _obsessionStatusEffectID;                                // 0x03DC(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                _nonObsessionStatusEffectID;                             // 0x03E8(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_6WDZ[0x4];                                   // 0x03F4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UStatusEffect*>                               _survivorDebuffs;                                        // 0x03F8(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate

	public:
		void OnObsessionChanged(class ACamperPlayer* newObsession, class ACamperPlayer* previousObsession);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.EnduranceHighlightEffect
	 * Size -> 0x0008 (FullSize[0x0358] - InheritedSize[0x0350])
	 */
	class UEnduranceHighlightEffect : public UStatusEffect
	{
	public:
		unsigned char                                              UnknownData_F9ZN[0x8];                                   // 0x0350(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.ExposedEffect
	 * Size -> 0x0000 (FullSize[0x0360] - InheritedSize[0x0360])
	 */
	class UExposedEffect : public UAdjustableCooldownStatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.Fixated
	 * Size -> 0x0000 (FullSize[0x03C8] - InheritedSize[0x03C8])
	 */
	class UFixated : public UPerk
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.FlipFlop
	 * Size -> 0x0018 (FullSize[0x03E0] - InheritedSize[0x03C8])
	 */
	class UFlipFlop : public UPerk
	{
	public:
		float                                                      _recoveryProgressionConversionRatio[0x3];                // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _maxWiggleProgression[0x3];                              // 0x03D4(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void Authority_OnPickedUp(class ADBDPlayer* picker);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.FurtiveChase
	 * Size -> 0x0010 (FullSize[0x03D8] - InheritedSize[0x03C8])
	 */
	class UFurtiveChase : public UPerk
	{
	public:
		int32_t                                                    _maxTokensByLevel[0x3];                                  // 0x03C8(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    _terrorRadiusSuppressionPerToken;                        // 0x03D4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.GateBlockerEffect
	 * Size -> 0x0038 (FullSize[0x0388] - InheritedSize[0x0350])
	 */
	class UGateBlockerEffect : public UStatusEffect
	{
	public:
		float                                                      _blockGateLingeringTime;                                 // 0x0350(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_M8GK[0x34];                                  // 0x0354(0x0034) MISSED OFFSET (PADDING)

	public:
		void RemoveCantEscapeFlag();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HasActiveHeartbeatEmitters
	 * Size -> 0x0020 (FullSize[0x0108] - InheritedSize[0x00E8])
	 */
	class UHasActiveHeartbeatEmitters : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_9XLA[0x20];                                  // 0x00E8(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HasCleansedTotemInnerStrength
	 * Size -> 0x0018 (FullSize[0x0100] - InheritedSize[0x00E8])
	 */
	class UHasCleansedTotemInnerStrength : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_DVQ0[0x18];                                  // 0x00E8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HasFlag
	 * Size -> 0x0040 (FullSize[0x0128] - InheritedSize[0x00E8])
	 */
	class UHasFlag : public UEventDrivenModifierCondition
	{
	public:
		struct FGameplayTag                                        _flag;                                                   // 0x00E8(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5DW3[0x34];                                  // 0x00F4(0x0034) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HasLineOfSightQueryComponent
	 * Size -> 0x0010 (FullSize[0x00C8] - InheritedSize[0x00B8])
	 */
	class UHasLineOfSightQueryComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_XS8Z[0x10];                                  // 0x00B8(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HasPlayerReachedWiggleFillPercentCondition
	 * Size -> 0x0008 (FullSize[0x00F0] - InheritedSize[0x00E8])
	 */
	class UHasPlayerReachedWiggleFillPercentCondition : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_WSCY[0x4];                                   // 0x00E8(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       _isWigglePercentReached;                                 // 0x00EC(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_BIHF[0x3];                                   // 0x00ED(0x0003) MISSED OFFSET (PADDING)

	public:
		void OnRep_IsWigglePercentReached();
		void Authority_OnOwnerWiggleChargePercentChanged(class UChargeableComponent* ChargeableComponent, float PercentCompletionChange, float TotalPercentComplete);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HeadOn
	 * Size -> 0x0078 (FullSize[0x0440] - InheritedSize[0x03C8])
	 */
	class UHeadOn : public UPerk
	{
	public:
		bool                                                       IsPerformingHeadOn;                                      // 0x03C8(0x0001) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ExhaustOnlyOnSuccessfulStun;                             // 0x03C9(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       StunKillersEnteringStunZone;                             // 0x03CA(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A4IM[0x1];                                   // 0x03CB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _hideDuration[0x3];                                      // 0x03CC(0x000C) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class ALocker*                                             _locker;                                                 // 0x03D8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_14NY[0x30];                                  // 0x03E0(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class AActor*>                                      _stunnableActorsInZone;                                  // 0x0410(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_3XPY[0x20];                                  // 0x0420(0x0020) MISSED OFFSET (PADDING)

	public:
		void OnPawnOverlapExit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);
		void OnPawnOverlapEnter(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
		void OnHeadOnAnimationComplete();
		void Multicast_TriggerStunOnActor(class UObject* stunnableInterfaceUObject, class ADBDPlayer* stunner);
		float GetHideDuration();
		bool CanApplyHeadOnInteraction();
		void Authority_ActivatePerk();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HemorrhageStatusEffect
	 * Size -> 0x0070 (FullSize[0x03D0] - InheritedSize[0x0360])
	 */
	class UHemorrhageStatusEffect : public UAdjustableCooldownStatusEffect
	{
	public:
		float                                                      _cooldownFXTime;                                         // 0x0360(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _removeEffectWhenFullyHealed;                            // 0x0364(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HRMZ[0x6B];                                  // 0x0365(0x006B) MISSED OFFSET (PADDING)

	public:
		void OnStoppedHealing(class ADBDPlayer* Instigator, class ADBDPlayer* Target);
		void Authority_OnSurvivorHealed(const struct FCamperHealResult& healResult);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HexPerk
	 * Size -> 0x0028 (FullSize[0x0448] - InheritedSize[0x0420])
	 */
	class UHexPerk : public UTotemBoundPerk
	{
	public:
		TArray<class ADBDPlayer*>                                  _playersWhoKnowCurse;                                    // 0x0420(0x0010) Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate
		TArray<class ADBDPlayer*>                                  _oldPlayersWhoKnowCurse;                                 // 0x0430(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_BSTZ[0x8];                                   // 0x0440(0x0008) MISSED OFFSET (PADDING)

	public:
		void UpdateCursedStatusViewOnLocalPlayer();
		void OnRep_PlayersWhoKnowCurse();
		bool IsCurseRevealedToPlayer(class ADBDPlayer* Player);
		void Authority_SetCurseRevealedToPlayer(class ADBDPlayer* Player, bool revealed);
		void Authority_RevealCurseToAllSurvivors(bool revealed);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HexDevourHope
	 * Size -> 0x0080 (FullSize[0x04C8] - InheritedSize[0x0448])
	 */
	class UHexDevourHope : public UHexPerk
	{
	public:
		class UClass*                                              _devourHopeSpeedStatusEffect;                            // 0x0448(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UClass*                                              _exposedStatusEffect;                                    // 0x0450(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _rangeFromUnhookedSurvivorNeeded;                        // 0x0458(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KCRE[0x4];                                   // 0x045C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    _tokenThresholdToImposeSpeedBoost;                       // 0x0460(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    _tokenThresholdToImposeExposeEffect;                     // 0x0464(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    _tokenThresholdToImposeAbilityToKill;                    // 0x0468(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_G51L[0x4];                                   // 0x046C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTagContainer                               _attackGameEvents;                                       // 0x0470(0x0020) Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate
		float                                                      _moveSpeedIncrement[0x3];                                // 0x0490(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_TRJ4[0x14];                                  // 0x049C(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                _vulnerabilityStatusViewID;                              // 0x04B0(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_62CR[0xC];                                   // 0x04BC(0x000C) MISSED OFFSET (PADDING)

	public:
		float GetRangeFromUnhookedSurvivorNeeded(int32_t PerkLevel);
		float GetMoveSpeedIncrement(int32_t PerkLevel);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDCompetence.HexHauntedGround
	 * Size -> 0x0020 (FullSize[0x0468] - InheritedSize[0x0448])
	 */
