#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.UpdateScale
	 */
	struct UCoreBaseUserWidget_UpdateScale_Params
	{
	public:
		float                                                      Scale;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.StopAnimationByName
	 */
	struct UCoreBaseUserWidget_StopAnimationByName_Params
	{
	public:
		class FName                                                animName;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.RegisterForInput
	 */
	struct UCoreBaseUserWidget_RegisterForInput_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.PlayAnimationByName
	 */
	struct UCoreBaseUserWidget_PlayAnimationByName_Params
	{
	public:
		class FName                                                animName;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      starttime;                                               // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    loopcount;                                               // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EUMGSequencePlayMode                                       PlayMode;                                                // 0x0014(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8XPO[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      PlaybackSpeed;                                           // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x001C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.OnControlModeChangedBP
	 */
	struct UCoreBaseUserWidget_OnControlModeChangedBP_Params
	{
	public:
		EControlMode                                               controlMode;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.GetAnimationByName
	 */
	struct UCoreBaseUserWidget_GetAnimationByName_Params
	{
	public:
		class FName                                                animName;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_96KR[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UWidgetAnimation*                                    ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseUserWidget.DeregisterFromInput
	 */
	struct UCoreBaseUserWidget_DeregisterFromInput_Params
	{	};

	/**
	 * Function DBDUIViewsCore.ArchiveCompendiumTooltipWidget.SetTooltipData
	 */
	struct UArchiveCompendiumTooltipWidget_SetTooltipData_Params
	{
	public:
		struct FCompendiumButtonData                               tooltipViewData;                                         // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.ArchiveCompendiumTooltipWidget.Reset
	 */
	struct UArchiveCompendiumTooltipWidget_Reset_Params
	{	};

	/**
	 * Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetTooltipData
	 */
	struct UArchiveNodeTooltipWidget_SetTooltipData_Params
	{
	public:
		struct FArchiveNodeViewData                                NodeViewData;                                            // 0x0000(0x00B8)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetNodeType
	 */
	struct UArchiveNodeTooltipWidget_SetNodeType_Params
	{
	public:
		EArchiveNodeType                                           Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.ArchiveNodeTooltipWidget.Reset
	 */
	struct UArchiveNodeTooltipWidget_Reset_Params
	{	};

	/**
	 * Function DBDUIViewsCore.AspectRatioBox.SetAspectRatio
	 */
	struct UAspectRatioBox_SetAspectRatio_Params
	{
	public:
		float                                                      inAspectRatio;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.AspectRatioBox.ClearAspectRatio
	 */
	struct UAspectRatioBox_ClearAspectRatio_Params
	{	};

	/**
	 * Function DBDUIViewsCore.AspectRatioBoxSlot.SetVerticalAlignment
	 */
	struct UAspectRatioBoxSlot_SetVerticalAlignment_Params
	{
	public:
		EVerticalAlignment                                         inVerticalAlignment;                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.AspectRatioBoxSlot.SetPadding
	 */
	struct UAspectRatioBoxSlot_SetPadding_Params
	{
	public:
		struct FMargin                                             InPadding;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.AspectRatioBoxSlot.SetHorizontalAlignment
	 */
	struct UAspectRatioBoxSlot_SetHorizontalAlignment_Params
	{
	public:
		EHorizontalAlignment                                       inHorizontalAlignment;                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CharacterTooltipWidget.SetTooltipData
	 */
	struct UCharacterTooltipWidget_SetTooltipData_Params
	{
	public:
		struct FCharacterTooltipViewData                           characterViewData;                                       // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CharacterTooltipWidget.SetLevel
	 */
	struct UCharacterTooltipWidget_SetLevel_Params
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CharacterTooltipWidget.SetDifficulty
	 */
	struct UCharacterTooltipWidget_SetDifficulty_Params
	{
	public:
		ECharacterDifficulty                                       Difficulty;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutStackCount
	 */
	struct UCoreBaseLoadoutPartWidget_SetLoadoutStackCount_Params
	{
	public:
		int32_t                                                    StackCount;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartRarity
	 */
	struct UCoreBaseLoadoutPartWidget_SetLoadoutPartRarity_Params
	{
	public:
		EItemRarity                                                Rarity;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartIcon
	 */
	struct UCoreBaseLoadoutPartWidget_SetLoadoutPartIcon_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetVisible
	 */
	struct UCoreButtonWidget_SetVisible_Params
	{
	public:
		EButtonWidgetVisibility                                    visible;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetRepeatable
	 */
	struct UCoreButtonWidget_SetRepeatable_Params
	{
	public:
		bool                                                       isRepeatable;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_EJ6J[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UCurveFloat*                                         repetitionDelayCurve;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetPressable
	 */
	struct UCoreButtonWidget_SetPressable_Params
	{
	public:
		bool                                                       isPressable;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetLabel
	 */
	struct UCoreButtonWidget_SetLabel_Params
	{
	public:
		class FText                                                label;                                                   // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetHoverable
	 */
	struct UCoreButtonWidget_SetHoverable_Params
	{
	public:
		bool                                                       isHoverable;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetHoldable
	 */
	struct UCoreButtonWidget_SetHoldable_Params
	{
	public:
		bool                                                       isHoldable;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetEnabled
	 */
	struct UCoreButtonWidget_SetEnabled_Params
	{
	public:
		bool                                                       IsEnabled;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetClickable
	 */
	struct UCoreButtonWidget_SetClickable_Params
	{
	public:
		bool                                                       isClickable;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetChargeable
	 */
	struct UCoreButtonWidget_SetChargeable_Params
	{
	public:
		bool                                                       isChargeable;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetBackground
	 */
	struct UCoreButtonWidget_SetBackground_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetAlignment
	 */
	struct UCoreButtonWidget_SetAlignment_Params
	{
	public:
		ETextJustify                                               newAlignment;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.SetAdditionalIcon
	 */
	struct UCoreButtonWidget_SetAdditionalIcon_Params
	{	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnUnhoveredDelegate__DelegateSignature
	 */
	struct UCoreButtonWidget_OnUnhoveredDelegate__DelegateSignature_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnUnhovered
	 */
	struct UCoreButtonWidget_OnUnhovered_Params
	{	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnReleasedDelegate__DelegateSignature
	 */
	struct UCoreButtonWidget_OnReleasedDelegate__DelegateSignature_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnReleased
	 */
	struct UCoreButtonWidget_OnReleased_Params
	{	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnPressedDelegate__DelegateSignature
	 */
	struct UCoreButtonWidget_OnPressedDelegate__DelegateSignature_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnPressed
	 */
	struct UCoreButtonWidget_OnPressed_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnInternalUnhovered
	 */
	struct UCoreButtonWidget_OnInternalUnhovered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnInternalReleased
	 */
	struct UCoreButtonWidget_OnInternalReleased_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnInternalPressed
	 */
	struct UCoreButtonWidget_OnInternalPressed_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnInternalHovered
	 */
	struct UCoreButtonWidget_OnInternalHovered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnInternalClicked
	 */
	struct UCoreButtonWidget_OnInternalClicked_Params
	{	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnHoveredDelegate__DelegateSignature
	 */
	struct UCoreButtonWidget_OnHoveredDelegate__DelegateSignature_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnHovered
	 */
	struct UCoreButtonWidget_OnHovered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnEnabledChanged
	 */
	struct UCoreButtonWidget_OnEnabledChanged_Params
	{
	public:
		bool                                                       IsEnabled;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnClickedDelegate__DelegateSignature
	 */
	struct UCoreButtonWidget_OnClickedDelegate__DelegateSignature_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnClicked
	 */
	struct UCoreButtonWidget_OnClicked_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.OnAlignmentChanged
	 */
	struct UCoreButtonWidget_OnAlignmentChanged_Params
	{
	public:
		ETextJustify                                               newAlignment;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.IsEnabled
	 */
	struct UCoreButtonWidget_IsEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreButtonWidget.GetHitzonePaintSpaceGeometry
	 */
	struct UCoreButtonWidget_GetHitzonePaintSpaceGeometry_Params
	{
	public:
		struct FGeometry                                           ReturnValue;                                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.UpdateBackgroundSkin
	 */
	struct UCoreSelectableButtonWidget_UpdateBackgroundSkin_Params
	{
	public:
		class UMaterialInterface*                                  skinMaterial;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.SetSelected
	 */
	struct UCoreSelectableButtonWidget_SetSelected_Params
	{
	public:
		bool                                                       IsSelected;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.SetSelectable
	 */
	struct UCoreSelectableButtonWidget_SetSelectable_Params
	{
	public:
		bool                                                       IsSelectable;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreSelectableButtonWidget.OnSelectedChangedDelegate__DelegateSignature
	 */
	struct UCoreSelectableButtonWidget_OnSelectedChangedDelegate__DelegateSignature_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsSelected;                                              // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.OnSelectedChanged
	 */
	struct UCoreSelectableButtonWidget_OnSelectedChanged_Params
	{
	public:
		bool                                                       IsSelected;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction DBDUIViewsCore.CoreSelectableButtonWidget.OnSelectedAgainDelegate__DelegateSignature
	 */
	struct UCoreSelectableButtonWidget_OnSelectedAgainDelegate__DelegateSignature_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.IsSelected
	 */
	struct UCoreSelectableButtonWidget_IsSelected_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreSelectableButtonWidget.IsSelectable
	 */
	struct UCoreSelectableButtonWidget_IsSelectable_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateVisualState
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_UpdateVisualState_Params
	{
	public:
		struct FArchiveChallengeReminderViewData                   Data;                                                    // 0x0000(0x00D0)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateProgressBar
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_UpdateProgressBar_Params
	{
	public:
		float                                                      Progress;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.UpdateActiveState
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_UpdateActiveState_Params
	{
	public:
		bool                                                       IsActive;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       PlayAnimation;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SwapChallenge
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_SwapChallenge_Params
	{
	public:
		struct FArchiveChallengeReminderViewData                   Data;                                                    // 0x0000(0x00D0)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetSlotSelectorState
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_SetSlotSelectorState_Params
	{
	public:
		bool                                                       isSelectorOpen;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetQuestNodeHoverEffect
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_SetQuestNodeHoverEffect_Params
	{
	public:
		bool                                                       IsHovered;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.SetData
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_SetData_Params
	{
	public:
		struct FArchiveChallengeReminderViewData                   Data;                                                    // 0x0000(0x00D0)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.InitVisualState
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_InitVisualState_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.Init
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_Init_Params
	{
	public:
		EPlayerRole                                                Role;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget.ClearData
	 */
	struct UCoreArchiveChallengeReminderSlotWidget_ClearData_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetLevelProgressionVisual
	 */
	struct UCoreArchiveCompendiumButtonWidget_SetLevelProgressionVisual_Params
	{
	public:
		int32_t                                                    buttonLevel;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EArchivesStoryLevelStatus                                  levelStatus;                                             // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetGhostStory
	 */
	struct UCoreArchiveCompendiumButtonWidget_SetGhostStory_Params
	{
	public:
		bool                                                       isGhostStory;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetButtonVisual
	 */
	struct UCoreArchiveCompendiumButtonWidget_SetButtonVisual_Params
	{
	public:
		struct FCompendiumButtonData                               buttonData;                                              // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.SetButtonData
	 */
	struct UCoreArchiveCompendiumButtonWidget_SetButtonData_Params
	{
	public:
		struct FCompendiumButtonData                               buttonData;                                              // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.ResetVisuals
	 */
	struct UCoreArchiveCompendiumButtonWidget_ResetVisuals_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.OnButtonUnhovered
	 */
	struct UCoreArchiveCompendiumButtonWidget_OnButtonUnhovered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.OnButtonHovered
	 */
	struct UCoreArchiveCompendiumButtonWidget_OnButtonHovered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumButtonWidget.GetTomeId
	 */
	struct UCoreArchiveCompendiumButtonWidget_GetTomeId_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreTabContentWidget.StopFadeInTweening
	 */
	struct UCoreTabContentWidget_StopFadeInTweening_Params
	{
	public:
		float                                                      opacityValue;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreTabContentWidget.ResetFade
	 */
	struct UCoreTabContentWidget_ResetFade_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreTabContentWidget.FadeOutContent
	 */
	struct UCoreTabContentWidget_FadeOutContent_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreTabContentWidget.FadeInContent
	 */
	struct UCoreTabContentWidget_FadeInContent_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.SetGridSlot
	 */
	struct UCoreArchiveCompendiumWidget_SetGridSlot_Params
	{
	public:
		class UGridSlot*                                           GridSlot;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Index;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.ResetScroll
	 */
	struct UCoreArchiveCompendiumWidget_ResetScroll_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.Reset
	 */
	struct UCoreArchiveCompendiumWidget_Reset_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.OnPastStoryClicked
	 */
	struct UCoreArchiveCompendiumWidget_OnPastStoryClicked_Params
	{
	public:
		class UCoreButtonWidget*                                   Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.CreateGhostStories
	 */
	struct UCoreArchiveCompendiumWidget_CreateGhostStories_Params
	{
	public:
		int32_t                                                    currentStoryNum;                                         // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveCompendiumWidget.CreateAndAddButtonToGrid
	 */
	struct UCoreArchiveCompendiumWidget_CreateAndAddButtonToGrid_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_0F29[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UCoreArchiveCompendiumButtonWidget*                  ReturnValue;                                             // 0x0008(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetVoiceOverText
	 */
	struct UCoreArchiveJournalImageViewerWidget_SetVoiceOverText_Params
	{
	public:
		class FText                                                playVoiceOverText;                                       // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                stopVoiceOverText;                                       // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                autoplayVoiceOverText;                                   // 0x0030(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetTextVisibilityInputText
	 */
	struct UCoreArchiveJournalImageViewerWidget_SetTextVisibilityInputText_Params
	{
	public:
		class FText                                                DisplayText;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                hideText;                                                // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetScrollData
	 */
	struct UCoreArchiveJournalImageViewerWidget_SetScrollData_Params
	{
	public:
		class FText                                                journalEntryScrollPromptText;                            // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.SetData
	 */
	struct UCoreArchiveJournalImageViewerWidget_SetData_Params
	{
	public:
		struct FArchivesVignetteEntryViewData                      Data;                                                    // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       hasTitle;                                                // 0x0070(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       hasDescription;                                          // 0x0071(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.OnVoiceOverPlay
	 */
	struct UCoreArchiveJournalImageViewerWidget_OnVoiceOverPlay_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.OnVoiceOverAutoPlay
	 */
	struct UCoreArchiveJournalImageViewerWidget_OnVoiceOverAutoPlay_Params
	{
	public:
		bool                                                       autoplay;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalImageViewerWidget.OnTextVisibilityChanged
	 */
	struct UCoreArchiveJournalImageViewerWidget_OnTextVisibilityChanged_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.ShowImageViewer
	 */
	struct UCoreArchiveJournalWidget_ShowImageViewer_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetVoiceOverText
	 */
	struct UCoreArchiveJournalWidget_SetVoiceOverText_Params
	{
	public:
		class FText                                                playVoiceOverText;                                       // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                stopVoiceOverText;                                       // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                autoplayVoiceOverText;                                   // 0x0030(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetVoiceOverButtonsVisibility
	 */
	struct UCoreArchiveJournalWidget_SetVoiceOverButtonsVisibility_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetVignetteText
	 */
	struct UCoreArchiveJournalWidget_SetVignetteText_Params
	{
	public:
		class FText                                                titleText;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                subtitleText;                                            // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetTopFogOffset
	 */
	struct UCoreArchiveJournalWidget_SetTopFogOffset_Params
	{
	public:
		bool                                                       hasTitle;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       hasDescription;                                          // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetEntryText
	 */
	struct UCoreArchiveJournalWidget_SetEntryText_Params
	{
	public:
		class FText                                                titleText;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                descriptionText;                                         // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetEntryImage
	 */
	struct UCoreArchiveJournalWidget_SetEntryImage_Params
	{
	public:
		class FText                                                titleText;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                descriptionText;                                         // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_D9ZY[0x30];                                  // 0x0030(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      textureOffset;                                           // 0x0060(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.SetBottomFogOffset
	 */
	struct UCoreArchiveJournalWidget_SetBottomFogOffset_Params
	{
	public:
		bool                                                       HasAudio;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnVoiceOverPlay
	 */
	struct UCoreArchiveJournalWidget_OnVoiceOverPlay_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnVoiceOverAutoPlay
	 */
	struct UCoreArchiveJournalWidget_OnVoiceOverAutoPlay_Params
	{
	public:
		bool                                                       autoplay;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnVignetteEntrySelected
	 */
	struct UCoreArchiveJournalWidget_OnVignetteEntrySelected_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnVignetteCinematicSelected
	 */
	struct UCoreArchiveJournalWidget_OnVignetteCinematicSelected_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnVignetteButtonSelected
	 */
	struct UCoreArchiveJournalWidget_OnVignetteButtonSelected_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnRightArrowTriggered
	 */
	struct UCoreArchiveJournalWidget_OnRightArrowTriggered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnRewardImageLoaded
	 */
	struct UCoreArchiveJournalWidget_OnRewardImageLoaded_Params
	{
	public:
		unsigned char                                              UnknownData_XW5U[0x30];                                  // 0x0000(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		bool                                                       success;                                                 // 0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_DU84[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FText                                                titleText;                                               // 0x0038(0x0018)  (Parm, NativeAccessSpecifierPublic)
		class FText                                                descriptionText;                                         // 0x0050(0x0018)  (Parm, NativeAccessSpecifierPublic)
		float                                                      textureOffset;                                           // 0x0068(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnLeftArrowTriggered
	 */
	struct UCoreArchiveJournalWidget_OnLeftArrowTriggered_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnJournalEntriesUnlocked
	 */
	struct UCoreArchiveJournalWidget_OnJournalEntriesUnlocked_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.OnFirstJournalEntryUnlocked
	 */
	struct UCoreArchiveJournalWidget_OnFirstJournalEntryUnlocked_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveJournalWidget.InitializeArrow
	 */
	struct UCoreArchiveJournalWidget_InitializeArrow_Params
	{
	public:
		class UCoreInputSwitcherWidget*                            arrowWidget;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Active;                                                  // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveLevelProgressionWidget.OnTomeLevelUnlockedAnimation
	 */
	struct UCoreArchiveLevelProgressionWidget_OnTomeLevelUnlockedAnimation_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveLevelProgressionWidget.OnStoryLevelSelected
	 */
	struct UCoreArchiveLevelProgressionWidget_OnStoryLevelSelected_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.SetScrollData
	 */
	struct UCoreArchiveMenuWidget_SetScrollData_Params
	{
	public:
		class FText                                                vignetteListScrollPromptText;                            // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                journalEntryScrollPromptText;                            // 0x0018(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnSlotSelectionCancelled
	 */
	struct UCoreArchiveMenuWidget_OnSlotSelectionCancelled_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnSlotSelected
	 */
	struct UCoreArchiveMenuWidget_OnSlotSelected_Params
	{
	public:
		EPlayerRole                                                Role;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnMenuTabSelectedAgain
	 */
	struct UCoreArchiveMenuWidget_OnMenuTabSelectedAgain_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnMenuTabSelected
	 */
	struct UCoreArchiveMenuWidget_OnMenuTabSelected_Params
	{
	public:
		class UCoreSelectableButtonWidget*                         selectedButton;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnInfoButtonClicked
	 */
	struct UCoreArchiveMenuWidget_OnInfoButtonClicked_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.OnChallengeReminderClick
	 */
	struct UCoreArchiveMenuWidget_OnChallengeReminderClick_Params
	{
	public:
		class UCoreButtonWidget*                                   Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveMenuWidget.GetTimeRemainingLabelFromMenuState
	 */
	struct UCoreArchiveMenuWidget_GetTimeRemainingLabelFromMenuState_Params
	{
	public:
		EArchiveMenuState                                          menuState;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_BQOD[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FText                                                ReturnValue;                                             // 0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveObjectiveWidget.SetData
	 */
	struct UCoreArchiveObjectiveWidget_SetData_Params
	{
	public:
		struct FArchiveNodeObjectiveViewData                       objectiveData;                                           // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBasePopupWidget.Show
	 */
	struct UCoreBasePopupWidget_Show_Params
	{
	public:
		class UBasePopupViewData*                                  Data;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreBasePopupWidget.Hide
	 */
	struct UCoreBasePopupWidget_Hide_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreGenericPopupWidget.OnRegressionAction
	 */
	struct UCoreGenericPopupWidget_OnRegressionAction_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreGenericPopupWidget.OnProgressionAction
	 */
	struct UCoreGenericPopupWidget_OnProgressionAction_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreGenericPopupWidget.OnAlternativeAction
	 */
	struct UCoreGenericPopupWidget_OnAlternativeAction_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchivePassPurchasePopupWidget.GetTranslatedAvailabilityTitleText
	 */
	struct UCoreArchivePassPurchasePopupWidget_GetTranslatedAvailabilityTitleText_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.UnbindFromPath
	 */
	struct UCoreArchiveQuestMapWidget_UnbindFromPath_Params
	{
	public:
		class UCoreArchiveQuestPathWidget*                         Path;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.UnbindFromNode
	 */
	struct UCoreArchiveQuestMapWidget_UnbindFromNode_Params
	{
	public:
		class UCoreArchiveQuestNodeWidget*                         Node;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.SetupPath
	 */
	struct UCoreArchiveQuestMapWidget_SetupPath_Params
	{
	public:
		struct FArchiveMapPathViewData                             PathData;                                                // 0x0000(0x002C)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.SetupNode
	 */
	struct UCoreArchiveQuestMapWidget_SetupNode_Params
	{
	public:
		struct FArchiveNodeGraphViewData                           NodeData;                                                // 0x0000(0x00F0)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.OnNodeUnhovered
	 */
	struct UCoreArchiveQuestMapWidget_OnNodeUnhovered_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.OnNodesRevealCompleted
	 */
	struct UCoreArchiveQuestMapWidget_OnNodesRevealCompleted_Params
	{	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.OnNodeHovered
	 */
	struct UCoreArchiveQuestMapWidget_OnNodeHovered_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.OnNodeClicked
	 */
	struct UCoreArchiveQuestMapWidget_OnNodeClicked_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.BindToPath
	 */
	struct UCoreArchiveQuestMapWidget_BindToPath_Params
	{
	public:
		class UCoreArchiveQuestPathWidget*                         Path;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestMapWidget.BindToNode
	 */
	struct UCoreArchiveQuestMapWidget_BindToNode_Params
	{
	public:
		class UCoreArchiveQuestNodeWidget*                         Node;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.SetHighlightedGridLines
	 */
	struct UCoreArchiveQuestEditorWidget_SetHighlightedGridLines_Params
	{
	public:
		int32_t                                                    verticalIndex;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    horizontalIndex;                                         // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.SetGridLinesArray
	 */
	struct UCoreArchiveQuestEditorWidget_SetGridLinesArray_Params
	{
	public:
		TArray<struct FLinePair>                                   gridArrayVertical;                                       // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		TArray<struct FLinePair>                                   gridArrayHorizontal;                                     // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnSnapGridChecked
	 */
	struct UCoreArchiveQuestEditorWidget_OnSnapGridChecked_Params
	{
	public:
		bool                                                       checked;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnSaveGraphClick
	 */
	struct UCoreArchiveQuestEditorWidget_OnSaveGraphClick_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnRefreshGridClick
	 */
	struct UCoreArchiveQuestEditorWidget_OnRefreshGridClick_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnPathClicked
	 */
	struct UCoreArchiveQuestEditorWidget_OnPathClicked_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeYPixelChanged
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeYPixelChanged_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeYPercentChanged
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeYPercentChanged_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeXPixelChanged
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeXPixelChanged_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeXPercentChanged
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeXPercentChanged_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeSubmitClick
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeSubmitClick_Params
	{
	public:
		class UCoreButtonWidget*                                   buttonTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DBDUIViewsCore.CoreArchiveQuestEditorWidget.OnNodeBeginDrag
	 */
	struct UCoreArchiveQuestEditorWidget_OnNodeBeginDrag_Params
	{
	public:
