#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DBDUIViewsCore.CoreBaseUserWidget
	 * Size -> 0x0078 (FullSize[0x0310] - InheritedSize[0x0298])
	 */
	class UCoreBaseUserWidget : public UUserWidget
	{
	public:
		unsigned char                                              UnknownData_18RN[0x10];                                  // 0x0298(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UScaleBox*                                           ScaleContainer;                                          // 0x02A8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       IsInteractive;                                           // 0x02B0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EControlMode                                               _controlMode;                                            // 0x02B1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EScaleType                                                 ScaleType;                                               // 0x02B2(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2RPD[0x5];                                   // 0x02B3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDInputManager*                                    _inputManager;                                           // 0x02B8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TMap<class FName, class UWidgetAnimation*>                 _animationMap;                                           // 0x02C0(0x0050) Transient, NativeAccessSpecifierPrivate

	public:
		void UpdateScale(float Scale);
		bool StopAnimationByName(const class FName& animName);
		void RegisterForInput();
		bool PlayAnimationByName(const class FName& animName, float starttime, int32_t loopcount, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
		void OnControlModeChangedBP(EControlMode controlMode);
		class UWidgetAnimation* GetAnimationByName(const class FName& animName);
		void DeregisterFromInput();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.ArchiveCompendiumTooltipWidget
	 * Size -> 0x0018 (FullSize[0x0328] - InheritedSize[0x0310])
	 */
	class UArchiveCompendiumTooltipWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDTextBlock*                                       TomeTitleTB;                                             // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       DescriptionTB;                                           // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreStoryLevelsSelectorWidget*                      StoryLevelsSelector;                                     // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetTooltipData(const struct FCompendiumButtonData& tooltipViewData);
		void Reset();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.ArchiveNodeTooltipWidget
	 * Size -> 0x0050 (FullSize[0x0360] - InheritedSize[0x0310])
	 */
	class UArchiveNodeTooltipWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDImage*                                           BackgroundIMG;                                           // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           RarityIMG;                                               // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       NodeTitleTB;                                             // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       SubtitleTB;                                              // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   NodeDescriptionRTB;                                      // 0x0330(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              ObjectiveWidgetClass;                                    // 0x0338(0x0008) Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UVerticalBox*                                        ArchiveObjectivesContainer;                              // 0x0340(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreCurrencyForTooltipsWidget*                      ProgressionRewardWidget;                                 // 0x0348(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreCurrencyForTooltipsWidget*                      CurrencyRewardWidget;                                    // 0x0350(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   VignetteRTB;                                             // 0x0358(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetTooltipData(const struct FArchiveNodeViewData& NodeViewData);
		void SetNodeType(EArchiveNodeType Type);
		void Reset();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.ArchiveRewardNodeTooltipWidget
	 * Size -> 0x0008 (FullSize[0x0318] - InheritedSize[0x0310])
	 */
	class UArchiveRewardNodeTooltipWidget : public UCoreBaseUserWidget
	{
	public:
		class UCustomizationTooltipWidget*                         CustomizationTooltip;                                    // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.AspectRatioBox
	 * Size -> 0x0018 (FullSize[0x0160] - InheritedSize[0x0148])
	 */
	class UAspectRatioBox : public UContentWidget
	{
	public:
		float                                                      AspectRatio;                                             // 0x0148(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAspectRatioOverridden : 1;                             // 0x014C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3S2T[0x13];                                  // 0x014D(0x0013) MISSED OFFSET (PADDING)

	public:
		void SetAspectRatio(float inAspectRatio);
		void ClearAspectRatio();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.AspectRatioBoxSlot
	 * Size -> 0x0028 (FullSize[0x0068] - InheritedSize[0x0040])
	 */
	class UAspectRatioBoxSlot : public UPanelSlot
	{
	public:
		struct FMargin                                             Padding;                                                 // 0x0040(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		EHorizontalAlignment                                       HorizontalAlignment;                                     // 0x0050(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVerticalAlignment                                         VerticalAlignment;                                       // 0x0051(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JK21[0x16];                                  // 0x0052(0x0016) MISSED OFFSET (PADDING)

	public:
		void SetVerticalAlignment(EVerticalAlignment inVerticalAlignment);
		void SetPadding(const struct FMargin& InPadding);
		void SetHorizontalAlignment(EHorizontalAlignment inHorizontalAlignment);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CharacterTooltipWidget
	 * Size -> 0x0020 (FullSize[0x0330] - InheritedSize[0x0310])
	 */
	class UCharacterTooltipWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDTextBlock*                                       InstructionTB;                                           // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LevelTB;                                                 // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       MarketTB;                                                // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   DifficultyRTB;                                           // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetTooltipData(const struct FCharacterTooltipViewData& characterViewData);
		void SetLevel(int32_t Level);
		void SetDifficulty(ECharacterDifficulty Difficulty);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreBaseLoadoutPartWidget
	 * Size -> 0x0018 (FullSize[0x02B0] - InheritedSize[0x0298])
	 */
	class UCoreBaseLoadoutPartWidget : public UUserWidget
	{
	public:
		class UDBDImage*                                           ImageRarity;                                             // 0x0298(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           ImageIcon;                                               // 0x02A0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UTextBlock*                                          TextStackCount;                                          // 0x02A8(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetLoadoutStackCount(int32_t StackCount);
		void SetLoadoutPartRarity(EItemRarity Rarity);
		void SetLoadoutPartIcon();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreAddonWidget
	 * Size -> 0x0008 (FullSize[0x02B8] - InheritedSize[0x02B0])
	 */
	class UCoreAddonWidget : public UCoreBaseLoadoutPartWidget
	{
	public:
		unsigned char                                              UnknownData_HH10[0x8];                                   // 0x02B0(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreButtonWidget
	 * Size -> 0x00F8 (FullSize[0x0408] - InheritedSize[0x0310])
	 */
	class UCoreButtonWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDImage*                                           BackgroundIMG;                                           // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDBDImage*                                           AdditionalIconIMG;                                       // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnHoveredDelegate;                                       // 0x0320(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnUnhoveredDelegate;                                     // 0x0330(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPressedDelegate;                                       // 0x0340(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnReleasedDelegate;                                      // 0x0350(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnClickedDelegate;                                       // 0x0360(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FString                                              HoveredSfxName;                                          // 0x0370(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       HoveredSfx;                                              // 0x0380(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              PressedSfxName;                                          // 0x0388(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       PressedSfx;                                              // 0x0398(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ClickedSfxName;                                          // 0x03A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       ClickedSfx;                                              // 0x03B0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAnalogCursorStickiness                                    AnalogCursorStickiness;                                  // 0x03B8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3K4K[0x7];                                   // 0x03B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDButton*                                          HitzoneButton;                                           // 0x03C0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LabelTB;                                                 // 0x03C8(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ETextJustify                                               _alignment;                                              // 0x03D0(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Z8FR[0x21];                                  // 0x03D1(0x0021) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       SendAnalyticsData;                                       // 0x03F2(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_0GRZ[0x5];                                   // 0x03F3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              AnalyticsName;                                           // 0x03F8(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void SetVisible(EButtonWidgetVisibility visible);
		void SetRepeatable(bool isRepeatable, class UCurveFloat* repetitionDelayCurve);
		void SetPressable(bool isPressable);
		void SetLabel(const class FText& label);
		void SetHoverable(bool isHoverable);
		void SetHoldable(bool isHoldable);
		void SetEnabled(bool IsEnabled);
		void SetClickable(bool isClickable);
		void SetChargeable(bool isChargeable);
		void SetBackground();
		void SetAlignment(ETextJustify newAlignment);
		void SetAdditionalIcon();
		void OnUnhoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnUnhovered();
		void OnReleasedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnReleased();
		void OnPressedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnPressed();
		void OnInternalUnhovered();
		void OnInternalReleased();
		void OnInternalPressed();
		void OnInternalHovered();
		void OnInternalClicked();
		void OnHoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnHovered();
		void OnEnabledChanged(bool IsEnabled);
		void OnClickedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnClicked();
		void OnAlignmentChanged(ETextJustify newAlignment);
		bool IsEnabled();
		struct FGeometry GetHitzonePaintSpaceGeometry();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreSelectableButtonWidget
	 * Size -> 0x0038 (FullSize[0x0440] - InheritedSize[0x0408])
	 */
	class UCoreSelectableButtonWidget : public UCoreButtonWidget
	{
	public:
		class FScriptMulticastDelegate                             OnSelectedChangedDelegate;                               // 0x0408(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSelectedAgainDelegate;                                 // 0x0418(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FString                                              _analyticsName;                                          // 0x0428(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_41UC[0x8];                                   // 0x0438(0x0008) MISSED OFFSET (PADDING)

	public:
		void UpdateBackgroundSkin(class UMaterialInterface* skinMaterial);
		void SetSelected(bool IsSelected);
		void SetSelectable(bool IsSelectable);
		void OnSelectedChangedDelegate__DelegateSignature(class UCoreSelectableButtonWidget* buttonTarget, bool IsSelected);
		void OnSelectedChanged(bool IsSelected);
		void OnSelectedAgainDelegate__DelegateSignature(class UCoreSelectableButtonWidget* buttonTarget);
		bool IsSelected();
		bool IsSelectable();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveChallengeReminderSlotWidget
	 * Size -> 0x0068 (FullSize[0x04A8] - InheritedSize[0x0440])
	 */
	class UCoreArchiveChallengeReminderSlotWidget : public UCoreSelectableButtonWidget
	{
	public:
		class UCoreArchiveQuestNodeWidget*                         Node;                                                    // 0x0440(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           EmptySlotImage;                                          // 0x0448(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           InactiveBG;                                              // 0x0450(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           ActiveBG;                                                // 0x0458(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           SmokeBackground;                                         // 0x0460(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           ProgressBar;                                             // 0x0468(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           SelectorHighlight;                                       // 0x0470(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       TitleTB;                                                 // 0x0478(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       SubtitleTB;                                              // 0x0480(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       InactiveTitleTB;                                         // 0x0488(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       InactiveSubtitleTB;                                      // 0x0490(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreOnHoverBorderWidget*                            OnHoverBorder;                                           // 0x0498(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EPlayerRole                                                _slotRole;                                               // 0x04A0(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _hasActiveHoverEffect;                                   // 0x04A1(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2XX3[0x6];                                   // 0x04A2(0x0006) MISSED OFFSET (PADDING)

	public:
		void UpdateVisualState(const struct FArchiveChallengeReminderViewData& Data);
		void UpdateProgressBar(float Progress);
		void UpdateActiveState(bool IsActive, bool PlayAnimation);
		void SwapChallenge(const struct FArchiveChallengeReminderViewData& Data);
		void SetSlotSelectorState(bool isSelectorOpen);
		void SetQuestNodeHoverEffect(bool IsHovered);
		void SetData(const struct FArchiveChallengeReminderViewData& Data);
		void InitVisualState();
		void Init(EPlayerRole Role);
		void ClearData();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveCompendiumButtonWidget
	 * Size -> 0x0088 (FullSize[0x0490] - InheritedSize[0x0408])
	 */
	class UCoreArchiveCompendiumButtonWidget : public UCoreButtonWidget
	{
	public:
		ETooltipHorizontalAlignment                                HorizontalAlignment;                                     // 0x0408(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETooltipVerticalAlignment                                  VerticalAlignment;                                       // 0x0409(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1U6B[0x6];                                   // 0x040A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDImage*                                           TomeProgressStyleTexture;                                // 0x0410(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       VolumeIndex;                                             // 0x0418(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FCompendiumButtonData                               _compendiumButtonData;                                   // 0x0420(0x0070) BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected

	public:
		void SetLevelProgressionVisual(int32_t buttonLevel, EArchivesStoryLevelStatus levelStatus);
		void SetGhostStory(bool isGhostStory);
		void SetButtonVisual(const struct FCompendiumButtonData& buttonData);
		void SetButtonData(const struct FCompendiumButtonData& buttonData);
		void ResetVisuals();
		void OnButtonUnhovered();
		void OnButtonHovered();
		class FString GetTomeId();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreTabContentWidget
	 * Size -> 0x0020 (FullSize[0x0330] - InheritedSize[0x0310])
	 */
	class UCoreTabContentWidget : public UCoreBaseUserWidget
	{
	public:
		TArray<class UWidget*>                                     ContentWidgets;                                          // 0x0310(0x0010) BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		float                                                      _contentFadeInTime;                                      // 0x0320(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                _contentFadeInEasing;                                    // 0x0324(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_CCZC[0x3];                                   // 0x0325(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _contentFadeOutTime;                                     // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                _contentFadeOutEasing;                                   // 0x032C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_P8HC[0x3];                                   // 0x032D(0x0003) MISSED OFFSET (PADDING)

	public:
		void StopFadeInTweening(float opacityValue);
		void ResetFade();
		void FadeOutContent();
		void FadeInContent();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveCompendiumWidget
	 * Size -> 0x0058 (FullSize[0x0388] - InheritedSize[0x0330])
	 */
	class UCoreArchiveCompendiumWidget : public UCoreTabContentWidget
	{
	public:
		unsigned char                                              UnknownData_WDJA[0x8];                                   // 0x0330(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              _compendiumButtonWidgetClass;                            // 0x0338(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _onCompendiumClickedDelegate;                            // 0x0340(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class UGridPanel*                                          CompendiumGrid;                                          // 0x0350(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDScrollBox*                                       CompendiumScroll;                                        // 0x0358(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    _cellsPerRow;                                            // 0x0360(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_EZGP[0x4];                                   // 0x0364(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UCoreArchiveCompendiumButtonWidget*>          _compendiumButtonWidgetPool;                             // 0x0368(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCoreArchiveCompendiumButtonWidget*>          _compendiumButtonWidgetList;                             // 0x0378(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate

	public:
		void SetGridSlot(class UGridSlot* GridSlot, int32_t Index);
		void ResetScroll();
		void Reset();
		void OnPastStoryClicked(class UCoreButtonWidget* Button);
		void CreateGhostStories(int32_t currentStoryNum);
		class UCoreArchiveCompendiumButtonWidget* CreateAndAddButtonToGrid(int32_t Index);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveJournalImageViewerWidget
	 * Size -> 0x0058 (FullSize[0x0388] - InheritedSize[0x0330])
	 */
	class UCoreArchiveJournalImageViewerWidget : public UCoreTabContentWidget
	{
	public:
		unsigned char                                              UnknownData_WE2O[0x8];                                   // 0x0330(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreInputSwitcherWidget*                            BackInputSwitcher;                                       // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreInputSwitcherWidget*                            TextVisibilityInputSwitcher;                             // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             _backActionDelegate;                                     // 0x0348(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _imageViewerTextVisibilityActionDelegate;                // 0x0358(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _imageViewerVoiceOverPlayedDelegate;                     // 0x0368(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _imageViewerVoiceOverAutoplayDelegate;                   // 0x0378(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		void SetVoiceOverText(const class FText& playVoiceOverText, const class FText& stopVoiceOverText, const class FText& autoplayVoiceOverText);
		void SetTextVisibilityInputText(const class FText& DisplayText, const class FText& hideText);
		void SetScrollData(const class FText& journalEntryScrollPromptText);
		void SetData(const struct FArchivesVignetteEntryViewData& Data, bool hasTitle, bool hasDescription);
		void OnVoiceOverPlay();
		void OnVoiceOverAutoPlay(bool autoplay);
		void OnTextVisibilityChanged();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveJournalWidget
	 * Size -> 0x00E8 (FullSize[0x0418] - InheritedSize[0x0330])
	 */
	class UCoreArchiveJournalWidget : public UCoreTabContentWidget
	{
	public:
		unsigned char                                              UnknownData_VKR1[0x8];                                   // 0x0330(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreArchiveVignetteButtonContainerWidget*           VignetteButtonContainer;                                 // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreArchiveVignetteEntryContainerWidget*            VignetteEntryContainer;                                  // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreArchiveVignetteCinematicContainerWidget*        VignetteCinematicsContainer;                             // 0x0348(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            LeftArrowInputSwitcher;                                  // 0x0350(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            RightArrowInputSwitcher;                                 // 0x0358(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              DebugRewardImage[0x30];                                  // 0x0360(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              RewardImageMaxDescriptionLength;                         // 0x0390(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_P7ZZ[0x7];                                   // 0x0391(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             _vignetteSelectedDelegate;                               // 0x0398(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _vignetteEntrySelectedDelegate;                          // 0x03A8(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _vignetteCinematicPlayedDelegate;                        // 0x03B8(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _vignetteVoiceOverPlayedDelegate;                        // 0x03C8(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _vignetteVoiceOverAutoplayDelegate;                      // 0x03D8(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _vignetteShowImageViewerDelegate;                        // 0x03E8(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_JK0F[0x20];                                  // 0x03F8(0x0020) MISSED OFFSET (PADDING)

	public:
		void ShowImageViewer();
		void SetVoiceOverText(const class FText& playVoiceOverText, const class FText& stopVoiceOverText, const class FText& autoplayVoiceOverText);
		void SetVoiceOverButtonsVisibility(bool IsVisible);
		void SetVignetteText(const class FText& titleText, const class FText& subtitleText);
		void SetTopFogOffset(bool hasTitle, bool hasDescription);
		void SetEntryText(const class FText& titleText, const class FText& descriptionText);
		void SetEntryImage(const class FText& titleText, const class FText& descriptionText, float textureOffset);
		void SetBottomFogOffset(bool HasAudio);
		void OnVoiceOverPlay();
		void OnVoiceOverAutoPlay(bool autoplay);
		void OnVignetteEntrySelected(class UCoreSelectableButtonWidget* selectedButton);
		void OnVignetteCinematicSelected(class UCoreSelectableButtonWidget* selectedButton);
		void OnVignetteButtonSelected(class UCoreSelectableButtonWidget* selectedButton);
		void OnRightArrowTriggered();
		void OnRewardImageLoaded(bool success, const class FText& titleText, const class FText& descriptionText, float textureOffset);
		void OnLeftArrowTriggered();
		void OnJournalEntriesUnlocked();
		void OnFirstJournalEntryUnlocked();
		void InitializeArrow(class UCoreInputSwitcherWidget* arrowWidget, bool Active);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveLevelProgressionWidget
	 * Size -> 0x0068 (FullSize[0x0378] - InheritedSize[0x0310])
	 */
	class UCoreArchiveLevelProgressionWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_4D77[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             _levelSelectedDelegate;                                  // 0x0318(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _levelAnimationDoneDelegate;                             // 0x0328(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _levelRewardAnimationDoneDelegate;                       // 0x0338(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _levelUnlockedAnimationDoneDelegate;                     // 0x0348(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class UCoreStoryLevelsSelectorWidget*                      StoryLevelsSelector;                                     // 0x0358(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LevelNumberTF;                                           // 0x0360(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LevelCompletionTF;                                       // 0x0368(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UOverlay*                                            SideContent;                                             // 0x0370(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void OnTomeLevelUnlockedAnimation();
		void OnStoryLevelSelected(class UCoreSelectableButtonWidget* selectedButton);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveMenuWidget
	 * Size -> 0x0268 (FullSize[0x0578] - InheritedSize[0x0310])
	 */
	class UCoreArchiveMenuWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_1K91[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreTabContainerWidget*                             ArchiveMenuTabs;                                         // 0x0318(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreArchiveChallengeReminderSlotWidget*             SurvivorChallengeSlot;                                   // 0x0320(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreArchiveChallengeReminderSlotWidget*             KillerChallengeSlot;                                     // 0x0328(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreArchiveSlotSelectorWidget*                      SlotSelector;                                            // 0x0330(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreInputSwitcherWidget*                            BackInputSwitcher;                                       // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCoreButtonWidget*                                   InfoButton;                                              // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             _backActionDelegate;                                     // 0x0348(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _infoClickedDelegate;                                    // 0x0358(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _slotSelectorClosedDelegate;                             // 0x0368(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             MenuTabSelectedDelegate;                                 // 0x0378(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _challengeReminderClickedDelegate;                       // 0x0388(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _slotSelectionSelectedDelegate;                          // 0x0398(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FText                                                _riftRemainingTimeText;                                  // 0x03A8(0x0018) BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_MY3K[0x1B8];                                 // 0x03C0(0x01B8) MISSED OFFSET (PADDING)

	public:
		void SetScrollData(const class FText& vignetteListScrollPromptText, const class FText& journalEntryScrollPromptText);
		void OnSlotSelectionCancelled();
		void OnSlotSelected(EPlayerRole Role);
		void OnMenuTabSelectedAgain(class UCoreSelectableButtonWidget* selectedButton);
		void OnMenuTabSelected(class UCoreSelectableButtonWidget* selectedButton);
		void OnInfoButtonClicked(class UCoreButtonWidget* buttonTarget);
		void OnChallengeReminderClick(class UCoreButtonWidget* Button);
		class FText GetTimeRemainingLabelFromMenuState(EArchiveMenuState menuState);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveObjectiveWidget
	 * Size -> 0x0020 (FullSize[0x0330] - InheritedSize[0x0310])
	 */
	class UCoreArchiveObjectiveWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDRichTextBlock*                                   ObjectiveDescriptionRTB;                                 // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           ProgressBar;                                             // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       CurrentProgressTB;                                       // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       MaxProgressTB;                                           // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetData(const struct FArchiveNodeObjectiveViewData& objectiveData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreBasePopupWidget
	 * Size -> 0x0018 (FullSize[0x0328] - InheritedSize[0x0310])
	 */
	class UCoreBasePopupWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_ROAF[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDRichTextBlock*                                   titleText;                                               // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   MessageText;                                             // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void Show(class UBasePopupViewData* Data);
		void Hide();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreGenericPopupWidget
	 * Size -> 0x0040 (FullSize[0x0368] - InheritedSize[0x0328])
	 */
	class UCoreGenericPopupWidget : public UCoreBasePopupWidget
	{
	public:
		unsigned char                                              UnknownData_RBEB[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreInputSwitcherWidget*                            ProgressionButton;                                       // 0x0330(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            RegressionButton;                                        // 0x0338(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            AlternativeButton;                                       // 0x0340(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _popupActionDelegate;                                    // 0x0348(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _popupBackActionDelegate;                                // 0x0358(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		void OnRegressionAction();
		void OnProgressionAction();
		void OnAlternativeAction();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchivePassPurchasePopupWidget
	 * Size -> 0x0008 (FullSize[0x0370] - InheritedSize[0x0368])
	 */
	class UCoreArchivePassPurchasePopupWidget : public UCoreGenericPopupWidget
	{
	public:
		unsigned char                                              UnknownData_R9YA[0x8];                                   // 0x0368(0x0008) MISSED OFFSET (PADDING)

	public:
		class FText GetTranslatedAvailabilityTitleText();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreArchiveQuestMapWidget
	 * Size -> 0x0178 (FullSize[0x04A8] - InheritedSize[0x0330])
	 */
	class UCoreArchiveQuestMapWidget : public UCoreTabContentWidget
	{
	public:
		unsigned char                                              UnknownData_GK22[0x8];                                   // 0x0330(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCanvasPanel*                                        ChallengesContainer;                                     // 0x0338(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              ArchiveQuestNodeWidgetClass;                             // 0x0340(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              ArchiveQuestPathWidgetClass;                             // 0x0348(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    MaxDisplayedNodes;                                       // 0x0350(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    MaxDisplayedPaths;                                       // 0x0354(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      QuestMapRevealDuration;                                  // 0x0358(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      NodeRevealDuration;                                      // 0x035C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      PathRevealDuration;                                      // 0x0360(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                NodeRevealEasingType;                                    // 0x0364(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                PathRevealEasingType;                                    // 0x0365(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_K0H3[0x2];                                   // 0x0366(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkAudioEvent*                                       QuestMapGenerationSound;                                 // 0x0368(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<struct FArchiveNodeGraphViewData>                   _nodeGraphDataList;                                      // 0x0370(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<struct FArchiveMapPathViewData>                     _pathDataList;                                           // 0x0380(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _questMapCreatedDelegate;                                // 0x0390(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _questNodeHoveredDelegate;                               // 0x03A0(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _questNodeUnhoveredDelegate;                             // 0x03B0(0x0010) ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected
