#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum DeadByDaylight.EEndGameReason
	 */
	enum class EEndGameReason : uint8_t
	{
		None                    = 0,
		Normal                  = 1,
		KillerLeft              = 2,
		PlayerLeftDuringLoading = 3,
		KillerLeftEarly         = 4,
		InvalidPlayerRoles      = 5,
		LoadingTimeout          = 6,
		MAX                     = 7
	};

	/**
	 * Enum DeadByDaylight.ETileSpawnPointType
	 */
	enum class ETileSpawnPointType : uint8_t
	{
		Unspecified        = 0,
		Survivor           = 1,
		SurvivorItem       = 2,
		Killer             = 3,
		KillerItem         = 4,
		InteractableObject = 5,
		BasementObject     = 6,
		FinisherMori       = 7,
		Count              = 8,
		MAX                = 9
	};

	/**
	 * Enum DeadByDaylight.EServerUseNetAsyncLoading
	 */
	enum class EServerUseNetAsyncLoading : uint8_t
	{
		NotSet = 0,
		Yes    = 1,
		No     = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadByDaylight.EIntroState
	 */
	enum class EIntroState : uint8_t
	{
		WaitingToStart    = 0,
		RotationStarted   = 1,
		RotationCompleted = 2,
		PanInStarted      = 3,
		PanInCompleted    = 4,
		MAX               = 5
	};

	/**
	 * Enum DeadByDaylight.EDBDScoreTypes
	 */
	enum class EDBDScoreTypes : uint8_t
	{
		DBDCamperScore_SurviveHealthy                         = 0,
		DBDCamperScore_SurviveWounded                         = 1,
		DBDCamperScore_SurviveKO                              = 2,
		DBDCamperScore_UnlockHatch                            = 3,
		DBDCamperScore_EscapeThroughHatch                     = 4,
		DBDCamperScore_AllEscapeThroughHatch                  = 5,
		DBDCamperScore_EscapeCarry                            = 6,
		DBDCamperScore_SurviveStreakSmall                     = 7,
		DBDCamperScore_SurviveStreakBig                       = 8,
		DBDCamperScore_DamageStateChanged                     = 9,
		DBDCamperScore_NearFriendInNeed                       = 10,
		DBDCamperScore_NearFriendInNeed_PostExit              = 11,
		DBDCamperScore_FoundCamper                            = 12,
		DBDCamperScore_CoopObjectives                         = 13,
		DBDCamperScore_OpenDoorPercent                        = 14,
		DBDCamperScore_OpenDoor                               = 15,
		DBDCamperScore_GeneratorPercent                       = 16,
		DBDCamperScore_GeneratorSkillCheckSuccess             = 17,
		DBDCamperScore_GeneratorSkillCheckBonus               = 18,
		DBDCamperScore_SearchablePercent                      = 19,
		DBDCamperScore_SearchCompleteFinalContributionPercent = 20,
		DBDCamperScore_AddItemToMap                           = 21,
		DBDCamperScore_FixGenerator                           = 22,
		DBDCamperScore_FixSpecialMapGenerator                 = 23,
		DBDCamperScore_LastSurvivorFixGenerator               = 24,
		DBDCamperScore_RepairDamagedGenerator                 = 25,
		DBDCamperScore_PowerExitGates                         = 26,
		DBDCamperScore_CoopAltruism                           = 27,
		DBDCamperScore_HealPercent                            = 28,
		DBDCamperScore_HealPercent_PostExit                   = 29,
		DBDCamperScore_HealFromDying                          = 30,
		DBDCamperScore_HealFromDying_PostExit                 = 31,
		DBDCamperScore_HealFromInjured                        = 32,
		DBDCamperScore_HealFromInjured_PostExit               = 33,
		DBDCamperScore_HealSkillCheckSuccess                  = 34,
		DBDCamperScore_HealSkillCheckBonus                    = 35,
		DBDCamperScore_HealSelfPercent                        = 36,
		DBDCamperScore_HealSelfSkillCheckSuccess              = 37,
		DBDCamperScore_HealSelfSkillCheckBonus                = 38,
		DBDCamperScore_HitAfterHookSave                       = 39,
		DBDCamperScore_HitNearFriendInNeed                    = 40,
		DBDCamperScore_HitNearUnhookedFriendInNeed            = 41,
		DBDCamperScore_SabotageHook                           = 42,
		DBDCamperScore_SabotageHookSkillCheckSuccess          = 43,
		DBDCamperScore_SabotageHookSkillCheckBonus            = 44,
		DBDCamperScore_EscapeFromHook                         = 45,
		DBDCamperScore_HookStrugglePerSecond                  = 46,
		DBDCamperScore_SaveFromHook                           = 47,
		DBDCamperScore_SaveFromHook_PostExit                  = 48,
		DBDCamperScore_WasUnhooked                            = 49,
		DBDCamperScore_SabotageBearTrap                       = 50,
		DBDCamperScore_SabotageBearTrapSkillCheckSuccess      = 51,
		DBDCamperScore_SabotageBearTrapSkillCheckBonus        = 52,
		DBDCamperScore_DisableBearTrap                        = 53,
		DBDCamperScore_SaveFromBearTrap                       = 54,
		DBDCamperScore_SaveFromBearTrap_PostExit              = 55,
		DBDCamperScore_EscapeBearTrap                         = 56,
		DBDCamperScore_BasementChillingPerSecond              = 57,
		DBDCamperScore_CoopBoldness                           = 58,
		DBDCamperScore_SlasherStun                            = 59,
		DBDCamperScore_SlasherStunCarrying                    = 60,
		DBDCamperScore_SlasherBlind                           = 61,
		DBDCamperScore_SlasherBurnInvisibility                = 62,
		DBDCamperScore_ChasePerSecond                         = 63,
		DBDCamperScore_ChaseEscape                            = 64,
		DBDCamperScore_ChaseSteal                             = 65,
		DBDCamperScore_ChaseBlind                             = 66,
		DBDCamperScore_VaultInChase                           = 67,
		DBDCamperScore_NoiseDistraction                       = 68,
		DBDCamperScore_SprintingNearSlasherPerSecond          = 69,
		DBDCamperScore_UnhideNearSlasher                      = 70,
		DBDCamperScore_EscapeWhileChased                      = 71,
		DBDCamperScore_DestroyPhantomTrap                     = 72,
		DBDCamperScore_NewItem                                = 73,
		DBDCamperScore_StartMatchWithUltraRareItem            = 74,
		DBDCamperScore_ItemFrom                               = 75,
		DBDCamperScore_ExposerAdded                           = 76,
		DBDSlasherScore_Destroy                               = 77,
		DBDSlasherScore_Kill                                  = 78,
		DBDSlasherScore_BleedOut                              = 79,
		DBDSlasherScore_BleedOutPercent                       = 80,
		DBDSlasherScore_AttackSuccess                         = 81,
		DBDSlasherScore_AttackDeviousness                     = 82,
		DBDSlasherScore_InterruptGenerator                    = 83,
		DBDSlasherScore_InterruptWindow                       = 84,
		DBDSlasherScore_InterruptHide                         = 85,
		DBDSlasherScore_InterruptExit                         = 86,
		DBDSlasherScore_InterruptUnhook                       = 87,
		DBDSlasherScore_InterruptChest                        = 88,
		DBDSlasherScore_InterruptOpenHatch                    = 89,
		DBDSlasherScore_InterruptExitHatch                    = 90,
		DBDSlasherScore_FindHiding                            = 91,
		DBDSlasherScore_PlaceTrap                             = 92,
		DBDSlasherScore_Trap                                  = 93,
		DBDSlasherScore_TrapPickup                            = 94,
		DBDSlasherScore_Hook                                  = 95,
		DBDSlasherScore_SacrificePercent                      = 96,
		DBDSlasherScore_SacrificeSuccess                      = 97,
		DBDSlasherScore_SacrificedCount                       = 98,
		DBDSlasherScore_NoEscape                              = 99,
		DBDSlasherScore_ChaseStart                            = 100,
		DBDSlasherScore_ChasePerSecond                        = 101,
		DBDSlasherScore_CloakStalkPerSecond                   = 102,
		DBDSlasherScore_UncloakInView                         = 103,
		DBDSlasherScore_UncloakAttack                         = 104,
		DBDSlasherScore_EvadeInvisBurn                        = 105,
		DBDSlasherScore_EvadeBlind                            = 106,
		DBDSlasherScore_CamperDisconnect                      = 107,
		DBDSlasherScore_HitCamperWithChainsaw                 = 108,
		DBDSlasherScore_RunningWithChainsaw                   = 109,
		DBDSlasherScore_ChainBlinkAttack                      = 110,
		DBDSlasherScore_ChainBlinkInterrupt                   = 111,
		DBDSlasherScore_ChainBlinkInterruptAfter3             = 112,
		DBDSlasherScore_ChainBlinkStartChase                  = 113,
		DBDSlasherScore_StalkpointGained                      = 114,
		DBDSlasherScore_StalkerTierIncrement                  = 115,
		DBDSlasherScore_StalkerTierFirstTime                  = 116,
		DBDSlasherScore_StalkerKillAllCampers                 = 117,
		DBDSlasherScore_PhantomTrapSet                        = 118,
		DBDSlasherScore_PhantomTrapTrigger                    = 119,
		DBDSlasherScore_PhantomTrapTriggerAttack              = 120,
		DBDSlasherScore_PhantomTrapTeleportAttack             = 121,
		DBDSlasherScore_PhantomTrapTeleportAttackAllCampers   = 122,
		DBDSlasherScore_ThrillOfTheHunt                       = 123,
		DBDPlayerScore_BloodwebLevelUp                        = 124,
		DBDPlayerScore_BloodwebPrestigeLevelUp                = 125,
		DBDPlayerScore_BloodwebPrestige3LevelUp               = 126,
		DBDPlayerScore_AwardPips                              = 127,
		DBDPlayerScore_AddBloodpoints                         = 128,
		DBDPlayerScore_BloodpointsOneCategory                 = 129,
		DBDPlayerScore_MaxBloodpointsAllCategories            = 130,
		DBDPlayerScore_AddNewPerk                             = 131,
		DBDPlayerScore_PerkLevelUp                            = 132,
		DBDPlayerScore_BurnOfferingUltraRare                  = 133,
		DBDPlayerScore_StartGame                              = 134,
		DBDPlayerScore_UnlockRanking                          = 135,
		DBDPlayerScore_FinishWithPerks                        = 136,
		DBDCamperScore_CheatObjectives                        = 137,
		DBDCamperScore_CheatSurvival                          = 138,
		DBDCamperScore_CheatAltruism                          = 139,
		DBDCamperScore_CheatBoldness                          = 140,
		DBDSlasherScore_CheatSacrifice                        = 141,
		DBDSlasherScore_CheatBrutality                        = 142,
		DBDSlasherScore_CheatDeviousness                      = 143,
		DBDSlasherScore_CheatHunter                           = 144,
		DBDCamperScore_CleanseDullTotem                       = 145,
		DBDCamperScore_CleanseHexTotem                        = 146,
		DBDPlayerScore_BalancedLanding                        = 147,
		DBDPlayerScore_Lithe                                  = 148,
		DBDSlasherScore_DamageGenerator                       = 149,
		DBDSlasherScore_Vault                                 = 150,
		DBDCamperScore_StartInjuredBleedout                   = 151,
		DBDCamperScore_FullRecovery                           = 152,
		DBDCamperScore_FirstTimeDying                         = 153,
		DBDCamperScore_SecondTimeDying                        = 154,
		DBDCamperScore_FirecrackerDisturbance                 = 155,
		DBDCamperScore_GeneratorSkillCheckRuinBonus           = 156,
		DBDCamperScore_SlasherBurnBlink                       = 157,
		DBDCamperScore_DieSacrificed                          = 158,
		DBDCamperScore_DieBleedOut                            = 159,
		DBDCamperScore_DieKill                                = 160,
		DBDPlayerScore_EndGame                                = 161,
		DBDPlayerScore_EnterParadise                          = 162,
		DBDSlasherScore_CamperHookedFirstTime                 = 163,
		DBDSlasherScore_CamperEnterHookStrugglePhase          = 164,
		DBDSlasherScore_ElectroShockSurvivor                  = 165,
		DBDSlasherScore_BringAllSurvivorsToMadnessTier3       = 166,
		DBDSlasherScore_BringSurvivorUpOneMadnessTier         = 167,
		DBDSlasherScore_HitSurvivorAfterElectroShock          = 168,
		DBDSlasherScore_PickupCamper                          = 169,
		DBDSlasherScore_Blink                                 = 170,
		DBDSlasherScore_TeleportToPhantomTrap                 = 171,
		DBDSlasherScore_HatchetThrow                          = 172,
		DBDSlasherScore_HatchetHit                            = 173,
		DBDSlasherScore_HatchetSkillShotHit                   = 174,
		DBDSlasherScore_HatchetFarHit                         = 175,
		DBDCamperScore_QuickVault                             = 176,
		DBDCamperScore_QuickCloset                            = 177,
		DBDCamperScore_StartGeneratorRepair                   = 178,
		DBDCamperScore_StartCleansingTotem                    = 179,
		DBDCamperScore_FirstRepairSkillCheck                  = 180,
		DBDSlasherScore_CamperDisconnectedBeforeMatchStart    = 181,
		DBDSlasherScore_CamperDisconnectedDuringMatch         = 182,
		DBDCamperScore_NearFriendInNeed_GeneratorsComplete    = 183,
		DBDCamperScore_HealPercent_GeneratorsComplete         = 184,
		DBDCamperScore_HealFromDying_GeneratorsComplete       = 185,
		DBDCamperScore_SaveFromHook_GeneratorsComplete        = 186,
		DBDCamperScore_SaveFromBearTrap_GeneratorsComplete    = 187,
		DBDCamperScore_SnapOutOfIt                            = 188,
		DBDSlasherScore_HookInBasement                        = 189,
		DBDSlasherScore_LFChainsawHit                         = 190,
		DBDCamperScore_PalletDrop                             = 191,
		DBDCamperScore_Vault                                  = 192,
		DBDSlasherScore_StartChaseWithChainsawAttack          = 193,
		DBDSlasherScore_MissedAttackInChase                   = 194,
		DBDCamperScore_DodgeAndVault                          = 195,
		DBDCamperScore_BeginQuickVault                        = 196,
		DBDSlasherScore_StartChainsawAttack                   = 197,
		DBDCamperScore_WakeUpBySkillCheck                     = 198,
		DBDCamperScore_FallAsleep                             = 199,
		DBDCamperScore_WakeUpSelf                             = 200,
		DBDCamperScore_WakeUpOther                            = 201,
		DBDSlasherScore_RecentlyAsleepAttack                  = 202,
		DBDSlasherScore_SurvivorPartyOnBasementHooks          = 203,
		DBDCamperScore_LootBasementChest                      = 204,
		DBDPlayerScore_OpenMysteryBox                         = 205,
		DBDGameEvent_SurvivorDowned                           = 206,
		DBDGameEvent_SurvivorDied                             = 207,
		DBDGameEvent_KillerCloak                              = 208,
		DBDSlasherScore_SetReverseBearTrap                    = 209,
		DBDSlasherScore_AbductionDash                         = 210,
		DBDSlasherScore_DashHitSuccess                        = 211,
		DBDSlasherScore_KillWithReverseBearTrap               = 212,
		DBDCamperScore_SearchRBTKey                           = 213,
		DBDCamperScore_EscapeRBT                              = 214,
		DBDGameEvent_ReplacedGoodSkillCheckAsGreat            = 215,
		DBDCamperScore_RemoveReverseBearTrapSkillCheckSuccess = 216,
		DBDCamperScore_RemoveReverseBearTrapSkillCheckBonus   = 217,
		DBDSlasherScore_DamageGeneratorWhileHooked            = 218,
		DBDGameEvent_SurvivorDamaged                          = 219,
		DBDGameEvent_SurvivorHealed                           = 220,
		DBDGameEvent_Interruption                             = 221,
		DBDGameEvent_SurvivorFailedHealSkillcheck             = 222,
		DBDGameEvent_HookedSurvivorSacrificeBegin             = 223,
		DBDGameEvent_AcquireEventKillerCoin                   = 224,
		DBDGameEvent_AcquireEventSurvivorCoin                 = 225,
		DBDCamperScore_EventGeneratorFixed                    = 226,
		DBDSlasherScore_HookedOnEventHook                     = 227,
		DBDGameEvent_GeneratorProgress                        = 228,
		DBDSlasherScore_DownSmokedCamper                      = 229,
		DBDSlasherScore_HitSmokedCamper                       = 230,
		DBDSlasherScore_SurvivorEnterGasCloud                 = 231,
		DBDSlasherScore_BombDirectHit                         = 232,
		DBDSlasherScore_ThrowBomb                             = 233,
		DBDGameEvent_CoopAction                               = 234,
		DBDSlasherScore_StartActivePhaseWalk                  = 235,
		DBDScore_Count                                        = 236,
		Count                                                 = 237,
		MAX                                                   = 238
	};

	/**
	 * Enum DeadByDaylight.ECustomizationCategory
	 */
	enum class ECustomizationCategory : uint8_t
	{
		None          = 0,
		SurvivorHead  = 1,
		SurvivorTorso = 2,
		SurvivorLegs  = 3,
		KillerHead    = 4,
		KillerBody    = 5,
		KillerWeapon  = 6,
		Outfits       = 7,
		Charm         = 8,
		MAX           = 9
	};

	/**
	 * Enum DeadByDaylight.EOfferingCategory
	 */
	enum class EOfferingCategory : uint8_t
	{
		None        = 0,
		Bloodpoints = 1,
		Mapmods     = 2,
		Realms      = 3,
		Shrouds     = 4,
		Wards       = 5,
		CharacterXP = 6,
		Luck        = 7,
		Moris       = 8,
		MAX         = 9
	};

	/**
	 * Enum DeadByDaylight.EPerkCategory
	 */
	enum class EPerkCategory : uint8_t
	{
		None        = 0,
		Navigation  = 1,
		Perception  = 2,
		Safeguard   = 3,
		Concealment = 4,
		Strategy    = 5,
		Support     = 6,
		Adaptation  = 7,
		Chasing     = 8,
		Tracking    = 9,
		Cruelty     = 10,
		Trickery    = 11,
		Obstruction = 12,
		Hinderance  = 13,
		Enhancement = 14,
		MAX         = 15
	};

	/**
	 * Enum DeadByDaylight.ETeachableStatus
	 */
	enum class ETeachableStatus : uint8_t
	{
		Unknown           = 0,
		Locked            = 1,
		AvailableInShrine = 2,
		Checked           = 3,
		MAX               = 4
	};

	/**
	 * Enum DeadByDaylight.EEmblemQuality
	 */
	enum class EEmblemQuality : uint8_t
	{
		None       = 0,
		Bronze     = 1,
		Silver     = 2,
		Gold       = 3,
		Iridescent = 4,
		Count      = 5,
		MAX        = 6
	};

	/**
	 * Enum DeadByDaylight.ECamperDamageState
	 */
	enum class ECamperDamageState : uint8_t
	{
		VE_Healthy = 0,
		VE_Injured = 1,
		VE_KO      = 2,
		VE_Dead    = 3,
		VE_MAX     = 4
	};

	/**
	 * Enum DeadByDaylight.EHealthType
	 */
	enum class EHealthType : uint8_t
	{
		Alive      = 0,
		Sacrificed = 1,
		Killed     = 2,
		BledOut    = 3,
		Left_Game  = 4,
		MAX        = 5
	};

	/**
	 * Enum DeadByDaylight.ECamperImmobilizeState
	 */
	enum class ECamperImmobilizeState : uint8_t
	{
		VE_None       = 0,
		VE_Hooked     = 1,
		VE_Trapped    = 2,
		VE_Hiding     = 3,
		VE_Dead       = 4,
		VE_InDeathBed = 5,
		VE_MAX        = 6
	};

	/**
	 * Enum DeadByDaylight.EAttackZoneSet
	 */
	enum class EAttackZoneSet : uint8_t
	{
		VE_OriginalZones = 0,
		VE_WedgeZones    = 1,
		VE_MAX           = 2
	};

	/**
	 * Enum DeadByDaylight.ESlasherGuidedAction
	 */
	enum class ESlasherGuidedAction : uint8_t
	{
		VE_None        = 0,
		VE_Hooking     = 1,
		VE_PickingUp   = 2,
		VE_PuttingDown = 3,
		VE_MAX         = 4
	};

	/**
	 * Enum DeadByDaylight.EOfferingAnimState
	 */
	enum class EOfferingAnimState : uint8_t
	{
		None            = 0,
		Idle            = 1,
		Init            = 2,
		Reveal          = 3,
		ShowInteraction = 4,
		Burned          = 5,
		Returned        = 6,
		Cancel          = 7,
		Hidden          = 8,
		MAX             = 9
	};

	/**
	 * Enum DeadByDaylight.EGeneratorTrapType
	 */
	enum class EGeneratorTrapType : uint8_t
	{
		None      = 0,
		BlastMine = 1,
		Wiretap   = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadByDaylight.EInteractionComparisonPriority
	 */
	enum class EInteractionComparisonPriority : uint8_t
	{
		Lower  = 0,
		Equal  = 1,
		Higher = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadByDaylight.EInteractionOwnership
	 */
	enum class EInteractionOwnership : uint8_t
	{
		AnyCanUse       = 0,
		OnlyOwnerCanUse = 1,
		OwnerCannotUse  = 2,
		MAX             = 3
	};

	/**
	 * Enum DeadByDaylight.ESnapBackPositionType
	 */
	enum class ESnapBackPositionType : uint8_t
	{
		SnapBackToInitialPosition        = 0,
		SnapBackToOffsetPositionFromSnap = 1,
		MAX                              = 2
	};

	/**
	 * Enum DeadByDaylight.ESnapBackType
	 */
	enum class ESnapBackType : uint8_t
	{
		None                       = 0,
		Always                     = 1,
		OnInteractionCancelledOnly = 2,
		OnInteractionEndOnly       = 3,
		OnSurvivorDownedOnly       = 4,
		MAX                        = 5
	};

	/**
	 * Enum DeadByDaylight.ETotemState
	 */
	enum class ETotemState : uint8_t
	{
		Cleansed = 0,
		Dull     = 1,
		Hex      = 2,
		Boon     = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadByDaylight.ETutorialStep
	 */
	enum class ETutorialStep : uint8_t
	{
		Survivor_NotStarted        = 0,
		Survivor_CompleteGenerator = 1,
		Survivor_EvadeKiller       = 2,
		Survivor_OnHook            = 3,
		Done                       = 4,
		Invalid                    = 5,
		MAX                        = 6
	};

	/**
	 * Enum DeadByDaylight.EInventoryType
	 */
	enum class EInventoryType : uint8_t
	{
		Main     = 0,
		Backpack = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.EAttachToSocketNameEnum
	 */
	enum class EAttachToSocketNameEnum : uint8_t
	{
		ManualAttachment         = 0,
		HandItemSocket           = 1,
		Weapon_SocketLT          = 2,
		Weapon_SocketRT          = 3,
		LanternCollectableSocket = 4,
		Tentacle_SocketLT        = 5,
		MAX                      = 6
	};

	/**
	 * Enum DeadByDaylight.ECollectableState
	 */
	enum class ECollectableState : uint8_t
	{
		OnGround     = 0,
		Stored       = 1,
		Equipped     = 2,
		ToBeDropped  = 3,
		InSearchable = 4,
		MAX          = 5
	};

	/**
	 * Enum DeadByDaylight.ECollectableCategory
	 */
	enum class ECollectableCategory : uint8_t
	{
		Common = 0,
		Rare   = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadByDaylight.EItemHandPosition
	 */
	enum class EItemHandPosition : uint8_t
	{
		None              = 0,
		HandleItem        = 1,
		AimItem           = 2,
		SmallItem         = 3,
		FirecrackerItem   = 4,
		VaccineItem       = 5,
		FragileObjectItem = 6,
		SprayBottleItem   = 7,
		MAX               = 8
	};

	/**
	 * Enum DeadByDaylight.EAtlantaItemProgressionBarEnum
	 */
	enum class EAtlantaItemProgressionBarEnum : uint8_t
	{
		PrimaryBar   = 0,
		SecondaryBar = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadByDaylight.ELanternState
	 */
	enum class ELanternState : uint8_t
	{
		Collectable = 0,
		Collected   = 1,
		Destroyed   = 2,
		Destroyable = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadByDaylight.EHitValidatorConfigName
	 */
	enum class EHitValidatorConfigName : uint8_t
	{
		Default           = 0,
		Hatchet           = 1,
		Bomb              = 2,
		Harpoon           = 3,
		Oni               = 4,
		Whip              = 5,
		DefaultProjectile = 6,
		MAX               = 7
	};

	/**
	 * Enum DeadByDaylight.EMovementCurveType
	 */
	enum class EMovementCurveType : uint8_t
	{
		AdditiveSpeedCurve       = 0,
		MultiplicativeSpeedCurve = 1,
		MAX                      = 2
	};

	/**
	 * Enum DeadByDaylight.EAudioCustomizationCategory
	 */
	enum class EAudioCustomizationCategory : uint8_t
	{
		AudioCharacterName     = 0,
		AudioCharacterSubName  = 1,
		AudioCharacterHead     = 2,
		AudioCharacterClothes  = 3,
		AudioCharacterShoes    = 4,
		AudioCharacterWeapon   = 5,
		AudioCharacterAmbiance = 6,
		AudioCharacterState    = 7,
		MAX                    = 8
	};

	/**
	 * Enum DeadByDaylight.EActionButtonState
	 */
	enum class EActionButtonState : uint8_t
	{
		Normal   = 0,
		Toggled  = 1,
		Disabled = 2,
		Hidden   = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadByDaylight.EKnowledgeSharingType
	 */
	enum class EKnowledgeSharingType : uint8_t
	{
		Possessor = 0,
		Survivors = 1,
		Killers   = 2,
		All       = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadByDaylight.EGameplayElementType
	 */
	enum class EGameplayElementType : uint8_t
	{
		Generic              = 0,
		MeatLocker_Small     = 1,
		TileLights           = 2,
		MeatLocker_Big       = 3,
		Searchable           = 4,
		EdgeObjects          = 5,
		LivingWorldObjects   = 6,
		Hatch                = 7,
		Bookshelves          = 8,
		Totems               = 9,
		QuadrantSpawn        = 10,
		EdgeObjectsBlocker   = 11,
		BreakableWalls       = 12,
		Escape               = 13,
		ThemeSpawner         = 14,
		Basement_Attachments = 15,
		Count                = 16,
		MAX                  = 17
	};

	/**
	 * Enum DeadByDaylight.EAIHideInLockerState
	 */
	enum class EAIHideInLockerState : uint8_t
	{
		WalkToLocker   = 0,
		GetIntoLocker  = 1,
		HidingInLocker = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadByDaylight.EAIRepairGeneratorState
	 */
	enum class EAIRepairGeneratorState : uint8_t
	{
		FindAvailableGeneratorPosition = 0,
		WalkToGenerator                = 1,
		RotateTowardsGenerator         = 2,
		BeginGeneratorRepairs          = 3,
		RepairingGenerator             = 4,
		MAX                            = 5
	};

	/**
	 * Enum DeadByDaylight.EOwnershipBehaviour
	 */
	enum class EOwnershipBehaviour : uint8_t
	{
		Personal = 0,
		Shared   = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.EStackingBehaviours
	 */
	enum class EStackingBehaviours : uint8_t
	{
		Stackable = 0,
		Override  = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EAdditiveBehaviour
	 */
	enum class EAdditiveBehaviour : uint8_t
	{
		AddValues = 0,
		MaxValue  = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EContextualType
	 */
	enum class EContextualType : uint8_t
	{
		None                    = 0,
		RedGlyph                = 1,
		BlueGlyph               = 2,
		YellowGlyph             = 3,
		PurpleGlyph             = 4,
		IceBlueGlyph            = 5,
		GreenGlyph              = 6,
		OrangeGlyph             = 7,
		PinkGlyph               = 8,
		GlyphUpperBound         = 9,
		ToxinPlantHalloween2020 = 10,
		PumpkinHalloween2021    = 11,
		CoreMemoryPortal        = 12,
		MAX                     = 13
	};

	/**
	 * Enum DeadByDaylight.EArchiveStoryType
	 */
	enum class EArchiveStoryType : uint8_t
	{
		NotSet       = 0,
		CurrentStory = 1,
		PastStory    = 2,
		EventStory   = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadByDaylight.EArm
	 */
	enum class EArm : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadByDaylight.EAtlantaControlTypeSetting
	 */
	enum class EAtlantaControlTypeSetting : uint8_t
	{
		CameraFullScreen = 0,
		SnapOnJoystick   = 1,
		MAX              = 2
	};

	/**
	 * Enum DeadByDaylight.EDeepLinkUid
	 */
	enum class EDeepLinkUid : uint8_t
	{
		NONE                    = 0,
		StorefrontSpecialOffers = 1,
		StorefrontFeatured      = 2,
		StorefrontPremium       = 3,
		StorefrontSubscription  = 4,
		Calendar                = 5,
		RitualsStarter          = 6,
		RitualsDaily            = 7,
		RitualsWeekly           = 8,
		MenuCharactersSurvivors = 9,
		MenuCharactersKillers   = 10,
		MenuCustomizations      = 11,
		MenuEvents              = 12,
		MenuFriends             = 13,
		Loadout                 = 14,
		BloodmarketSurvivors    = 15,
		BloodmarketKillers      = 16,
		External                = 17,
		MAX                     = 18
	};

	/**
	 * Enum DeadByDaylight.EAtlantaDisplayStandPosition
	 */
	enum class EAtlantaDisplayStandPosition : uint8_t
	{
		Forefront  = 0,
		Background = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadByDaylight.EEventsType
	 */
	enum class EEventsType : uint8_t
	{
		Generic              = 0,
		Calendar             = 1,
		BonusACEvent         = 2,
		FirstPremiumPurchase = 3,
		MonthlyPass          = 4,
		Count                = 5,
		MAX                  = 6
	};

	/**
	 * Enum DeadByDaylight.EFreeTicketButtonState
	 */
	enum class EFreeTicketButtonState : uint8_t
	{
		Disabled = 0,
		Enabled  = 1,
		InEffect = 2,
		None     = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadByDaylight.EQuitGameReason
	 */
	enum class EQuitGameReason : uint8_t
	{
		None     = 0,
		Logout   = 1,
		Suspend  = 2,
		Shutdown = 3,
		Count    = 4,
		MAX      = 5
	};

	/**
	 * Enum DeadByDaylight.EFrameRateLimitButtonSetting
	 */
	enum class EFrameRateLimitButtonSetting : uint8_t
	{
		ThirtyFPS = 0,
		SixtyFPS  = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EKillerSoundComparisonType
	 */
	enum class EKillerSoundComparisonType : uint8_t
	{
		Equal         = 0,
		IsGreaterThan = 1,
		IsLesserThan  = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadByDaylight.EMobileLoginAuthContext
	 */
	enum class EMobileLoginAuthContext : uint8_t
	{
		Splash            = 0,
		OverlayMenu       = 1,
		ResumeFromSuspend = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadByDaylight.EAtlantaRewardType
	 */
	enum class EAtlantaRewardType : uint8_t
	{
		Item                = 0,
		AddOn               = 1,
		Offering            = 2,
		BloodPoints         = 3,
		IridescentShards    = 4,
		AuricCells          = 5,
		Customization       = 6,
		FreeTicket          = 7,
		MysteryBox          = 8,
		Character           = 9,
		DuplicatesRefundKey = 10,
		Count               = 11,
		MAX                 = 12
	};

	/**
	 * Enum DeadByDaylight.EAtlantaRitualRewardUIType
	 */
	enum class EAtlantaRitualRewardUIType : uint8_t
	{
		Item             = 0,
		AddOn            = 1,
		Offering         = 2,
		BloodPoints      = 3,
		IridescentShards = 4,
		AuricCells       = 5,
		Customization    = 6,
		CustoTicket      = 7,
		MysteryBox       = 8,
		MAX              = 9
	};

	/**
	 * Enum DeadByDaylight.EAltantaRitualUIType
	 */
	enum class EAltantaRitualUIType : uint8_t
	{
		Single  = 0,
		Master  = 1,
		Special = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadByDaylight.EAttackEventType
	 */
	enum class EAttackEventType : uint8_t
	{
		VE_None                 = 0,
		VE_BasicAttackAttempt   = 1,
		VE_BasicAttackHit       = 2,
		VE_SpecialAttackAttempt = 3,
		VE_SpecialAttackHit     = 4,
		VE_MAX                  = 5
	};

	/**
	 * Enum DeadByDaylight.EBPBonusType
	 */
	enum class EBPBonusType : uint8_t
	{
		None      = 0,
		Event     = 1,
		Offerings = 2,
		Others    = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadByDaylight.EBloodchestType
	 */
	enum class EBloodchestType : uint8_t
	{
		None        = 0,
		Chest       = 1,
		SuperChests = 2,
		EntityBox   = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadByDaylight.EBloodwebFillingMethod
	 */
	enum class EBloodwebFillingMethod : uint8_t
	{
		RestrictionsBasedOnData = 0,
		FillAll                 = 1,
		MAX                     = 2
	};

	/**
	 * Enum DeadByDaylight.EBloodMarketRefreshMethod
	 */
	enum class EBloodMarketRefreshMethod : uint8_t
	{
		Automatic = 0,
		Manual    = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EBloodwebDefinitionContentType
	 */
	enum class EBloodwebDefinitionContentType : uint8_t
	{
		Empty         = 0,
		Nodes         = 1,
		Paths         = 2,
		NodesAndPaths = 3,
		NodesNoPath   = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadByDaylight.EBloodwebDistributionType
	 */
	enum class EBloodwebDistributionType : uint8_t
	{
		PerWeb  = 0,
		PerRing = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadByDaylight.EBloodwebDataSource
	 */
	enum class EBloodwebDataSource : uint8_t
	{
		ByLevel = 0,
		ByRing  = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadByDaylight.EBloodwebSaveReason
	 */
	enum class EBloodwebSaveReason : uint8_t
	{
		PayToRefresh  = 0,
		PrestigeUp    = 1,
		ShouldRebuild = 2,
		Cheat         = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadByDaylight.EBloodwebNodeGateTypes
	 */
	enum class EBloodwebNodeGateTypes : uint8_t
	{
		RequiredRank = 0,
		RequiredItem = 1,
		Count        = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadByDaylight.EBloodwebNodeContentType
	 */
	enum class EBloodwebNodeContentType : uint8_t
	{
		Empty                           = 0,
		Perks                           = 1,
		PerkBuffs_Do_Not_Use_Deprecated = 2,
		Offerings                       = 3,
		Items                           = 4,
		AddOn                           = 5,
		Chests                          = 6,
		PerksPacks                      = 7,
		IridiscentShards                = 8,
		AuricCells                      = 9,
		SuperChests                     = 10,
		CosmeticItems                   = 11,
		Bloodpoints                     = 12,
		FreeTicket                      = 13,
		EntityBox                       = 14,
		Count                           = 15,
		MAX                             = 16
	};

	/**
	 * Enum DeadByDaylight.EBloodwebNodeState
	 */
	enum class EBloodwebNodeState : uint8_t
	{
		Inactive                     = 0,
		Available                    = 1,
		Locked_Do_Not_Use_Deprecated = 2,
		Collected                    = 3,
		Consumed                     = 4,
		Count                        = 5,
		MAX                          = 6
	};

	/**
	 * Enum DeadByDaylight.EBloodwebRing
	 */
	enum class EBloodwebRing : uint8_t
	{
		CenterRing = 0,
		InnerRing  = 1,
		MiddleRing = 2,
		OuterRing  = 3,
		EntityRing = 4,
		RingCount  = 5,
		Count      = 6,
		MAX        = 7
	};

	/**
	 * Enum DeadByDaylight.EBreakableState
	 */
	enum class EBreakableState : uint8_t
	{
		Unbroken = 0,
		Broken   = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.ECameraOffsetState
	 */
	enum class ECameraOffsetState : uint8_t
	{
		None      = 0,
		Default   = 1,
		Crouching = 2,
		Crawling  = 3,
		Carried   = 4,
		MAX       = 5
	};

	/**
	 * Enum DeadByDaylight.ECameraFadeState
	 */
	enum class ECameraFadeState : uint8_t
	{
		FadedIn   = 0,
		FadingOut = 1,
		FadedOut  = 2,
		FadingIn  = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadByDaylight.EManualZoomType
	 */
	enum class EManualZoomType : uint8_t
	{
		None                  = 0,
		TargetZoomValue       = 1,
		CurveFloatProgression = 2,
		MAX                   = 3
	};

	/**
	 * Enum DeadByDaylight.EDBDCameraSocketID
	 */
	enum class EDBDCameraSocketID : uint8_t
	{
		VE_None      = 0,
		VE_Default   = 1,
		VE_Killcam   = 2,
		VE_Reaction  = 3,
		VE_Struggle  = 4,
		VE_Sacrifice = 5,
		VE_MAX       = 6
	};

	/**
	 * Enum DeadByDaylight.EEscapeType
	 */
	enum class EEscapeType : uint8_t
	{
		Escape_ExitGate         = 0,
		Escape_Hatch            = 1,
		Escape_KillerDisconnect = 2,
		Escape_MAX              = 3
	};

	/**
	 * Enum DeadByDaylight.ECDNPatchCompleteStatus
	 */
	enum class ECDNPatchCompleteStatus : uint8_t
	{
		Success                             = 0,
		NotEnoughDiskSpace                  = 1,
		PatchInstallDownloadError           = 2,
		PatchInstallFileConstructionFail    = 3,
		PatchInstallMoveFileToInstallFail   = 4,
		PatchInstallBuildVerifyFail         = 5,
		PatchInstallApplicationClosing      = 6,
		PatchInstallApplicationError        = 7,
		PatchInstallUserCanceled            = 8,
		PatchInstallPrerequisiteError       = 9,
		PatchInstallInitializationError     = 10,
		PatchInstallPathLengthExceeded      = 11,
		PatchInstallOutOfDiskSpace          = 12,
		PatchInstallUnknownError            = 13,
		FailureToMountContent               = 14,
		InstalledContentNotFound            = 15,
		InvalidPendingContent               = 16,
		CantFindContentToDownload           = 17,
		NoPatchForCurrentPlatformAndVersion = 18,
		FailureToRetrieveContent            = 19,
		CancelledByUser                     = 20,
		MAX                                 = 21
	};

	/**
	 * Enum DeadByDaylight.ECharacterToolItemType
	 */
	enum class ECharacterToolItemType : uint8_t
	{
		None        = 0,
		Outfit      = 1,
		OutfitPiece = 2,
		Charm       = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadByDaylight.EChargeableInteractionBarType
	 */
	enum class EChargeableInteractionBarType : uint8_t
	{
		VE_Normal       = 0,
		VE_ProgressPips = 1,
		VE_MAX          = 2
	};

	/**
	 * Enum DeadByDaylight.ECharmCategory
	 */
	enum class ECharmCategory : uint8_t
	{
		None   = 0,
		Small  = 1,
		Medium = 2,
		Big    = 3,
		Short  = 4,
		Wide   = 5,
		Chibi  = 6,
		Square = 7,
		Tablet = 8,
		Perk   = 9,
		MAX    = 10
	};

	/**
	 * Enum DeadByDaylight.EContext
	 */
	enum class EContext : uint8_t
	{
		None                        = 0,
		ArchiveIntro                = 1,
		ArchiveMenu                 = 2,
		ArchivePastStories          = 3,
		ArchiveRewards              = 4,
		ArchiveStory                = 5,
		ArchiveCompendium           = 6,
		ArchiveRift                 = 7,
		ArchiveTome                 = 8,
		BloodWeb                    = 9,
		Character                   = 10,
		Consent                     = 11,
		Credits                     = 12,
		Customization               = 13,
		GameFlowOff                 = 14,
		Hud                         = 15,
		Inbox                       = 16,
		LightSensitivity            = 17,
		Loading                     = 18,
		Loadout                     = 19,
		Lobby                       = 20,
		LobbyOff                    = 21,
		MainMenu                    = 22,
		Onboarding                  = 23,
		RoleSelection               = 24,
		SpecialEventLoading         = 25,
		Spectate                    = 26,
		Splash                      = 27,
		Store                       = 28,
		Tally                       = 29,
		Tutorial                    = 30,
		ArchivePassPurchasePopup    = 31,
		ArchiveTierPurchasePopup    = 32,
		CrowdChoiceTugOfWarPopup    = 33,
		DailyRewardsPopup           = 34,
		EventEntryPopup             = 35,
		FearMarketPopup             = 36,
		FriendSearchPopup           = 37,
		GenericPopup                = 38,
		GenericTextInputPopup       = 39,
		NewContentPopup             = 40,
		ProcessingPopup             = 41,
		ReportPlayerPopup           = 42,
		SeasonEndPopup              = 43,
		SeasonEndRankRewardsPopup   = 44,
		UnlockPersonalPerksPopup    = 45,
		LoadoutMenuPopup            = 46,
		UMGArchivePassPurchasePopup = 47,
		UMGArchiveTierPurchasePopup = 48,
		UMGDailyRitualsPopup        = 49,
		UMGEventEntryPopup          = 50,
		UMGFearMarketPopup          = 51,
		UMGGenericPopup             = 52,
		UMGGenericTextInputPopup    = 53,
		UMGUnlockPersonalPerksPopup = 54,
		Count                       = 55,
		MAX                         = 56
	};

	/**
	 * Enum DeadByDaylight.EItemDomain
	 */
	enum class EItemDomain : uint8_t
	{
		Store = 0,
		Local = 1,
		Any   = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadByDaylight.EOwnership
	 */
	enum class EOwnership : uint8_t
	{
		Owned    = 0,
		NotOwned = 1,
		Any      = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EHudEditorDragAxisOption
	 */
	enum class EHudEditorDragAxisOption : uint8_t
	{
		PositiveSide = 0,
		NegativeSide = 1,
		BothSide     = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadByDaylight.EUMGDailyRewardWidgetState
	 */
	enum class EUMGDailyRewardWidgetState : uint8_t
	{
		Unknown                = 0,
		Locked                 = 1,
		ReadyToCollect         = 2,
		NewlyCollected         = 3,
		Collected              = 4,
		MysteryLocked          = 5,
		MysteryReadyToDiscover = 6,
		MysteryNewlyDiscovered = 7,
		MAX                    = 8
	};

	/**
	 * Enum DeadByDaylight.DBDScalabilityLevel
	 */
	enum class EDBDScalabilityLevel : uint8_t
	{
		DBDScalabilityLevelLOW                     = 0,
		DBDScalabilityLevelMEDIUM                  = 1,
		DBDScalabilityLevelHIGH                    = 2,
		DBDScalabilityLevelEPIC                    = 3,
		DBDScalabilityLevelULTRA                   = 4,
		DBDScalabilityLevelDBDScalabilityLevel_MAX = 5
	};

	/**
	 * Enum DeadByDaylight.EAIDodgeType
	 */
	enum class EAIDodgeType : uint8_t
	{
		FORWARD_SIDE_STEP  = 0,
		SIDE_STEP          = 1,
		BACKWARD_SIDE_STEP = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadByDaylight.EInLockerSkillsContext
	 */
	enum class EInLockerSkillsContext : uint8_t
	{
		None              = 0,
		Goal              = 1,
		OutOfTerrorRadius = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadByDaylight.EPawnInputPressTypes
	 */
	enum class EPawnInputPressTypes : uint8_t
	{
		None                   = 0,
		FastInteract           = 1,
		Interact               = 2,
		Struggle               = 3,
		Slash                  = 4,
		Attack                 = 5,
		Action                 = 6,
		SecondaryAction        = 7,
		UseItem                = 8,
		DropItem               = 9,
		Gesture01              = 10,
		Gesture02              = 11,
		Gesture03              = 12,
		Gesture04              = 13,
		Run                    = 14,
		RunningFastInteraction = 15,
		CancelMinigame         = 16,
		MAX                    = 17
	};

	/**
	 * Enum DeadByDaylight.EAIDifficultyLevel
	 */
	enum class EAIDifficultyLevel : uint8_t
	{
		VeryEasy  = 0,
		Easy      = 1,
		Medium    = 2,
		Hard      = 3,
		Suggested = 4,
		Random    = 5,
		None      = 6,
		Max       = 7,
		MAX       = 8
	};

	/**
	 * Enum DeadByDaylight.ECharacterMovementTypes
	 */
	enum class ECharacterMovementTypes : uint8_t
	{
		Normal = 0,
		Run    = 1,
		Crouch = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadByDaylight.EAITerrorLevel
	 */
	enum class EAITerrorLevel : uint8_t
	{
		None     = 0,
		Low      = 1,
		Min      = 2,
		Medium   = 3,
		High     = 4,
		VeryHigh = 5,
		Max      = 6,
		MAX      = 7
	};

	/**
	 * Enum DeadByDaylight.ECamperGuidedAction
	 */
	enum class ECamperGuidedAction : uint8_t
	{
		VE_None                        = 0,
		VE_PrepBeingKilled             = 1,
		VE_BeingKilled                 = 2,
		VE_PrepGuidedAction            = 3,
		VE_BeingHelpedOffHookFront     = 4,
		VE_BeingHelpedOffHookBack      = 5,
		VE_BeingPickedUp               = 6,
		VE_BeingPutDown                = 7,
		VE_BeingCarried                = 8,
		VE_BeingPutOnHook              = 9,
		VE_BeingHealed                 = 10,
		VE_BeingPulledFromCloset       = 11,
		VE_BeingHelpedFromTrap         = 12,
		VE_AttachReverseBearTrap       = 13,
		VE_BeingMended                 = 14,
		VE_BeingInjectedWithSerum      = 15,
		VE_CarriedByK29Rush            = 16,
		VE_BeingCleansedOfK29Infection = 17,
		VE_MAX                         = 18
	};

	/**
	 * Enum DeadByDaylight.ECustomMovementMode
	 */
	enum class ECustomMovementMode : uint8_t
	{
		CUSTOM_MOVE_None     = 0,
		CUSTOM_MOVE_Snapping = 1,
		CUSTOM_MOVE_MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.EDangerTraverseState
	 */
	enum class EDangerTraverseState : uint8_t
	{
		SAFE            = 0,
		WAIT            = 1,
		TRAVERSE_CROUCH = 2,
		TRAVERSE_RUN    = 3,
		UNDODGEABLE     = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadByDaylight.EDiceRollType
	 */
	enum class EDiceRollType : uint8_t
	{
		VE_EscapeHook        = 0,
		VE_EscapeTrap        = 1,
		VE_TrapInflictsDying = 2,
		VE_TriggerSkillCheck = 3,
		VE_TriggerFootNoise  = 4,
		VE_TriggerCrowAlert  = 5,
		VE_MAX               = 6
	};

	/**
	 * Enum DeadByDaylight.EEmblemProgressionType
	 */
	enum class EEmblemProgressionType : uint8_t
	{
		SurvivorLightbringerStartingValue   = 0,
		SurvivorLightbringerGeneratorRepair = 1,
		SurvivorLightbringerTotemCleanse    = 2,
		SurvivorLightbringerKillerDiversion = 3,
		SurvivorLightbringerExitGameOpen    = 4,
		SurvivorUnbrokenTimeAlive           = 5,
		SurvivorBenevolentStartingValue     = 6,
		SurvivorBenevolentHealing           = 7,
		SurvivorBenevolentHooked            = 8,
		SurvivorBenevolentUnhook            = 9,
		SurvivorBenevolentPerformUnhook     = 10,
		SurvivorBenevolentSaveFromKiller    = 11,
		SurvivorBenevolentUnsafeUnhook      = 12,
		SurvivorBenevolentHitWhileCarrying  = 13,
		SurvivorEvaderStartingValue         = 14,
		SurvivorEvaderSneaking              = 15,
		SurvivorEvaderChaseWon              = 16,
		SurvivorEvaderChaseLost             = 17,
		SurvivorEvaderPalletStun            = 18,
		KillerGatekeeperStartingValue       = 19,
		KillerGatekeeperGeneratorDefense    = 20,
		KillerGatekeeperGatesClosed         = 21,
		KillerDevoutStartingValue           = 22,
		KillerDevoutSacrifice               = 23,
		KillerDevoutDisconnect              = 24,
		KillerDevoutMoris                   = 25,
		KillerDevoutAllSurvivorsHooked      = 26,
		KillerDevoutHooksBonus              = 27,
		KillerMaliciousStartingValue        = 28,
		KillerMaliciousInjuries             = 29,
		KillerMaliciousHookStages           = 30,
		KillerMaliciousInjuriesHealed       = 31,
		KillerMaliciousEscapeGrasp          = 32,
		KillerMaliciousDisconnect           = 33,
		KillerChaserStartingValue           = 34,
		KillerChaserSurvivorFound           = 35,
		KillerChaserSurvivorLost            = 36,
		KillerChaserHit                     = 37,
		KillerChaserChaseWon                = 38,
		KillerChaserProximityToHookPenalty  = 39,
		Invalid                             = 40,
		MAX                                 = 41
	};

	/**
	 * Enum DeadByDaylight.EEmblemEvaluation
	 */
	enum class EEmblemEvaluation : uint8_t
	{
		Authority = 0,
		Local     = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EErrorCodes
	 */
	enum class EErrorCodes : uint8_t
	{
		None                                  = 0,
		SavefileDeserializationFailure        = 1,
		SavefileDecryptionFailure             = 2,
		SavefileEmpty                         = 3,
		SavefileBadPlayerId                   = 4,
		SavefileEmptyPlayerUID                = 5,
		SavefileInvalidUniqueNetID            = 6,
		SavefileInvalidPlayerState            = 7,
		SavefileBackendError                  = 8,
		KrakenRankError                       = 9,
		KrakenRatingsError                    = 10,
		SavefileKrakenPlayerForbidden         = 11,
		SyncCachedCurrencyError               = 12,
		CurrencyTransactionError              = 13,
		StateDownloadFailed                   = 14,
		StatcacheDecryptionFailed             = 15,
		SavefilePlayerLoadUIDMismatch         = 16,
		SavefilePlayerStateUIDMismatch        = 17,
		CharacterMigrationGetError            = 18,
		CharacterMigrationGetError_BadProfile = 19,
		SavefileEncryptionFailure             = 20,
		SaveFailedInvalidData                 = 21,
		SaveFailedInvalidJSON                 = 22,
		SaveFailedDecodeDataString            = 23,
		SaveFailedCompressDataString          = 24,
		SaveFailedEncryptString               = 25,
		StatcacheEncryptionFailed             = 26,
		SaveFailedCloudErrorTimeout           = 27,
		JsonToPersistenDataFailed             = 28,
		SaveFailedCloudErrorAfterRetries      = 29,
		StateUploadFailed                     = 30,
		GetPlayerLevelRequestError            = 31,
		EarnPlayerXpRequestError              = 32,
		EarnPlayerXpParamError                = 33,
		EndOfMatchError                       = 34,
		OnboardingFailGet                     = 35,
		OnboardingFailUpdate                  = 36,
		OnboardingFailRequest                 = 37,
		MatchCancelledPlayerLeftDuringLoading = 38,
		MatchCancelledInvalidPlayerRoles      = 39,
		MatchCancelledLoadingTimeout          = 40,
		PakValidationFailed                   = 41,
		KrakenSdkMismatch                     = 42,
		MAX                                   = 43
	};

	/**
	 * Enum DeadByDaylight.EGameIntroSteps
	 */
	enum class EGameIntroSteps : uint8_t
	{
		Idling         = 0,
		PlayingIntro   = 1,
		LoopingCamView = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadByDaylight.EDisconnectErrors
	 */
	enum class EDisconnectErrors : uint8_t
	{
		None                                 = 0,
		SteamAuthFailure                     = 1,
		SteamAuthFailureKickedFromServer     = 2,
		EACServerValidationFailure           = 3,
		EACValidationFailureKickedFromServer = 4,
		EACClientNotRunning                  = 5,
		EACClientIntegrityViolation          = 6,
		PlayerRemovedOnSuspend               = 7,
		LostConnectionToHost                 = 8,
		LostConnectionToProfileService       = 9,
		MirrorsUnscheduledSessionDestruction = 10,
		SessionKilledByMirrors               = 11,
		UnableToSaveProfileAfterRetries      = 12,
		UnableToGetPlayerLevel               = 13,
		UnableToEarnPlayerXp                 = 14,
		UnableToUpdatePips                   = 15,
		UnableToUpdateRatings                = 16,
		ClientProviderAuthenticationFailed   = 17,
		UnableToSyncCachedCurrency           = 18,
		OwnershipValidationFailure           = 19,
		UnableToUpdateEndOfMatchInfo         = 20,
		TravelFailure                        = 21,
		MAX                                  = 22
	};

	/**
	 * Enum DeadByDaylight.ELevelLoadingSteps
	 */
	enum class ELevelLoadingSteps : uint8_t
	{
		Invalid                                = 0,
		WaitingForProceduralLevelBuilder       = 1,
		WaitingForPlayersToBeSpawned           = 2,
		WaitingForAIPawnToBeSpawned            = 3,
		WaitingForAssetPreloader               = 4,
		WaitingForLoadoutAndTheme              = 5,
		WaitingForPIAToBeSpawnedAndInitialized = 6,
		WaitingForNavmeshComputationToStart    = 7,
		WaitingForNavmeshComputationToFinish   = 8,
		SetGameLoadedAndReadyToPlay            = 9,
		WaitingForIntroToBeDone                = 10,
		LoadingCompleted                       = 11,
		FirstLoadingStep                       = 12,
		Count                                  = 13,
		MAX                                    = 14
	};

	/**
	 * Enum DeadByDaylight.ELoadProgress
	 */
	enum class ELoadProgress : uint8_t
	{
		NotStarted                        = 0,
		Init                              = 1,
		SetupPIE                          = 2,
		ArtificialDelay                   = 3,
		DisconnectingPresencePlugin       = 4,
		ValidateOnlineSubsystem           = 5,
		CheckingPlatformService           = 6,
		PreMirrorsLogin                   = 7,
		ConnectingToMirrors               = 8,
		StartEAC                          = 9,
		LoadingAuthInfo                   = 10,
		LoadingBackendConfigs             = 11,
		SetupRichPresence                 = 12,
		LoadingBackendTunables            = 13,
		ApplyingCDNPatch                  = 14,
		AquiringExternalAuthentication    = 15,
		LoadingPlayerIndependentShopData  = 16,
		LicenseCache                      = 17,
		LoadingEvents                     = 18,
		LoadingInventory                  = 19,
		LoadingCinematics                 = 20,
		SyncingOwnedCharacters            = 21,
		LoadingProfile                    = 22,
		LoadingMirrorCurrencies           = 23,
		LoadingWallet                     = 24,
		LoadingConsent                    = 25,
		LoadingGameConfigs                = 26,
		LoadingCharacterXPTables          = 27,
		CheckingPendingTransactions       = 28,
		LoadingContentSchedule            = 29,
		LoadingNews                       = 30,
		SendingAnalytics                  = 31,
		LoadingDailyRituals               = 32,
		CalculatingLatencies              = 33,
		ValidateData                      = 34,
		ValidatingClientVersion           = 35,
		CheckingNeedForCurrencyMigration  = 36,
		MigratingCurrenciesToMirror       = 37,
		SyncingFriendsList                = 38,
		Complete                          = 39,
		Locating                          = 40,
		InitializingRTMConnection         = 41,
		LoadingStreamVideoData            = 42,
		CollectingFreeCatalogItems        = 43,
		DownloadDynamicContent            = 44,
		CheckingMobilePendingTransactions = 45,
		LoadMarketingBanners              = 46,
		LoadingSubscriptionStatus         = 47,
		RequestingTrackingAuthorization   = 48,
		LoadingExperimentalFeatures       = 49,
		LoadingMatchIncentives            = 50,
		LoadingLoadoutPresets             = 51,
		LoadingBackendCharacterData       = 52,
		LoadingPrestige                   = 53,
		UpdatingOwnedContent              = 54,
		LoadingShrine                     = 55,
		LoadingReportFeedback             = 56,
		LoadingGameConfigsDS              = 57,
		LoadingCatalog                    = 58,
		LoadingS3PrestigeData             = 59,
		MAX                               = 60
	};

	/**
	 * Enum DeadByDaylight.EProceduralDebugMode
	 */
	enum class EProceduralDebugMode : uint8_t
	{
		None       = 0,
		NoMap      = 1,
		TilesSmall = 2,
		TilesBig   = 3,
		Count      = 4,
		MAX        = 5
	};

	/**
	 * Enum DeadByDaylight.EAIEvadeLoopSides
	 */
	enum class EAIEvadeLoopSides : uint8_t
	{
		Left  = 0,
		Right = 1,
		Count = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadByDaylight.EAuthoritativeMovementFlag
	 */
	enum class EAuthoritativeMovementFlag : uint8_t
	{
		INTERACTION                   = 0,
		SLASHED                       = 1,
		CHEAT                         = 2,
		DROPPED                       = 3,
		NOPUSH                        = 4,
		INTERACTIONNOPUSH             = 5,
		DREAMWORLD_NOSLASHERCOLLISION = 6,
		NOPUSHFORCED                  = 7,
		COUNT                         = 8,
		MAX                           = 9
	};

	/**
	 * Enum DeadByDaylight.EPlayerMovementDirection
	 */
	enum class EPlayerMovementDirection : uint8_t
	{
		Left     = 0,
		Right    = 1,
		Forward  = 2,
		Backward = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadByDaylight.ECharacterStance
	 */
	enum class ECharacterStance : uint8_t
	{
		VE_Stand  = 0,
		VE_Crouch = 1,
		VE_Crawl  = 2,
		VE_MAX    = 3
	};

	/**
	 * Enum DeadByDaylight.EPlayerGameplayEventType
	 */
	enum class EPlayerGameplayEventType : uint8_t
	{
		VE_UnhookedOther  = 0,
		VE_UntrappedOther = 1,
		VE_HealedOther    = 2,
		VE_MAX            = 3
	};

	/**
	 * Enum DeadByDaylight.EVisibleMenuActorType
	 */
	enum class EVisibleMenuActorType : uint8_t
	{
		None  = 0,
		Pawn  = 1,
		Hook  = 2,
		Charm = 3,
		MAX   = 4
	};

	/**
	 * Enum DeadByDaylight.EKillerImmobilizedState
	 */
	enum class EKillerImmobilizedState : uint8_t
	{
		VE_None           = 0,
		VE_HidingInLocker = 1,
		VE_MAX            = 2
	};

	/**
	 * Enum DeadByDaylight.EToastInputType
	 */
	enum class EToastInputType : uint8_t
	{
		Toast_Accept = 0,
		Toast_Reject = 1,
		Toast_Close  = 2,
		Toast_MAX    = 3
	};

	/**
	 * Enum DeadByDaylight.EShadowSystem
	 */
	enum class EShadowSystem : uint8_t
	{
		CascadedShadowMap = 0,
		AdaptiveShadowMap = 1,
		MAX               = 2
	};

	/**
	 * Enum DeadByDaylight.EDisplayStandActorType
	 */
	enum class EDisplayStandActorType : uint8_t
	{
		None      = 0,
		Character = 1,
		Hook      = 2,
		Charm     = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadByDaylight.EDoctorAbilityPhase
	 */
	enum class EDoctorAbilityPhase : uint8_t
	{
		VE_Charging = 0,
		VE_Firing   = 1,
		VE_None     = 2,
		VE_MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EDoctorAbilityType
	 */
	enum class EDoctorAbilityType : uint8_t
	{
		VE_ShockTherapy = 0,
		VE_StaticBlast  = 1,
		VE_None         = 2,
		VE_MAX          = 3
	};

	/**
	 * Enum DeadByDaylight.EEndGameScenarioTrigger
	 */
	enum class EEndGameScenarioTrigger : uint8_t
	{
		ClosedHatch  = 0,
		OpenedGate   = 1,
		CheatUsed    = 2,
		NotActivated = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadByDaylight.EEnergyTypeEnum
	 */
	enum class EEnergyTypeEnum : uint8_t
	{
		EInvalid = 0,
		EBattery = 1,
		EHealth  = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EErrorEventType
	 */
	enum class EErrorEventType : uint8_t
	{
		FailedToCalculateRankProgress = 0,
		FailedToEarnPlayerXp          = 1,
		FailedToGrandBloodPoints      = 2,
		FailedToSyncWalletChanges     = 3,
		InvalidLobbyId                = 4,
		InvalidGameState              = 5,
		InvalidSessionId              = 6,
		MAX                           = 7
	};

	/**
	 * Enum DeadByDaylight.EEscapeDoorActivationMode
	 */
	enum class EEscapeDoorActivationMode : uint8_t
	{
		Standard = 0,
		Tutorial = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.EConditionSubject
	 */
	enum class EConditionSubject : uint8_t
	{
		Instigator = 0,
		Target     = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadByDaylight.EEventItemContentType
	 */
	enum class EEventItemContentType : uint8_t
	{
		None           = 0,
		Cells          = 1,
		Character      = 2,
		Customization  = 3,
		NameChangeCard = 4,
		FreeTicket     = 5,
		OtherCurrency  = 6,
		Item           = 7,
		Addon          = 8,
		Offering       = 9,
		Count          = 10,
		MAX            = 11
	};

	/**
	 * Enum DeadByDaylight.EFeaturedStoreContentType
	 */
	enum class EFeaturedStoreContentType : uint8_t
	{
		None          = 0,
		Character     = 1,
		Customization = 2,
		Outfit        = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadByDaylight.ELoadoutType
	 */
	enum class ELoadoutType : uint8_t
	{
		Item     = 0,
		Perk     = 1,
		Offering = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.FlickeringLightType
	 */
	enum class EFlickeringLightType : uint8_t
	{
		FlickeringLightTypePoint                   = 0,
		FlickeringLightTypeRect                    = 1,
		FlickeringLightTypeSpot                    = 2,
		FlickeringLightTypeFlickeringLightType_MAX = 3
	};

	/**
	 * Enum DeadByDaylight.EFriendUIRichPresence
	 */
	enum class EFriendUIRichPresence : uint8_t
	{
		Undefined = 0,
		InMenus   = 1,
		InLobby   = 2,
		InMatch   = 3,
		Connected = 4,
		Closing   = 5,
		MAX       = 6
	};

	/**
	 * Enum DeadByDaylight.EFriendUIStatus
	 */
	enum class EFriendUIStatus : uint8_t
	{
		Offline                = 0,
		Online                 = 1,
		PlayingDBD             = 2,
		PendingSentRequest     = 3,
		PendingReceivedRequest = 4,
		NotFriend              = 5,
		Self                   = 6,
		MAX                    = 7
	};

	/**
	 * Enum DeadByDaylight.EFlowTransitionType
	 */
	enum class EFlowTransitionType : uint8_t
	{
		Tally         = 0,
		OnlineLobby   = 1,
		PartyLobby    = 2,
		OfflineLobby  = 3,
		Splash        = 4,
		RoleSelection = 5,
		None          = 6,
		MAX           = 7
	};

	/**
	 * Enum DeadByDaylight.EUIFlowEvent
	 */
	enum class EUIFlowEvent : uint8_t
	{
		None                            = 0,
		AtlantaRoleSelectionScreenReady = 1,
		AtlantaNavigationScreenReady    = 2,
		InGameHudReady                  = 3,
		LoadingScreenReady              = 4,
		OfflineLobbyScreenReady         = 5,
		OnlineLobbyScreenReady          = 6,
		RoleSelectionScreenReady        = 7,
		SplashScreenReady               = 8,
		TallyScreenReady                = 9,
		PartyLobbyScreenReady           = 10,
		StoreScreenReady                = 11,
		MAX                             = 12
	};

	/**
	 * Enum DeadByDaylight.EWorldFlowEvent
	 */
	enum class EWorldFlowEvent : uint8_t
	{
		None                    = 0,
		GameLevelLoaded         = 1,
		LoadingGameLevel        = 2,
		LoadingOfflineParadise  = 3,
		LoadingOnlineLobbyLevel = 4,
		OfflineLobbyMapLoaded   = 5,
		OfflineParadiseLoaded   = 6,
		OnlineLobbyMapLoaded    = 7,
		StartScreenMapLoaded    = 8,
		LoadingSplashScreen     = 9,
		MAX                     = 10
	};

	/**
	 * Enum DeadByDaylight.EGameFlowStep
	 */
	enum class EGameFlowStep : uint8_t
	{
		None          = 0,
		InGame        = 1,
		OfflineLobby  = 2,
		OfflineTally  = 3,
		OnlineLobby   = 4,
		SplashScreen  = 5,
		PartyLobby    = 6,
		Store         = 7,
		RoleSelection = 8,
		MAX           = 9
	};

	/**
	 * Enum DeadByDaylight.EGameplayModifierSource
	 */
	enum class EGameplayModifierSource : uint8_t
	{
		VE_Perk               = 0,
		VE_StatusEffect       = 1,
		VE_Item               = 2,
		VE_ItemAddon          = 3,
		VE_All                = 4,
		VE_PerkOrStatusEffect = 5,
		VE_PerkStatusOrAddon  = 6,
		VE_MAX                = 7
	};

	/**
	 * Enum DeadByDaylight.EGateType
	 */
	enum class EGateType : uint8_t
	{
		VE_AndGate   = 0,
		VE_TimerGate = 1,
		VE_MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.ETrapRemovedReason
	 */
	enum class ETrapRemovedReason : uint8_t
	{
		KillerInteraction = 0,
		LifetimeExpired   = 1,
		EndPlay           = 2,
		GeneratorRepaired = 3,
		OwnerLeft         = 4,
		MAX               = 5
	};

	/**
	 * Enum DeadByDaylight.EGestureID
	 */
	enum class EGestureID : uint8_t
	{
		POINT = 0,
		COME  = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadByDaylight.EHatchState
	 */
	enum class EHatchState : uint8_t
	{
		Hidden       = 0,
		DefaultClose = 1,
		Opened       = 2,
		ForcedClose  = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadByDaylight.EHintCategory
	 */
	enum class EHintCategory : uint8_t
	{
		Lore     = 0,
		Survivor = 1,
		Killer   = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EHookType
	 */
	enum class EHookType : uint8_t
	{
		Hook     = 0,
		DeathBed = 1,
		None     = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EProgressModifier
	 */
	enum class EProgressModifier : uint8_t
	{
		Default = 0,
		Buff    = 1,
		Debuff  = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadByDaylight.EKeyBindingsType
	 */
	enum class EKeyBindingsType : uint8_t
	{
		None                    = 0,
		Run                     = 1,
		Crouch                  = 2,
		UseItem                 = 3,
		DropItemSurvivor        = 4,
		PickUpItem              = 5,
		ActionSurvivor          = 6,
		SecondaryActionSurvivor = 7,
		AbilitySurvivor         = 8,
		AbilityTwoSurvivor      = 9,
		Gesture1                = 10,
		Gesture2                = 11,
		WiggleRightSkillCheck   = 12,
		WiggleLeftSkillCheck    = 13,
		Attack                  = 14,
		Power                   = 15,
		SecondaryPower          = 16,
		DropSurvivor            = 17,
		PickUp                  = 18,
		Aim                     = 19,
		ForwardSurvivor         = 20,
		BackSurvivor            = 21,
		LeftSurvivor            = 22,
		RightSurvivor           = 23,
		CameraUpSurvivor        = 24,
		CameraDownSurvivor      = 25,
		CameraLeftSurvivor      = 26,
		CameraRightSurvivor     = 27,
		ForwardKiller           = 28,
		BackKiller              = 29,
		LeftKiller              = 30,
		RightKiller             = 31,
		AimKiller               = 32,
		CameraUpKiller          = 33,
		CameraDownKiller        = 34,
		CameraLeftKiller        = 35,
		CameraRightKiller       = 36,
		MAX                     = 37
	};

	/**
	 * Enum DeadByDaylight.EKeyBindingsCategories
	 */
	enum class EKeyBindingsCategories : uint8_t
	{
		None         = 0,
		Movement     = 1,
		Interactions = 2,
		Camera       = 3,
		Gestures     = 4,
		MAX          = 5
	};

	/**
	 * Enum DeadByDaylight.EKillerTutorialEndGameType
	 */
	enum class EKillerTutorialEndGameType : uint8_t
	{
		DeathByHook            = 0,
		DeathByEndGameCollapse = 1,
		MAX                    = 2
	};

	/**
	 * Enum DeadByDaylight.EKillerHeight
	 */
	enum class EKillerHeight : uint8_t
	{
		Short   = 0,
		Average = 1,
		Tall    = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadByDaylight.EFPVTransitionStrategy
	 */
	enum class EFPVTransitionStrategy : uint8_t
	{
		TurnInvisible       = 0,
		SquishTorsoBackward = 1,
		MAX                 = 2
	};

	/**
	 * Enum DeadByDaylight.EPlayerDataType
	 */
	enum class EPlayerDataType : uint8_t
	{
		None              = 0,
		PlayerState       = 1,
		SocialPartyMember = 2,
		BotPartyMember    = 3,
		MAX               = 4
	};

	/**
	 * Enum DeadByDaylight.ELobbyWaitStopReason
	 */
	enum class ELobbyWaitStopReason : uint8_t
	{
		StartMatchWait  = 0,
		PlayerCancelled = 1,
		Unknown         = 2,
		MAX             = 3
	};

	/**
	 * Enum DeadByDaylight.EMainMenuButton
	 */
	enum class EMainMenuButton : uint8_t
	{
		News                        = 0,
		PlaySurvivor                = 1,
		PlayKiller                  = 2,
		KillYourFriends             = 3,
		DailyRituals                = 4,
		Store                       = 5,
		Settings                    = 6,
		Onboarding                  = 7,
		Credits                     = 8,
		QuitGame                    = 9,
		Friends                     = 10,
		Archives                    = 11,
		CrowdChoice                 = 12,
		PlaySurvivorFromCrowdChoice = 13,
		PlayKillerFromCrowdChoice   = 14,
		MAX                         = 15
	};

	/**
	 * Enum DeadByDaylight.EMapActorCategory
	 */
	enum class EMapActorCategory : uint8_t
	{
		None         = 0,
		Objective    = 1,
		Chest        = 2,
		BlackLock    = 3,
		KillerObject = 4,
		ExitGate     = 5,
		MAX          = 6
	};

	/**
	 * Enum DeadByDaylight.EQuadDirection
	 */
	enum class EQuadDirection : uint8_t
	{
		None  = 0,
		Up    = 1,
		Down  = 2,
		Left  = 3,
		Right = 4,
		Empty = 5,
		MAX   = 6
	};

	/**
	 * Enum DeadByDaylight.ETileVariation
	 */
	enum class ETileVariation : uint8_t
	{
		None      = 0,
		BlueTag   = 1,
		PinkTag   = 2,
		YellowTag = 3,
		GreenTag  = 4,
		Empty     = 5,
		MAX       = 6
	};

	/**
	 * Enum DeadByDaylight.EPathType
	 */
	enum class EPathType : uint8_t
	{
		None               = 0,
		Straight           = 1,
		DeadEnd            = 2,
		Corner             = 3,
		Crossroads         = 4,
		TJunction          = 5,
		OrientationOnly    = 6,
		Unspecified        = 7,
		OrientedCrossroads = 8,
		MAX                = 9
	};

	/**
	 * Enum DeadByDaylight.EDensity
	 */
	enum class EDensity : uint8_t
	{
		Unspecified = 0,
		Light       = 1,
		Moderate    = 2,
		Heavy       = 3,
		Empty       = 4,
		MAX         = 5
	};

	/**
	 * Enum DeadByDaylight.ETileType
	 */
	enum class ETileType : uint8_t
	{
		None      = 0,
		Blocker   = 1,
		Any       = 2,
		Forest    = 3,
		Building  = 4,
		Maze      = 5,
		Landmark  = 6,
		Signature = 7,
		MAX       = 8
	};

	/**
	 * Enum DeadByDaylight.EDirection
	 */
	enum class EDirection : uint8_t
	{
		Up        = 0,
		Down      = 1,
		Left      = 2,
		Right     = 3,
		UpLeft    = 4,
		UpRight   = 5,
		DownLeft  = 6,
		DownRight = 7,
		MAX       = 8
	};

	/**
	 * Enum DeadByDaylight.EBasementType
	 */
	enum class EBasementType : uint8_t
	{
		None         = 0,
		Basic        = 1,
		MainBuilding = 2,
		Shack        = 3,
		Count        = 4,
		MAX          = 5
	};

	/**
	 * Enum DeadByDaylight.EQuadrantSpawnType
	 */
	enum class EQuadrantSpawnType : uint8_t
	{
		L_Shape = 0,
		Square  = 1,
		Rect_X  = 2,
		Rect_Y  = 3,
		Rect    = 4,
		None    = 5,
		MAX     = 6
	};

	/**
	 * Enum DeadByDaylight.EQuadrant
	 */
	enum class EQuadrant : uint8_t
	{
		BottomRight = 0,
		BottomLeft  = 1,
		TopLeft     = 2,
		TopRight    = 3,
		Count       = 4,
		MAX         = 5
	};

	/**
	 * Enum DeadByDaylight.EQueueingState
	 */
	enum class EQueueingState : uint8_t
	{
		None                   = 0,
		Queueing               = 1,
		MatchCreated           = 2,
		MatchOpened            = 3,
		WaitingForTransactions = 4,
		Complete               = 5,
		MAX                    = 6
	};

	/**
	 * Enum DeadByDaylight.EPlayerAnimState
	 */
	enum class EPlayerAnimState : uint8_t
	{
		VE_Default       = 0,
		VE_Injured       = 1,
		VE_InjuredCrouch = 2,
		VE_Crouch        = 3,
		VE_MAX           = 4
	};

	/**
	 * Enum DeadByDaylight.EOfferingEffectType
	 */
	enum class EOfferingEffectType : uint8_t
	{
		SlasherPointsAll                     = 0,
		PointsBrutality                      = 1,
		PointsDeviouness                     = 2,
		PointsSacrice                        = 3,
		PointsHunting                        = 4,
		CamperPointsAll                      = 5,
		PointsObjective                      = 6,
		PointsSurvival                       = 7,
		PointsAltruism                       = 8,
		PointsBoldness                       = 9,
		SurvivorCharacterXP                  = 10,
		KillerCharacterXP                    = 11,
		CamperItemLostPrevention             = 12,
		KillerItemLostPrevention             = 13,
		Luck                                 = 14,
		IndustrialThemeSelectionModifier     = 15,
		JunkyardThemeSelectionModifier       = 16,
		FarmThemeSelectionModifier           = 17,
		SwampThemeSelectionModifier          = 18,
		MapModifier                          = 19,
		ChestCountModifier                   = 20,
		PortableHookCountModifier            = 21,
		LairCountModifier                    = 22,
		PlayerGrouping                       = 23,
		FarKiller                            = 24,
		KillAllowedModifier                  = 25,
		LightingModification                 = 26,
		FogModification                      = 27,
		LivingWorldObjectCountModifier       = 28,
		LivingWorldObjectMultModifier        = 29,
		KillLastSurvivor                     = 30,
		SuburbsThemeSelectionModifier        = 31,
		AsylumThemeSelectionModifier         = 32,
		KillerSelectionModifier              = 33,
		HospitalThemeSelectionModifier       = 34,
		KillAllowedAfterStrugglePhase        = 35,
		BorealThemeSelectionModifier         = 36,
		SpringwoodThemeSelectionModifier     = 37,
		FinlandThemeSelectionModifier        = 38,
		JapaneseCountrySideSelectionModifier = 39,
		KenyaThemeSelectionModifier          = 40,
		QatarThemeSelectionModifier          = 41,
		UkraineThemeSelectionModifier        = 42,
		WalesThemeSelectionModifier          = 43,
		CancelThemeSelectionModifier         = 44,
		BasementMainBuildingModifier         = 45,
		BasementShackModifier                = 46,
		HatchMainBuildingModifier            = 47,
		HatchShackModifier                   = 48,
		EclipseThemeSelectionModifier        = 49,
		IonThemeSelectionModifier            = 50,
		MeteorThemeSelectionModifier         = 51,
		QuantumThemeSelectionModifier        = 52,
		SpecialEvent                         = 53,
		ObjectSubsitution                    = 54,
		ObjectAddition                       = 55,
		MAX                                  = 56
	};

	/**
	 * Enum DeadByDaylight.EOfferingType
	 */
	enum class EOfferingType : uint8_t
	{
		None                 = 0,
		Atmosphere           = 1,
		Lighting             = 2,
		Points               = 3,
		Zone                 = 4,
		Position             = 5,
		Chest                = 6,
		Hook                 = 7,
		Protection           = 8,
		Hatch                = 9,
		Odds                 = 10,
		Killing              = 11,
		World                = 12,
		Luck                 = 13,
		Killer               = 14,
		ProceduralGeneration = 15,
		CharacterXP          = 16,
		Count                = 17,
		MAX                  = 18
	};

	/**
	 * Enum DeadByDaylight.EOfferingCombinationResult
	 */
	enum class EOfferingCombinationResult : uint8_t
	{
		None        = 0,
		Stacked     = 1,
		CoConsummed = 2,
		Overruling  = 3,
		Cancelled   = 4,
		MAX         = 5
	};

	/**
	 * Enum DeadByDaylight.EOfferingSequenceState
	 */
	enum class EOfferingSequenceState : uint8_t
	{
		SmokeIn         = 0,
		FadeOut         = 1,
		FadeIn          = 2,
		NotInitialized  = 3,
		Idle            = 4,
		Init            = 5,
		InitDone        = 6,
		Reveal          = 7,
		RevealDone      = 8,
		ShowInteraction = 9,
		Finalize        = 10,
		Done            = 11,
		MAX             = 12
	};

	/**
	 * Enum DeadByDaylight.EOfflineLobbyState
	 */
	enum class EOfflineLobbyState : uint8_t
	{
		None          = 0,
		RoleSelection = 1,
		OfflineLobby  = 2,
		Store         = 3,
		PartyLobby    = 4,
		Archives      = 5,
		MAX           = 6
	};

	/**
	 * Enum DeadByDaylight.EOniAttackType
	 */
	enum class EOniAttackType : uint8_t
	{
		VE_NotDemonMode     = 0,
		VE_DemonBasicAttack = 1,
		VE_DemonPowerAttack = 2,
		VE_DemonDashAttack  = 3,
		VE_MAX              = 4
	};

	/**
	 * Enum DeadByDaylight.EJoinSessionFailureType
	 */
	enum class EJoinSessionFailureType : uint8_t
	{
		None                      = 0,
		JoiningAlreadyStartedGame = 1,
		JoiningPrivateGame        = 2,
		JoiningAlreadyFullGame    = 3,
		JoiningInvitation         = 4,
		JoiningFailedOnDisconnect = 5,
		JoiningHostUnreachable    = 6,
		JoiningIncompatibleServer = 7,
		MatchmakingInfoExpired    = 8,
		MAX                       = 9
	};

	/**
	 * Enum DeadByDaylight.EOnlineOperation
	 */
	enum class EOnlineOperation : uint8_t
	{
		None                  = 0,
		HostGame              = 1,
		EndingSession         = 2,
		DestroyingSession     = 3,
		PreparingJoinGame     = 4,
		JoinGame              = 5,
		JoinCancelled         = 6,
		OnlineCheck           = 7,
		CancellingMatchmaking = 8,
		MAX                   = 9
	};

	/**
	 * Enum DeadByDaylight.EOverlayMode
	 */
	enum class EOverlayMode : uint8_t
	{
		Default          = 0,
		TrialOrTally     = 1,
		TutorialLevel    = 2,
		TutorialBotMatch = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadByDaylight.EOverlayTabs
	 */
	enum class EOverlayTabs : uint8_t
	{
		Settings     = 0,
		Controls     = 1,
		Help         = 2,
		Survivors    = 3,
		CoreTabCount = 4,
		About        = 5,
		Language     = 6,
		MAX          = 7
	};

	/**
	 * Enum DeadByDaylight.EPalletStunZoneSideStrategy
	 */
	enum class EPalletStunZoneSideStrategy : uint8_t
	{
		OppositeSideToPlayerExecutingPulldown = 0,
		SameSideToPlayerExecutingPulldown     = 1,
		MAX                                   = 2
	};

	/**
	 * Enum DeadByDaylight.EPalletPushSideStrategy
	 */
	enum class EPalletPushSideStrategy : uint8_t
	{
		PushToClosestPalletSide               = 0,
		PushOppositeToPlayerExecutingPulldown = 1,
		MAX                                   = 2
	};

	/**
	 * Enum DeadByDaylight.EPalletSide
	 */
	enum class EPalletSide : uint8_t
	{
		None  = 0,
		Left  = 1,
		Right = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadByDaylight.EPalletState
	 */
	enum class EPalletState : uint8_t
	{
		Up        = 0,
		Falling   = 1,
		Fallen    = 2,
		Destroyed = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadByDaylight.EPerkTokenSoundStrategy
	 */
	enum class EPerkTokenSoundStrategy : uint8_t
	{
		NoSound                 = 0,
		SoundOnEveryTokenChange = 1,
		SoundOnReachMaxTokens   = 2,
		MAX                     = 3
	};

	/**
	 * Enum DeadByDaylight.EPerspectiveActivationCondition
	 */
	enum class EPerspectiveActivationCondition : uint8_t
	{
		LocallyControlled  = 0,
		LocallyObserved    = 1,
		NotLocallyObserved = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadByDaylight.ESaveGameFailureType
	 */
	enum class ESaveGameFailureType : uint8_t
	{
		None                = 0,
		InvalidPlayerID     = 1,
		InvalidGameInstance = 2,
		NoServerConnection  = 3,
		UserNotSignedIn     = 4,
		Unknown             = 5,
		MAX                 = 6
	};

	/**
	 * Enum DeadByDaylight.ERequestState
	 */
	enum class ERequestState : uint8_t
	{
		VE_None    = 0,
		VE_Pending = 1,
		VE_Success = 2,
		VE_Fail    = 3,
		VE_MAX     = 4
	};

	/**
	 * Enum DeadByDaylight.EInteractionValidationState
	 */
	enum class EInteractionValidationState : uint8_t
	{
		None                  = 0,
		Predicted             = 1,
		Authorized            = 2,
		DeniedByRaceCondition = 3,
		DeniedByTimeout       = 4,
		DeniedByError         = 5,
		MAX                   = 6
	};

	/**
	 * Enum DeadByDaylight.ESecondaryActionRequestTypes
	 */
	enum class ESecondaryActionRequestTypes : uint8_t
	{
		None                               = 0,
		SecondaryActionRequested           = 1,
		SecondaryActionRequestedFromCancel = 2,
		MAX                                = 3
	};

	/**
	 * Enum DeadByDaylight.ERadialProgressBarType
	 */
	enum class ERadialProgressBarType : uint8_t
	{
		Yellow = 0,
		Red    = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadByDaylight.EPreLevelGenerationModifierType
	 */
	enum class EPreLevelGenerationModifierType : uint8_t
	{
		None                    = 0,
		ModifyKillerObjectCount = 1,
		MAX                     = 2
	};

	/**
	 * Enum DeadByDaylight.EPrestigeRewardType
	 */
	enum class EPrestigeRewardType : uint8_t
	{
		None          = 0,
		Customization = 1,
		Perk          = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadByDaylight.ESurvivorGrouping
	 */
	enum class ESurvivorGrouping : uint8_t
	{
		Invalid   = 0,
		Separated = 1,
		Grouped2  = 2,
		Grouped3  = 3,
		Grouped4  = 4,
		MAX       = 5
	};

	/**
	 * Enum DeadByDaylight.EscapeStrategyType
	 */
	enum class EscapeStrategyType : uint8_t
	{
		EscapeDoor  = 0,
		EscapeHatch = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadByDaylight.ELevelBuildingState
	 */
	enum class ELevelBuildingState : uint8_t
	{
		NotInitialized                   = 0,
		WaitingForInitialSync            = 1,
		SyncSeeds                        = 2,
		GetAvailableItems                = 3,
		PendingGettingItems              = 4,
		GettingLevelsDone                = 5,
		PendingPremadeMapStreaming       = 6,
		GetThemedTiles                   = 7,
		PendingGettingTiles              = 8,
		SpawnEscapeTiles                 = 9,
		SpawnBasementTile                = 10,
		SpawningLevelTiles               = 11,
		SpawnInterTileElements           = 12,
		PendingInterTileElementsSpawning = 13,
		SpawningActors                   = 14,
		SpawningMultiPassActors          = 15,
		StallingForRemotes               = 16,
		BuildingDone                     = 17,
		BuildingStateCount               = 18,
		MAX                              = 19
	};

	/**
	 * Enum DeadByDaylight.EPromoPackContentType
	 */
	enum class EPromoPackContentType : uint8_t
	{
		None             = 0,
		Item             = 1,
		Addon            = 2,
		Offering         = 3,
		Character        = 4,
		Customization    = 5,
		Bonus            = 6,
		BloodPoints      = 7,
		IridescentShards = 8,
		FreeTicket       = 9,
		Count            = 10,
		MAX              = 11
	};

	/**
	 * Enum DeadByDaylight.EConditionNeedsType
	 */
	enum class EConditionNeedsType : uint8_t
	{
		AllTrue = 0,
		AnyTrue = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadByDaylight.ERefundSource
	 */
	enum class ERefundSource : uint8_t
	{
		None          = 0,
		BloodMarket   = 1,
		DailyCalendar = 2,
		PromoPack     = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadByDaylight.ESaveGameErrorCategory
	 */
	enum class ESaveGameErrorCategory : uint8_t
	{
		EvaluateDisconnectPenalty = 0,
		SaveGameSaveError         = 1,
		SaveGameUnreadable        = 2,
		SaveGameValidation        = 3,
		SaveFailed                = 4,
		MAX                       = 5
	};

	/**
	 * Enum DeadByDaylight.EScreenType
	 */
	enum class EScreenType : uint8_t
	{
		eScaleformScreen   = 0,
		eUMGScreen         = 1,
		eMixedScaleformUMG = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadByDaylight.EScreenshotToolBatchType
	 */
	enum class EScreenshotToolBatchType : uint8_t
	{
		SelectedItemOrOutfit          = 0,
		SelectedItemOrOutfitSeparated = 1,
		SelectedCharacterItems        = 2,
		SelectedCharacterOutfits      = 3,
		SelectedCharacterAndCategory  = 4,
		ItemsMissingIcon              = 5,
		OutfitMissingIcon             = 6,
		CharmsMissingIcon             = 7,
		PerkCharmsMissingIcon         = 8,
		AllItems                      = 9,
		AllOutfits                    = 10,
		AllCharms                     = 11,
		AllPerkCharms                 = 12,
		MAX                           = 13
	};

	/**
	 * Enum DeadByDaylight.EScreenshotToolState
	 */
	enum class EScreenshotToolState : uint8_t
	{
		None              = 0,
		PrepareBatch      = 1,
		GenerateIcons     = 2,
		ShaderCompilation = 3,
		GenerateAsset     = 4,
		SaveAndCheckout   = 5,
		FinishSuccess     = 6,
		FinishFail        = 7,
		FinishCancel      = 8,
		MAX               = 9
	};

	/**
	 * Enum DeadByDaylight.SettingsId
	 */
	enum class ESettingsId : uint8_t
	{
		SettingsIdNone                          = 0,
		SettingsIdLanguage                      = 1,
		SettingsIdRevokeConsent                 = 2,
		SettingsIdRevokeMarketingConsent        = 3,
		SettingsIdBhvrAccount                   = 4,
		SettingsIdAllowCrossplayGeneric         = 5,
		SettingsIdAllowCrossplayLive            = 6,
		SettingsIdAutoDeclineFriendRequests     = 7,
		SettingsIdPlayerId                      = 8,
		SettingsIdPartyPrivacy                  = 9,
		SettingsIdQuality                       = 10,
		SettingsIdAutoAdjust                    = 11,
		SettingsIdResolution                    = 12,
		SettingsIdFullScreen                    = 13,
		SettingsIdHUDConstrainedAspectRatio     = 14,
		SettingsIdMenuScaleFactor               = 15,
		SettingsIdHudScaleFactor                = 16,
		SettingsIdSkillCheckScaleFactor         = 17,
		SettingsIdLargeText                     = 18,
		SettingsIdBloodwebInteractionBehaviour  = 19,
		SettingsIdTerrorRadiusVisualFeedback    = 20,
		SettingsIdHUDPlayerNamesVisibility      = 21,
		SettingsIdHUDKillerHookCountVisibility  = 22,
		SettingsIdHUDScoreEventsVisibility      = 23,
		SettingsIdLegacyPrestigePortraits       = 24,
		SettingsIdChallengeProgression          = 25,
		SettingsIdChallengeCompletion           = 26,
		SettingsIdMainVolume                    = 27,
		SettingsIdMenuMusicVolume               = 28,
		SettingsIdHeadphones                    = 29,
		SettingsIdMuteOnFocusLost               = 30,
		SettingsIdInvertYAxis                   = 31,
		SettingsIdSurvivorMouseSensitivity      = 32,
		SettingsIdSurvivorControllerSensitivity = 33,
		SettingsIdKillerMouseSensitivity        = 34,
		SettingsIdKillerControllerSensitivity   = 35,
		SettingsIdSurvivorToggleInteractions    = 36,
		SettingsIdKillerToggleInteractions      = 37,
		SettingsIdSprintToCancel                = 38,
		SettingsIdColorBarPalette               = 39,
		SettingsIdColorBlindMode                = 40,
		SettingsIdColorBlindModeIntensity       = 41,
		SettingsIdBeginnerMode                  = 42,
		SettingsIdSubtitles                     = 43,
		SettingsIdSubtitlesBackgroundOpacity    = 44,
		SettingsIdSubtitlesSize                 = 45,
		SettingsIdIsAnonymousMode               = 46,
		SettingsIdHideYourName                  = 47,
		SettingsIdHideOtherNames                = 48,
		SettingsIdHiddenMatchmakingDelay        = 49,
		SettingsIdSurvivorCameraSensitivity     = 50,
		SettingsIdKillerCameraSensitivity       = 51,
		SettingsIdMenuMusicVolumeOn             = 52,
		SettingsIdMainVolumeOn                  = 53,
		SettingsIdAimAssist                     = 54,
		SettingsIdSurvivorQuickTurn             = 55,
		SettingsIdKillerQuickTurn               = 56,
		SettingsIdFPSLimit                      = 57,
		SettingsIdAutoQuality                   = 58,
		SettingsIdControlType                   = 59,
		SettingsIdCustomizedControls            = 60,
		SettingsIdDynamicResolution             = 61,
		SettingsIdInvertYAxisSurvivor           = 62,
		SettingsIdBetaWiggleSkillCheck          = 63,
		SettingsIdHapticsVibrationPS5           = 64,
		SettingsIdSettingsId_MAX                = 65
	};

	/**
	 * Enum DeadByDaylight.SettingsSubCategory
	 */
	enum class ESettingsSubCategory : uint8_t
	{
		SettingsSubCategoryNone                    = 0,
		SettingsSubCategoryLanguage                = 1,
		SettingsSubCategoryTutorial                = 2,
		SettingsSubCategoryPrivacy                 = 3,
		SettingsSubCategoryAccessibility           = 4,
		SettingsSubCategoryInGameText              = 5,
		SettingsSubCategoryColorBlindMode          = 6,
		SettingsSubCategoryMotionSickness          = 7,
		SettingsSubCategorySocial                  = 8,
		SettingsSubCategoryGameplayPrivacy         = 9,
		SettingsSubCategoryGraphics                = 10,
		SettingsSubCategoryUIHud                   = 11,
		SettingsSubCategoryAudio                   = 12,
		SettingsSubCategoryCommonControls          = 13,
		SettingsSubCategorySurvivorControls        = 14,
		SettingsSubCategoryKillerControls          = 15,
		SettingsSubCategoryAtlanta                 = 16,
		SettingsSubCategorySettingsSubCategory_MAX = 17
	};

	/**
	 * Enum DeadByDaylight.SettingsCategory
	 */
	enum class ESettingsCategory : uint8_t
	{
		SettingsCategoryNone                 = 0,
		SettingsCategoryGeneral              = 1,
		SettingsCategoryAccessibility        = 2,
		SettingsCategoryBeta                 = 3,
		SettingsCategoryOnline               = 4,
		SettingsCategoryGraphics             = 5,
		SettingsCategoryAudio                = 6,
		SettingsCategoryControls             = 7,
		SettingsCategoryAtlanta              = 8,
		SettingsCategorySettingsCategory_MAX = 9
	};

	/**
	 * Enum DeadByDaylight.SettingsType
	 */
	enum class ESettingsType : uint8_t
	{
		SettingsTypeNone             = 0,
		SettingsTypeButton           = 1,
		SettingsTypePlayerId         = 2,
		SettingsTypeNumericStepper   = 3,
		SettingsTypeDropdown         = 4,
		SettingsTypeColorBar         = 5,
		SettingsTypeTextStepper      = 6,
		SettingsTypeBoolTextStepper  = 7,
		SettingsTypeCheckbox         = 8,
		SettingsTypeSettingsType_MAX = 9
	};

	/**
	 * Enum DeadByDaylight.EStoreUITag
	 */
	enum class EStoreUITag : uint8_t
	{
		None = 0,
		Sale = 1,
		New  = 2,
		MAX  = 3
	};

	/**
	 * Enum DeadByDaylight.ECatalogStatus
	 */
	enum class ECatalogStatus : uint8_t
	{
		NotReady = 0,
		Updating = 1,
		Fetched  = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EShopLoadProgress
	 */
	enum class EShopLoadProgress : uint8_t
	{
		None                 = 0,
		LoadCatalog          = 1,
		LoadCurrencyPacks    = 2,
		PlatformStoreCatalog = 3,
		Inventory            = 4,
		Wallet               = 5,
		FeaturedPageContent  = 6,
		MAX                  = 7
	};

	/**
	 * Enum DeadByDaylight.ESoftBanReason
	 */
	enum class ESoftBanReason : uint8_t
	{
		Invalid         = 0,
		Harassment      = 1,
		Griefing        = 2,
		Exploits        = 3,
		Unsportsmanlike = 4,
		Count           = 5,
		MAX             = 6
	};

	/**
	 * Enum DeadByDaylight.ESoundIndicatorType
	 */
	enum class ESoundIndicatorType : uint8_t
	{
		None                             = 0,
		CloseNoiseIndicator              = 1,
		ExitOpenedIndicator              = 2,
		GeneratorIndicator               = 3,
		HatchIndicator                   = 4,
		HookedIndicator                  = 5,
		KillerCuesIndicator              = 6,
		GlobalSoundIndicator             = 7,
		DirectionalTerrorRadiusIndicator = 8,
		MAX                              = 9
	};

	/**
	 * Enum DeadByDaylight.ESpawnerStrategyType
	 */
	enum class ESpawnerStrategyType : uint8_t
	{
		None              = 0,
		NoAccumulation    = 1,
		LimitAccumulation = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadByDaylight.EGiftSpecialAction
	 */
	enum class EGiftSpecialAction : uint8_t
	{
		None       = 0,
		KeplerGift = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadByDaylight.ESpecialEventBloodwebChestCondition
	 */
	enum class ESpecialEventBloodwebChestCondition : uint8_t
	{
		Default       = 0,
		All           = 1,
		WithEventItem = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadByDaylight.ESpecialEventDependency
	 */
	enum class ESpecialEventDependency : uint8_t
	{
		None     = 0,
		Archives = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadByDaylight.ESpecialEventGameMode
	 */
	enum class ESpecialEventGameMode : uint8_t
	{
		Progression = 0,
		Counter     = 1,
		Collection  = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadByDaylight.ESpecialEventStatus
	 */
	enum class ESpecialEventStatus : uint8_t
	{
		Inactive   = 0,
		ActiveMain = 1,
		ActivePost = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadByDaylight.ELoadCompleteState
	 */
	enum class ELoadCompleteState : uint8_t
	{
		InProgress                                                 = 0,
		Success                                                    = 1,
		ReloginRequested                                           = 2,
		FailedEAC                                                  = 3,
		FailedRecoverable                                          = 4,
		FailedRecoverableProfileLoad                               = 5,
		FailedRecoverableWindowsStoreAndXboxLiveAccountNotMatching = 6,
		FailedUnequipedDisableditems                               = 7,
		FailedBlocking                                             = 8,
		FailedBlockingNoDBDServer                                  = 9,
		FailedBlockingNotConnected                                 = 10,
		FailedBlockedNoNetworkConnection                           = 11,
		FailedBlockingSharedAuthenticationFailed                   = 12,
		FailedBlockingPlatformNotAuthenticated                     = 13,
		FailedBlockingPlatformSubsystemNotInitialized              = 14,
		FailedBlockingOnlinePresenceNotInitialized                 = 15,
		FailedBlockingPlatformNetUniqueIdInvalid                   = 16,
		FailedBlockingInvalidLocalPlayer                           = 17,
		FailedBlockingInvalidGameObjects                           = 18,
		FailedBlockingInvalidSDA                                   = 19,
		FailedBlockingInvalidClientVersion                         = 20,
		FailedBlockingInvalidAtlantaClientVersion                  = 21,
		FailedBlockingWindowsStoreAccountNotLoggedIn               = 22,
		FailedBlockingSSLCACert                                    = 23,
		FailedBlockingUserCancelled                                = 24,
		FailedBlockingCDNFailure                                   = 25,
		FailedBlockingCDNContentError                              = 26,
		FailedBlockingCDNCantFindContentToDownload                 = 27,
		FailedBlockingCDNNoPatchForCurrentPlatformAndVersion       = 28,
		FailedBlockingCDNNotEnoughDiskSpace                        = 29,
		FailedBlockingCDNFailureToRetrieveContent                  = 30,
		FailedRecoverableCDNUserCancelled                          = 31,
		FailedBlockingVersionFileError                             = 32,
		FailedBlockingRTMConnection                                = 33,
		FailedBlockingMaxTrialsReached                             = 34,
		FailedBlockingMirrorsHealthCheckFailed                     = 35,
		FailedBlockingTutorialRewardsFetchFailed                   = 36,
		FailedBlockingUserBanned                                   = 37,
		FailedRetrieveStoreItem                                    = 38,
		MAX                                                        = 39
	};

	/**
	 * Enum DeadByDaylight.EExternalEffectSource
	 */
	enum class EExternalEffectSource : uint8_t
	{
		None  = 0,
		Perk  = 1,
		Addon = 2,
		Power = 3,
		MAX   = 4
	};

	/**
	 * Enum DeadByDaylight.EStoreBannerLocation
	 */
	enum class EStoreBannerLocation : uint8_t
	{
		Primary   = 0,
		Secondary = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadByDaylight.EInteractionStorerRole
	 */
	enum class EInteractionStorerRole : uint8_t
	{
		None                        = 0,
		AuthorityAndAutonomousProxy = 1,
		ClientAndAutonomousProxy    = 2,
		AuthorityAndSimulatedProxy  = 3,
		ClientAndSimulatedProxy     = 4,
		MAX                         = 5
	};

	/**
	 * Enum DeadByDaylight.ETextBannerPosition
	 */
	enum class ETextBannerPosition : uint8_t
	{
		TopLeft      = 0,
		MiddleLeft   = 1,
		BottomLeft   = 2,
		MiddleRight  = 3,
		BottomRight  = 4,
		TopCenter    = 5,
		MiddleCenter = 6,
		BottomCenter = 7,
		MAX          = 8
	};

	/**
	 * Enum DeadByDaylight.EStorefrontState
	 */
	enum class EStorefrontState : uint8_t
	{
		None            = 0,
		Character       = 1,
		Currency        = 2,
		Customization   = 3,
		Featured        = 4,
		PromoPacks      = 5,
		ShrineOfSecrets = 6,
		Subscriptions   = 7,
		LandingPage     = 8,
		Count           = 9,
		MAX             = 10
	};

	/**
	 * Enum DeadByDaylight.EStoreTab
	 */
	enum class EStoreTab : uint8_t
	{
		Featured        = 0,
		Characters      = 1,
		Currency        = 2,
		ShrineOfSecrets = 3,
		TabCount        = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadByDaylight.EStoreState
	 */
	enum class EStoreState : uint8_t
	{
		None               = 0,
		Featured           = 1,
		CharacterSelection = 2,
		CharacterStory     = 3,
		CharacterCatalog   = 4,
		BuyCurrency        = 5,
		ShrineOfSecrets    = 6,
		MAX                = 7
	};

	/**
	 * Enum DeadByDaylight.EStreamVideoDataType
	 */
	enum class EStreamVideoDataType : uint8_t
	{
		None             = 0,
		LoreCinematic    = 1,
		SurvivorTutorial = 2,
		KillerTutorial   = 3,
		Count            = 4,
		MAX              = 5
	};

	/**
	 * Enum DeadByDaylight.ESubscriptionRewardType
	 */
	enum class ESubscriptionRewardType : uint8_t
	{
		None             = 0,
		Item             = 1,
		AddOn            = 2,
		Offering         = 3,
		FreeTicket       = 4,
		AuricCells       = 5,
		BloodPoints      = 6,
		IridescentShards = 7,
		Customization    = 8,
		Character        = 9,
		MAX              = 10
	};

	/**
	 * Enum DeadByDaylight.EPromptType
	 */
	enum class EPromptType : uint8_t
	{
		None         = 0,
		ExitsPowered = 1,
		HatchSpawned = 2,
		HatchOpened  = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadByDaylight.ENotificationStyle
	 */
	enum class ENotificationStyle : uint8_t
	{
		None     = 0,
		Game     = 1,
		Tutorial = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EPromptPriority
	 */
	enum class EPromptPriority : uint8_t
	{
		Tutorial = 0,
		High     = 1,
		Medium   = 2,
		Low      = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadByDaylight.ELegalTermsStatus
	 */
	enum class ELegalTermsStatus : uint8_t
	{
		None     = 0,
		Accepted = 1,
		Declined = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EInventoryGridFormat
	 */
	enum class EInventoryGridFormat : uint8_t
	{
		DEFAULT   = 0,
		DIAMOND   = 1,
		HONEYCOMB = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadByDaylight.ENewContentType
	 */
	enum class ENewContentType : uint8_t
	{
		FEATURED_CONTENT = 0,
		NEW_CONTENT      = 1,
		PATCH_NOTES      = 2,
		DEV_MESSAGES     = 3,
		EVENTS           = 4,
		SALE             = 5,
		COMMUNITY        = 6,
		MAX              = 7
	};

	/**
	 * Enum DeadByDaylight.EOverlayButtonOptions
	 */
	enum class EOverlayButtonOptions : uint8_t
	{
		HIDDEN   = 0,
		DISABLED = 1,
		ENABLED  = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EUIControllerType
	 */
	enum class EUIControllerType : uint8_t
	{
		KeyboardMouse = 0,
		GamePad       = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadByDaylight.EForumLanguages
	 */
	enum class EForumLanguages : uint8_t
	{
		None = 0,
		de   = 1,
		en   = 2,
		ja   = 3,
		ru   = 4,
		MAX  = 5
	};

	/**
	 * Enum DeadByDaylight.ECustomerSupportLanguages
	 */
	enum class ECustomerSupportLanguages : uint8_t
	{
		None = 0,
		de   = 1,
		en   = 2,
		ja   = 3,
		ru   = 4,
		es   = 5,
		fr   = 6,
		it   = 7,
		ko   = 8,
		pl   = 9,
		pt   = 10,
		th   = 11,
		zh   = 12,
		MAX  = 13
	};

	/**
	 * Enum DeadByDaylight.ELeaveLobbyReason
	 */
	enum class ELeaveLobbyReason : uint8_t
	{
		eNone                  = 0,
		eNetworkDisconnect     = 1,
		eProfileOffline        = 2,
		eAppSuspended          = 3,
		eInternetDisconnect    = 4,
		eHostDisconnect        = 5,
		eDLCInstalled          = 6,
		eTrialExtensionExpired = 7,
		ePartyManagementError  = 8,
		MAX                    = 9
	};

	/**
	 * Enum DeadByDaylight.EFriendSearchPanelOption
	 */
	enum class EFriendSearchPanelOption : uint8_t
	{
		NotFoundPanel              = 0,
		NonFriendPanel             = 1,
		FriendRequestReceivedPanel = 2,
		FriendRequestSentPanel     = 3,
		FriendPanel                = 4,
		IsOwnerPanel               = 5,
		MAX                        = 6
	};

	/**
	 * Enum DeadByDaylight.EFriendContainerType
	 */
	enum class EFriendContainerType : uint8_t
	{
		Connected              = 0,
		Disconnected           = 1,
		PendingSentRequest     = 2,
		RecentlyPlayed         = 3,
		SocialSuggestions      = 4,
		PendingReceivedRequest = 5,
		QueriedPlayer          = 6,
		Unknown                = 7,
		MAX                    = 8
	};

	/**
	 * Enum DeadByDaylight.EPurchasePopupState
	 */
	enum class EPurchasePopupState : uint8_t
	{
		Information = 0,
		TitleOnly   = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadByDaylight.EAtlantaSettingMenuType
	 */
	enum class EAtlantaSettingMenuType : uint8_t
	{
		TabButton     = 0,
		AlwaysDisplay = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadByDaylight.EBloodStoreRowStyle
	 */
	enum class EBloodStoreRowStyle : uint8_t
	{
		FiveItemRow  = 0,
		ThreeItemRow = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadByDaylight.EButtonType
	 */
	enum class EButtonType : uint8_t
	{
		None                  = 0,
		AttackButton          = 1,
		PowerButton           = 2,
		CancelButton          = 3,
		SettingsButton        = 4,
		SecondaryActionButton = 5,
		PowerAttackJoystick   = 6,
		MAX                   = 7
	};

	/**
	 * Enum DeadByDaylight.EInboxMessageTimeUnit
	 */
	enum class EInboxMessageTimeUnit : uint8_t
	{
		Days    = 0,
		Hours   = 1,
		Minutes = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadByDaylight.EInboxMessageUIState
	 */
	enum class EInboxMessageUIState : uint8_t
	{
		New      = 0,
		Read     = 1,
		Archived = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadByDaylight.EInboxMessageUIType
	 */
	enum class EInboxMessageUIType : uint8_t
	{
		None    = 0,
		Social  = 1,
		Rewards = 2,
		News    = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadByDaylight.EPartyPlayerSlotWidgetState
	 */
	enum class EPartyPlayerSlotWidgetState : uint8_t
	{
		None     = 0,
		Empty    = 1,
		NotReady = 2,
		Ready    = 3,
		Hidden   = 4,
		MAX      = 5
	};

	/**
	 * Enum DeadByDaylight.ERewardLayoutBox
	 */
	enum class ERewardLayoutBox : uint8_t
	{
		Top    = 0,
		Bottom = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadByDaylight.ESettingScreenButtonData
	 */
	enum class ESettingScreenButtonData : uint8_t
	{
		PRIVACY           = 0,
		EULA              = 1,
		CREDITS           = 2,
		SURVIVORTUTORIAL  = 3,
		KILLERTUTORIAL    = 4,
		SURVIVORCINEMATIC = 5,
		KILLERCINEMATIC   = 6,
		LORECINEMATIC     = 7,
		COMMUNITY         = 8,
		PLAYERCLOUDID     = 9,
		SUBSCRIBE         = 10,
		TERMSOFUSE        = 11,
		MAX               = 12
	};

	/**
	 * Enum DeadByDaylight.ENavigationState
	 */
	enum class ENavigationState : uint8_t
	{
		RoleSelection      = 0,
		Customization      = 1,
		CharacterSelection = 2,
		Lobby              = 3,
		BloodStore         = 4,
		None               = 5,
		MAX                = 6
	};

	/**
	 * Enum DeadByDaylight.EInventoryButtonState
	 */
	enum class EInventoryButtonState : uint8_t
	{
		StateDisabled         = 0,
		StateEmpty            = 1,
		StateLocked           = 2,
		StateWithItem         = 3,
		StateWithItemDisabled = 4,
		StateWithItemLocked   = 5,
		StatePrivate          = 6,
		MAX                   = 7
	};

	/**
	 * Enum DeadByDaylight.EFogScreenButton
	 */
	enum class EFogScreenButton : uint8_t
	{
		AddCurrency = 0,
		Setting     = 1,
		Chat        = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadByDaylight.ERoleSelectionScreenButton
	 */
	enum class ERoleSelectionScreenButton : uint8_t
	{
		DailyRitual  = 0,
		Inbox        = 1,
		InviteFriend = 2,
		Setting      = 3,
		Marketing    = 4,
		Events       = 5,
		MAX          = 6
	};

	/**
	 * Enum DeadByDaylight.ENavigationScreenButton
	 */
	enum class ENavigationScreenButton : uint8_t
	{
		AddCurrency           = 0,
		Back                  = 1,
		Bloodweb              = 2,
		ChangeRole            = 3,
		CharacterSelection    = 4,
		Customization         = 5,
		InviteFriend          = 6,
		Loadout               = 7,
		Start                 = 8,
		Subscriptions         = 9,
		EditCustomGame        = 10,
		CustomGameRequestRole = 11,
		MAX                   = 12
	};

	/**
	 * Enum DeadByDaylight.EInboxScreenButton
	 */
	enum class EInboxScreenButton : uint8_t
	{
		Rewards = 0,
		Social  = 1,
		News    = 2,
		Back    = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadByDaylight.ETallyListPageID
	 */
	enum class ETallyListPageID : uint8_t
	{
		Scoreboard     = 0,
		Bloodpoints    = 1,
		Rank           = 2,
		PlayerLevel    = 3,
		CharacterLevel = 4,
		NumberOfPages  = 5,
		MAX            = 6
	};

	/**
	 * Enum DeadByDaylight.EToastWidgetType
	 */
	enum class EToastWidgetType : uint8_t
	{
		Simple       = 0,
		Interactable = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadByDaylight.ELinkedVomitState
	 */
	enum class ELinkedVomitState : uint8_t
	{
		Idle     = 0,
		Charging = 1,
		Vomiting = 2,
		MAX      = 3
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct DeadByDaylight.SecondaryInteractionProperties
	 * Size -> 0x0038
	 */
	struct FSecondaryInteractionProperties
	{
	public:
		class FString                                              SecondaryInteractionID;                                  // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputInteractionType                                      SecondaryInteractionInputType;                           // 0x0010(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6XQD[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                SecondaryInteractionDescriptionText;                     // 0x0018(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		bool                                                       ShouldShow;                                              // 0x0030(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V75Q[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.InteractionArray
	 * Size -> 0x0010
	 */
	struct FInteractionArray
	{
	public:
		TArray<TWeakObjectPtr<class UInteractionDefinition>>       _interactions;                                           // 0x0000(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.ArmIKSensorDatum
	 * Size -> 0x0030
	 */
	struct FArmIKSensorDatum
	{
	public:
		class FName                                                ShoulderBoneName;                                        // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J4WO[0x24];                                  // 0x000C(0x0024) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDAttackTargetTracker
	 * Size -> 0x00B8
	 */
	struct FDBDAttackTargetTracker
	{
	public:
		bool                                                       _useTargetTracking;                                      // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_3WB3[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FStatProperty                                       _targetSnapDistance;                                     // 0x0008(0x0088) Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                _ownerEyeSocketName;                                     // 0x0090(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                _targetBoneName;                                         // 0x009C(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class ACharacter>                           _trackedTarget;                                          // 0x00A8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class ADBDPlayer>                           _owningPlayer;                                           // 0x00B0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.ModifierTickableConditionReplicatedData
	 * Size -> 0x0018
	 */
	struct FModifierTickableConditionReplicatedData
	{
	public:
		TArray<class UBaseModifierCondition*>                      Conditions;                                              // 0x0000(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                       HasCondition;                                            // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AuthorityDataSet;                                        // 0x0011(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HDRU[0x6];                                   // 0x0012(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.StatusEffectInitializationData
	 * Size -> 0x0028
	 */
	struct FStatusEffectInitializationData
	{
	public:
		class ADBDPlayer*                                          originatingPlayer;                                       // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasOriginatingPlayer;                                    // 0x0008(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HWPG[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UGameplayModifierContainer*                          originatingEffect;                                       // 0x0010(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasOriginatingEffect;                                    // 0x0018(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EStatusEffectType                                          StatusEffectType;                                        // 0x0019(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BPX2[0x2];                                   // 0x001A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      customParam;                                             // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InitializationLifeTime;                                  // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AuthorityDataSet;                                        // 0x0024(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RAFA[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PerkInitializationData
	 * Size -> 0x0008
	 */
	struct FPerkInitializationData
	{
	public:
		int32_t                                                    PerkLevel;                                               // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputInteractionType                                      ActivatableInteractionInputType;                         // 0x0004(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AuthorityDataSet;                                        // 0x0005(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IO7X[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ItemAddonInitializationData
	 * Size -> 0x0002
	 */
	struct FItemAddonInitializationData
	{
	public:
		EInventoryItemType                                         InventoryItemType;                                       // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AuthorityDataSet;                                        // 0x0001(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.Dependency
	 * Size -> 0x0038
	 */
	struct FDependency
	{
	public:
		ETileSpawnPointType                                        Type;                                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_86QI[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     AssetReference;                                          // 0x0008(0x0020) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              Object;                                                  // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       Unique;                                                  // 0x0030(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AR22[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Count;                                                   // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct DeadByDaylight.BuiltLevelData
	 * Size -> 0x00B0
	 */
	struct FBuiltLevelData
	{
	public:
		class FName                                                ThemeName;                                               // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ThemeWeather;                                            // 0x000C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AudioStateThemes;                                        // 0x0018(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AudioStateWeather;                                       // 0x0024(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AudioThemeEvent;                                         // 0x0030(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AudioLimitPointEvent;                                    // 0x003C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              AudioThemeSoundBank[0x30];                               // 0x0048(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		class FString                                              MapName;                                                 // 0x0078(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TileCount;                                               // 0x0088(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0O1Z[0x4];                                   // 0x008C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FDependency>                                 Dependencies;                                            // 0x0090(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                SpecialEventId;                                          // 0x00A0(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BS81[0x4];                                   // 0x00AC(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SelectedOffering
	 * Size -> 0x0010
	 */
	struct FSelectedOffering
	{
	public:
		int32_t                                                    ownerId;                                                 // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                OfferingName;                                            // 0x0004(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.OfferingData
	 * Size -> 0x0018
	 */
	struct FOfferingData
	{
	public:
		bool                                                       OfferingReady;                                           // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GE4N[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSelectedOffering>                           offerings;                                               // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.GamePresetData
	 * Size -> 0x0090
	 */
	struct FGamePresetData
	{
	public:
		TArray<unsigned char>                                      _mapAvailabilities;                                      // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _perkAvailabilities;                                     // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _offeringAvailabilities;                                 // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _itemAvailabilities;                                     // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _itemAddonAvailabilities;                                // 0x0040(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _customizationItemAvailabilities;                        // 0x0050(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<unsigned char>                                      _characterAvailabilities;                                // 0x0060(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		bool                                                       _allowDlcContent;                                        // 0x0070(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _privateMatch;                                           // 0x0071(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_9N6H[0x6];                                   // 0x0072(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCustomGameBotsData                                 _botsData;                                               // 0x0078(0x0018) NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.ProgressionPoints
	 * Size -> 0x0008
	 */
	struct FProgressionPoints
	{
	public:
		EEmblemProgressionType                                     Type;                                                    // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZGJO[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Points;                                                  // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ClippedActor
	 * Size -> 0x0060
	 */
	struct FClippedActor
	{
	public:
		TArray<TWeakObjectPtr<class UPrimitiveComponent>>          DisplayComponents;                                       // 0x0000(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic
		TMap<class UPrimitiveComponent*, TWeakObjectPtr<class UPrimitiveComponent>> CollidingPrimitives;                                     // 0x0010(0x0050) ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ActorSpawnerProperties
	 * Size -> 0x0038
	 */
	struct FActorSpawnerProperties
	{
	public:
		unsigned char                                              SceneElement[0x30];                                      // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		float                                                      Weight;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H3TY[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SpawnerElement
	 * Size -> 0x0010
	 */
	struct FSpawnerElement
	{
	public:
		TArray<struct FActorSpawnerProperties>                     ObjectsToBeSpawned;                                      // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ActorVariationElements
	 * Size -> 0x0038
	 */
	struct FActorVariationElements
	{
	public:
		ETileVariation                                             Type;                                                    // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_328R[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              Element[0x30];                                           // 0x0008(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.AITrailEvent
	 * Size -> 0x0030
	 */
	struct FAITrailEvent
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      starttime;                                               // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EndTime;                                                 // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KNDY[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              Instigator;                                              // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        IgnoreOnPerkTag;                                         // 0x0020(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGenericTeamId                                      TeamIdentifier;                                          // 0x002C(0x0001) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XG8T[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.AssetLibraryLoader
	 * Size -> 0x0028
	 */
	struct FAssetLibraryLoader
	{
	public:
		class UAssetLibrary*                                       AssetLibrary;                                            // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VAT3[0x20];                                  // 0x0008(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.RoleDropdown
	 * Size -> 0x0002
	 */
	struct FRoleDropdown
	{
	public:
		bool                                                       ShowRoleSelection;                                       // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPlayerRole                                                Role;                                                    // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterDropdown
	 * Size -> 0x0006 (FullSize[0x0008] - InheritedSize[0x0002])
	 */
	struct FCharacterDropdown : public FRoleDropdown
	{
	public:
		unsigned char                                              UnknownData_SYJK[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    characterId;                                             // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AtlCookedMapDescription
	 * Size -> 0x0040
	 */
	struct FAtlCookedMapDescription
	{
	public:
		class FName                                                ThemeName;                                               // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V7YC[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              MapAsset[0x30];                                          // 0x0010(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.BlockableReplicatedDatum
	 * Size -> 0x0020
	 */
	struct FBlockableReplicatedDatum
	{
	public:
		TArray<TWeakObjectPtr<class UObject>>                      Sources;                                                 // 0x0000(0x0010) ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<TWeakObjectPtr<class ADBDPlayer>>                   BlockedPlayers;                                          // 0x0010(0x0010) ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodDecal
	 * Size -> 0x006C
	 */
	struct FBloodDecal
	{
	public:
		unsigned char                                              UnknownData_N2QC[0x6C];                                  // 0x0000(0x006C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.BorderElements
	 * Size -> 0x0018
	 */
	struct FBorderElements
	{
	public:
		EDirection                                                 Direction;                                               // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A67D[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UActorSpawner*>                               Elements;                                                // 0x0008(0x0010) Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CameraAttachment
	 * Size -> 0x0018
	 */
	struct FCameraAttachment
	{
	public:
		class USceneComponent*                                     Parent;                                                  // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BUHB[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SurvivorSleepiness
	 * Size -> 0x0008
	 */
	struct FSurvivorSleepiness
	{
	public:
		float                                                      _sleepiness;                                             // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _sleepThreshold;                                         // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDTimer
	 * Size -> 0x0028
	 */
	struct FDBDTimer
	{
	public:
		unsigned char                                              UnknownData_NNA4[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _startTime;                                              // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _startTimeDirty;                                         // 0x000C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_QN5P[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FFloat_NetQuantize8                                 _timeLeft;                                               // 0x0010(0x0008) NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _replicateTimeLeft;                                      // 0x0018(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_F5X0[0xB];                                   // 0x0019(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _interpSpeed;                                            // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct DeadByDaylight.ManagedMaterialGroup
	 * Size -> 0x0030
	 */
	struct FManagedMaterialGroup
	{
	public:
		class UObject*                                             Source;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Group;                                                   // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptDelegate                                      Condition;                                               // 0x0018(0x0010) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_W988[0x4];                                   // 0x0028(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_7QDE[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.EffectCameraTypeSettings
	 * Size -> 0x0003
	 */
	struct FEffectCameraTypeSettings
	{
	public:
		ECustomizationCategory                                     Category;                                                // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       VisibilityInFirstPerson;                                 // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       VisibilityInThirdPerson;                                 // 0x0002(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.OnMovementCacheStruct
	 * Size -> 0x000C
	 */
	struct FOnMovementCacheStruct
	{
	public:
		unsigned char                                              UnknownData_2O7T[0xC];                                   // 0x0000(0x000C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterToolData
	 * Size -> 0x0080
	 */
	struct FCharacterToolData
	{
	public:
		EPlayerRole                                                Role;                                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZWVK[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    characterId;                                             // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                OutfitId;                                                // 0x0008(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CharmId;                                                 // 0x0014(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorHead;                                            // 0x0020(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorTorso;                                           // 0x002C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorLegs;                                            // 0x0038(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerHead;                                              // 0x0044(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerBody;                                              // 0x0050(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerWeapon;                                            // 0x005C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAnimBP;                                                // 0x0068(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8P6A[0x7];                                   // 0x0069(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              AnimAsset;                                               // 0x0070(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterToolSpawnParameters
	 * Size -> 0x0003
	 */
	struct FCharacterToolSpawnParameters
	{
	public:
		bool                                                       IsAnimated;                                              // 0x0000(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShowPower;                                               // 0x0001(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseMasterPoseForItems;                                   // 0x0002(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.NamedButton
	 * Size -> 0x0018
	 */
	struct FNamedButton
	{
	public:
		int32_t                                                    ClickCounter;                                            // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X2CQ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              DisplayName;                                             // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterToolItemData
	 * Size -> 0x0010
	 */
	struct FCharacterToolItemData
	{
	public:
		ECharacterToolItemType                                     _type;                                                   // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KFG8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                _id;                                                     // 0x0004(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.ChargeData
	 * Size -> 0x0010
	 */
	struct FChargeData
	{
	public:
		class AActor*                                              Instigator;                                              // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ChargeAmount;                                            // 0x0008(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       BypassSkillCheckFail;                                    // 0x000C(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsOneTimeIncrease;                                       // 0x000D(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_11EO[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CharmAttacherAnimationTweak
	 * Size -> 0x0020
	 */
	struct FCharmAttacherAnimationTweak
	{
	public:
		struct FVector                                             AttachPointTranslation;                                  // 0x0000(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            AttachPointRotation;                                     // 0x000C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		int32_t                                                    ConstraintType;                                          // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MagicTweakingFloat;                                      // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharmSlot
	 * Size -> 0x00B0
	 */
	struct FCharmSlot
	{
	public:
		int32_t                                                    slotIndex;                                               // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T48D[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              CharmAttacherClass[0x30];                                // 0x0008(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		struct FCharmAttacherAnimationTweak                        DefaultAnimationTweak;                                   // 0x0038(0x0020) Edit, NoDestructor, NativeAccessSpecifierPublic
		TMap<class FName, struct FCharmAttacherAnimationTweak>     AnimationTweakByTag;                                     // 0x0058(0x0050) Edit, NativeAccessSpecifierPublic
		class ACharmAttacher*                                      CharmAttacherSpawned;                                    // 0x00A8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.TargetFocusTimer
	 * Size -> 0x0038
	 */
	struct FTargetFocusTimer
	{
	public:
		class ACamperPlayer*                                       _camper;                                                 // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FDBDTimer                                           _cooldownTimer;                                          // 0x0008(0x0028) NativeAccessSpecifierPrivate
		float                                                      _totalTime;                                              // 0x0030(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WCUR[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ChaseUpdateInfo
	 * Size -> 0x0048
	 */
	struct FChaseUpdateInfo
	{
	public:
		struct FTargetFocusTimer                                   ChaseTimer;                                              // 0x0000(0x0038) NativeAccessSpecifierPublic
		float                                                      SurvivorTravelDistance;                                  // 0x0038(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      KillerTravelDistance;                                    // 0x003C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECamperDamageState                                         ChaseStartHealthStatus;                                  // 0x0040(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YYDM[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.Cinematic
	 * Size -> 0x0058
	 */
	struct FCinematic
	{
	public:
		unsigned char                                              UnknownData_OS3P[0x58];                                  // 0x0000(0x0058) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.MaterialOriginalState
	 * Size -> 0x0018
	 */
	struct FMaterialOriginalState
	{
	public:
		class UMeshComponent*                                      MeshWithChangedMaterials;                                // 0x0000(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInterface*>                          OriginalMaterial;                                        // 0x0008(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.StaticMeshesArrayForClip
	 * Size -> 0x0010
	 */
	struct FStaticMeshesArrayForClip
	{
	public:
		unsigned char                                              UnknownData_RJR4[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SpecialBehaviourObjectsInfo
	 * Size -> 0x0014
	 */
	struct FSpecialBehaviourObjectsInfo
	{
	public:
		class FName                                                SpecialBehaviourId;                                      // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    amountRequired;                                          // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TimesInteractedWith;                                     // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DataTableDropdown
	 * Size -> 0x0030
	 */
	struct FDataTableDropdown
	{
	public:
		class FName                                                RowValue;                                                // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_9WUP[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              DataTableName;                                           // 0x0010(0x0010) Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                ColumnName;                                              // 0x0020(0x000C) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_D8PL[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomizedMeshPart
	 * Size -> 0x0048
	 */
	struct FCustomizedMeshPart
	{
	public:
		ECustomizationCategory                                     Category;                                                // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8XO0[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDataTableDropdown                                  DefaultItemId;                                           // 0x0008(0x0030) Edit, NativeAccessSpecifierPublic
		class FName                                                SocketName;                                              // 0x0038(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K9JG[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CosmeticPieceMeshLoadingData
	 * Size -> 0x0370
	 */
	struct FCosmeticPieceMeshLoadingData
	{
	public:
		unsigned char                                              UnknownData_Z3F0[0x368];                                 // 0x0000(0x0368) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMesh*                                       SkeletalMesh;                                            // 0x0368(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.HudEditorDragFromParentAxisLimit
	 * Size -> 0x0014
	 */
	struct FHudEditorDragFromParentAxisLimit
	{
	public:
		bool                                                       enable;                                                  // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EHudEditorDragAxisOption                                   AxisOption;                                              // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CGIL[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinDragDistance;                                         // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ScaleMinDragDistanceWithParent;                          // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LXZN[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxDragDistance;                                         // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ScaleMaxDragDistanceWithParent;                          // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RFPH[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.MapMeshToAkAudioEvent
	 * Size -> 0x0040
	 */
	struct FMapMeshToAkAudioEvent
	{
	public:
		unsigned char                                              Mesh[0x30];                                              // 0x0000(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		class UAkAudioEvent*                                       SoundEvent;                                              // 0x0030(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDelayBetweenEvents;                                   // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDelayBetweenObject;                                   // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.MapSoundsToAvoid
	 * Size -> 0x0010
	 */
	struct FMapSoundsToAvoid
	{
	public:
		class UPrimitiveComponent*                                 Component;                                               // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WWDJ[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DBD_SoundSpawnerData
	 * Size -> 0x0028
	 */
	struct FDBD_SoundSpawnerData
	{
	public:
		unsigned char                                              TriggerObject[0x10];                                     // 0x0000(0x0010) UNKNOWN PROPERTY: ArrayProperty
		bool                                                       TriggerVisualForCamper;                                  // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       TriggerVisualForSlasher;                                 // 0x0011(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9R83[0x6];                                   // 0x0012(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              ActorToSpawnVisual[0x10];                                // 0x0018(0x0010) UNKNOWN PROPERTY: ArrayProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.AttackDelegatePair
	 * Size -> 0x0010
	 */
	struct FAttackDelegatePair
	{
	public:
		class UDBDAttack*                                          _attack;                                                 // 0x0000(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ZFAO[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.AuthenticationInfo
	 * Size -> 0x0018
	 */
	struct FAuthenticationInfo
	{
	public:
		unsigned char                                              UnknownData_QHP5[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PerMeshInstancingData
	 * Size -> 0x0190
	 */
	struct FPerMeshInstancingData
	{
	public:
		TMap<uint32_t, class UInstancedStaticMeshComponent*>       gpuCulling_hashToInstancedMeshes;                        // 0x0000(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		TMap<uint32_t, class UInstancedStaticMeshComponent*>       gpuCullingSwap_hashToInstancedMeshes;                    // 0x0050(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		TMap<uint32_t, class UInstancedStaticMeshComponent*>       hism_hashToInstancedMeshes;                              // 0x00A0(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S0NA[0xA0];                                  // 0x00F0(0x00A0) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.StaticMeshAutoBatch
	 * Size -> 0x0030
	 */
	struct FStaticMeshAutoBatch
	{
	public:
		class UStaticMesh*                                         StaticMesh;                                              // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LGS0[0x18];                                  // 0x0008(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UStaticMeshComponent*>                        staticMeshComponents;                                    // 0x0020(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.SpawnInfo
	 * Size -> 0x0040
	 */
	struct FSpawnInfo
	{
	public:
		class UClass*                                              ActorClass;                                              // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7DV6[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0010(0x0030) IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AffectedMaterialAndVariant
	 * Size -> 0x0010
	 */
	struct FAffectedMaterialAndVariant
	{
	public:
		class UMaterialInterface*                                  AffectedMaterial;                                        // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInterface*                                  MaterialVariant;                                         // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CurrencyConversion
	 * Size -> 0x0050
	 */
	struct FCurrencyConversion
	{
	public:
		TMap<ECurrencyType, float>                                 AmountInOtherCurrency;                                   // 0x0000(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomTransformation
	 * Size -> 0x0014
	 */
	struct FCustomTransformation
	{
	public:
		bool                                                       UseCustomTransformation;                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_V35N[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           CustomScale;                                             // 0x0004(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector2D                                           CustomTranslation;                                       // 0x000C(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.ItemUIData
	 * Size -> 0x00C0
	 */
	struct FItemUIData
	{
	public:
		class FText                                                DisplayName;                                             // 0x0000(0x0018) Edit, NativeAccessSpecifierPrivate
		class FText                                                Description;                                             // 0x0018(0x0018) Edit, NativeAccessSpecifierPrivate
		TArray<class FString>                                      IconFilePathList;                                        // 0x0030(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              IconAssetList[0x10];                                     // 0x0040(0x0010) UNKNOWN PROPERTY: ArrayProperty
		struct FCustomTransformation                               CustomTransformation;                                    // 0x0050(0x0014) Edit, NoDestructor, NativeAccessSpecifierPrivate
		uint32_t                                                   PlatformsUnlicensedNameOverride;                         // 0x0064(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		uint32_t                                                   PlatformsUnlicensedDescriptionOverride;                  // 0x0068(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		uint32_t                                                   PlatformsForIconUnlicensedFilePathListOverride;          // 0x006C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class FString>                                      IconUnlicensedFilePathListOverride;                      // 0x0070(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPrivate
		bool                                                       LicenseExpirationOverride;                               // 0x0080(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_J3WR[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                DisplayNameUnlicensedOverride;                           // 0x0088(0x0018) Edit, NativeAccessSpecifierPrivate
		class FText                                                DescriptionUnlicensedOverride;                           // 0x00A0(0x0018) Edit, NativeAccessSpecifierPrivate
		int32_t                                                    AssociatedCharacterIndex;                                // 0x00B8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_YOW7[0x4];                                   // 0x00BC(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ItemAvailability
	 * Size -> 0x0030
	 */
	struct FItemAvailability
	{
	public:
		EItemAvailability                                          ItemAvailability;                                        // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_K19N[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              DLCId;                                                   // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    CloudInventoryId;                                        // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_NXVW[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              CommunityId;                                             // 0x0020(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomizationData
	 * Size -> 0x0128 (FullSize[0x0130] - InheritedSize[0x0008])
	 */
	struct FCustomizationData : public FDBDTableRowBase
	{
	public:
		int32_t                                                    AssociatedCharacter;                                     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPlayerRole                                                AssociatedRole;                                          // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x000D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9T94[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FItemUIData                                         UIData;                                                  // 0x0010(0x00C0) Edit, NativeAccessSpecifierPublic
		struct FItemAvailability                                   Availability;                                            // 0x00D0(0x0030) Edit, NativeAccessSpecifierPublic
		class FString                                              InclusionVersion;                                        // 0x0100(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              CustomizationId;                                         // 0x0110(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IJBE[0x10];                                  // 0x0120(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.MaterialReplacerData
	 * Size -> 0x0060
	 */
	struct FMaterialReplacerData
	{
	public:
		unsigned char                                              From[0x30];                                              // 0x0000(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              To[0x30];                                                // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.MaterialReplacerArray
	 * Size -> 0x0010
	 */
	struct FMaterialReplacerArray
	{
	public:
		TArray<struct FMaterialReplacerData>                       MaterialsMap;                                            // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ConditionalMaterialReplacer
	 * Size -> 0x0060
	 */
	struct FConditionalMaterialReplacer
	{
	public:
		class FName                                                ItemTag;                                                 // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_73RR[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, struct FMaterialReplacerArray>           ConditionalMaterials;                                    // 0x0010(0x0050) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.TextureReplacerData
	 * Size -> 0x0070
	 */
	struct FTextureReplacerData
	{
	public:
		unsigned char                                              BaseMaterial[0x30];                                      // 0x0000(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              ReplacementTexture[0x30];                                // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		class FName                                                TextureParameterName;                                    // 0x0060(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ExplicitMaterialSlot;                                    // 0x006C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BPAttachementSocketData
	 * Size -> 0x00E0
	 */
	struct FBPAttachementSocketData
	{
	public:
		unsigned char                                              AccessoryBlueprint[0x30];                                // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              SkeletalMesh[0x30];                                      // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		class FName                                                SocketName;                                              // 0x0060(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3A3O[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FMaterialReplacerData>                       MaterialsMap;                                            // 0x0070(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FConditionalMaterialReplacer                        ConditionalMaterialReplacer;                             // 0x0080(0x0060) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.UnlockSaveStatCondition
	 * Size -> 0x0014
	 */
	struct FUnlockSaveStatCondition
	{
	public:
		class FName                                                StatName;                                                // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ValueRequired;                                           // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       isCharacterSpecific;                                     // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4XC6[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomSoundFXData
	 * Size -> 0x0018
	 */
	struct FCustomSoundFXData
	{
	public:
		EAudioCustomizationCategory                                AudioCategory;                                           // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OCG5[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              switchState;                                             // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomAnimData
	 * Size -> 0x0060
	 */
	struct FCustomAnimData
	{
	public:
		unsigned char                                              MenuAnimationBlueprint[0x30];                            // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              InGameAnimationBlueprint[0x30];                          // 0x0030(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.CustomizationItemData
	 * Size -> 0x0238 (FullSize[0x0368] - InheritedSize[0x0130])
	 */
	struct FCustomizationItemData : public FCustomizationData
	{
	public:
		ECustomizationCategory                                     Category;                                                // 0x0130(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TYDH[0x7];                                   // 0x0131(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              ItemMesh[0x30];                                          // 0x0138(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              AnimClass[0x30];                                         // 0x0168(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              ItemBlueprint[0x30];                                     // 0x0198(0x0030) UNKNOWN PROPERTY: SoftClassProperty
		TArray<struct FMaterialReplacerData>                       MaterialsMap;                                            // 0x01C8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FConditionalMaterialReplacer                        ConditionalMaterialReplacer;                             // 0x01D8(0x0060) Edit, NativeAccessSpecifierPublic
		TArray<struct FTextureReplacerData>                        TexturesMap;                                             // 0x0238(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FName>                                        SkeletalComponentTags;                                   // 0x0248(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               CosmeticOverrideSemanticTags;                            // 0x0258(0x0020) Edit, NativeAccessSpecifierPublic
		class FText                                                CollectionName;                                          // 0x0278(0x0018) Edit, NativeAccessSpecifierPublic
		class FText                                                CollectionDescription;                                   // 0x0290(0x0018) Edit, NativeAccessSpecifierPublic
		int32_t                                                    PrestigeUlockLevel;                                      // 0x02A8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N3TX[0x4];                                   // 0x02AC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              PrestigeUnlockDate;                                      // 0x02B0(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                EventId;                                                 // 0x02C0(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECharmCategory                                             CharmCategory;                                           // 0x02CC(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MMVJ[0x3];                                   // 0x02CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FBPAttachementSocketData>                    SocketAttachements;                                      // 0x02D0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FUnlockSaveStatCondition>                    UnlockingConditions;                                     // 0x02E0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       IsInStore;                                               // 0x02F0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsInNonViolentBuild;                                     // 0x02F1(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAvailableInAtlantaBuild;                               // 0x02F2(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_I5FH[0x1];                                   // 0x02F3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint32_t                                                   PlatformExclusiveFlag;                                   // 0x02F4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCustomSoundFXData>                          CustomSFXs;                                              // 0x02F8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCustomAnimData                                     AnimationData;                                           // 0x0308(0x0060) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDCustomizationToolData
	 * Size -> 0x0E18
	 */
	struct FDBDCustomizationToolData
	{
	public:
		struct FCustomizationItemData                              Head;                                                    // 0x0000(0x0368) Edit, NativeAccessSpecifierPublic
		struct FCustomizationItemData                              Torso;                                                   // 0x0368(0x0368) Edit, NativeAccessSpecifierPublic
		struct FCustomizationItemData                              Leg;                                                     // 0x06D0(0x0368) Edit, NativeAccessSpecifierPublic
		struct FCustomizationItemData                              Bodies;                                                  // 0x0A38(0x0368) Edit, NativeAccessSpecifierPublic
		class FString                                              characterName;                                           // 0x0DA0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              RoleName;                                                // 0x0DB0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh*                                       BaseSkeleton;                                            // 0x0DC0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture2D*                                          MaskTexture;                                             // 0x0DC8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimationAsset*                                     AnimationToPlay;                                         // 0x0DD0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StrHeadDLC;                                              // 0x0DD8(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StrTorsoDLC;                                             // 0x0DE8(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StrLegDLC;                                               // 0x0DF8(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StrBodiesDLC;                                            // 0x0E08(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterCustomizationDropdown
	 * Size -> 0x0054 (FullSize[0x005C] - InheritedSize[0x0008])
	 */
	struct FCharacterCustomizationDropdown : public FCharacterDropdown
	{
	public:
		class FName                                                OutfitId;                                                // 0x0008(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorHead;                                            // 0x0014(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorTorso;                                           // 0x0020(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SurvivorLegs;                                            // 0x002C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerHead;                                              // 0x0038(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerBody;                                              // 0x0044(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                KillerWeapon;                                            // 0x0050(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharmDropdown
	 * Size -> 0x000E (FullSize[0x0010] - InheritedSize[0x0002])
	 */
	struct FCharmDropdown : public FRoleDropdown
	{
	public:
		unsigned char                                              UnknownData_J9KW[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                CharmId;                                                 // 0x0004(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ItemIdDropdown
	 * Size -> 0x000E (FullSize[0x0010] - InheritedSize[0x0002])
	 */
	struct FItemIdDropdown : public FRoleDropdown
	{
	public:
		unsigned char                                              UnknownData_PY7O[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                ItemId;                                                  // 0x0004(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AddonDropdown
	 * Size -> 0x000E (FullSize[0x0010] - InheritedSize[0x0002])
	 */
	struct FAddonDropdown : public FRoleDropdown
	{
	public:
		unsigned char                                              UnknownData_ITIL[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                AddonID;                                                 // 0x0004(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugLoadoutAddon
	 * Size -> 0x0010
	 */
	struct FDebugLoadoutAddon
	{
	public:
		struct FAddonDropdown                                      AddonDropdown;                                           // 0x0000(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.PerkDropdown
	 * Size -> 0x000E (FullSize[0x0010] - InheritedSize[0x0002])
	 */
	struct FPerkDropdown : public FRoleDropdown
	{
	public:
		unsigned char                                              UnknownData_5H5Z[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                perkId;                                                  // 0x0004(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugLoadoutPerk
	 * Size -> 0x0014
	 */
	struct FDebugLoadoutPerk
	{
	public:
		struct FPerkDropdown                                       PerkDropdown;                                            // 0x0000(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		int32_t                                                    PerkLevel;                                               // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CamperLoadout
	 * Size -> 0x00C0
	 */
	struct FCamperLoadout
	{
	public:
		struct FCharacterCustomizationDropdown                     camper;                                                  // 0x0000(0x005C) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FCharmDropdown                                      Slot0_CharmID;                                           // 0x005C(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FCharmDropdown                                      Slot1_CharmID;                                           // 0x006C(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FCharmDropdown                                      Slot2_CharmID;                                           // 0x007C(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FItemIdDropdown                                     Item;                                                    // 0x008C(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3IHU[0x4];                                   // 0x009C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FDebugLoadoutAddon>                          AddonIDs;                                                // 0x00A0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FDebugLoadoutPerk>                           Perks;                                                   // 0x00B0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.SlasherLoadout
	 * Size -> 0x0080
	 */
	struct FSlasherLoadout
	{
	public:
		TArray<struct FDebugLoadoutPerk>                           Perks;                                                   // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FDebugLoadoutAddon>                          PowerAddonIDs;                                           // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterCustomizationDropdown                     Slasher;                                                 // 0x0020(0x005C) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QCO0[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugQuestModelExtArchiveCondition
	 * Size -> 0x0020
	 */
	struct FDebugQuestModelExtArchiveCondition
	{
	public:
		class FString                                              Key;                                                     // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      value;                                                   // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugModelExtArchiveQuestEvent
	 * Size -> 0x0028
	 */
	struct FDebugModelExtArchiveQuestEvent
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              QuestEventId;                                            // 0x0010(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Repetition;                                              // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K72E[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugModelExtArchiveQuestSpecialBehaviours
	 * Size -> 0x0020
	 */
	struct FDebugModelExtArchiveQuestSpecialBehaviours
	{
	public:
		class FString                                              ID;                                                      // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Params;                                                  // 0x0010(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DebugQuestModelExtArchiveObjective
	 * Size -> 0x0038
	 */
	struct FDebugQuestModelExtArchiveObjective
	{
	public:
		TArray<struct FDebugQuestModelExtArchiveCondition>         Conditions;                                              // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    NeededProgression;                                       // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E114[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FDebugModelExtArchiveQuestEvent>             QuestEvents;                                             // 0x0018(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FDebugModelExtArchiveQuestSpecialBehaviours> SpecialBehaviours;                                       // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.PerkLevelDefinition
	 * Size -> 0x0004
	 */
	struct FPerkLevelDefinition
	{
	public:
		int32_t                                                    CountRequired;                                           // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.GameEventForwarderInfo
	 * Size -> 0x0020
	 */
	struct FGameEventForwarderInfo
	{
	public:
		TArray<struct FGameplayTag>                                GameEventsToRegister;                                    // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FGameplayTag                                        ForwardedEvent;                                          // 0x0010(0x000C) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GMWE[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ForceSpawnTileData
	 * Size -> 0x0020
	 */
	struct FForceSpawnTileData
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    matrixX;                                                 // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    matrixY;                                                 // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Rotation;                                                // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5SZH[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ParadiseData
	 * Size -> 0x0058
	 */
	struct FParadiseData
	{
	public:
		unsigned char                                              UnknownData_VBXV[0x58];                                  // 0x0000(0x0058) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SharedAuthenticationTokenInformation
	 * Size -> 0x0030
	 */
	struct FSharedAuthenticationTokenInformation
	{
	public:
		class FString                                              LoginProvider;                                           // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              AuthToken;                                               // 0x0010(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              TokenType;                                               // 0x0020(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BonusTierTooltipVisibility
	 * Size -> 0x0018
	 */
	struct FBonusTierTooltipVisibility
	{
	public:
		class FString                                              ArchiveId;                                               // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsVisible;                                               // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A0LY[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.AtlantaCustomizedHudSettings
	 * Size -> 0x0040
	 */
	struct FAtlantaCustomizedHudSettings
	{
	public:
		struct FGameplayTag                                        ID;                                                      // 0x0000(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           NormalizedOffset;                                        // 0x000C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Scale;                                                   // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RenderOpacity;                                           // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Version;                                                 // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               OverlapWrapperIds;                                       // 0x0020(0x0020) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDFoliageInstance
	 * Size -> 0x004C
	 */
	struct FDBDFoliageInstance
	{
	public:
		int32_t                                                    BaseId;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ProceduralGuid;                                          // 0x0004(0x0010) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x0014(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x0020(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            PreAlignRotation;                                        // 0x002C(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             DrawScale3D;                                             // 0x0038(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ZOffset;                                                 // 0x0044(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   Flags;                                                   // 0x0048(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDFoliageInfo
	 * Size -> 0x0018
	 */
	struct FDBDFoliageInfo
	{
	public:
		class UFoliageType*                                        FoliageType;                                             // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FDBDFoliageInstance>                         Instances;                                               // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.KeyDisplayInfo
	 * Size -> 0x0040
	 */
	struct FKeyDisplayInfo
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0020) HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              KeyDisplayName;                                          // 0x0020(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              PromptType;                                              // 0x0030(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.TypeFoliageToAutomateDensity
	 * Size -> 0x0068
	 */
	struct FTypeFoliageToAutomateDensity
	{
	public:
		unsigned char                                              SourceMesh[0x30];                                        // 0x0000(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              ReplacementMesh[0x30];                                   // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
		bool                                                       bGenerateOverlaps;                                       // 0x0060(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReceiveDecals;                                          // 0x0061(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECanBeCharacterBase                                        bCanCharacterStepOn;                                     // 0x0062(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDetailMode                                                DetailMode;                                              // 0x0063(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinimumFoliageRadius;                                    // 0x0064(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DBDOutlineRenderStrategySelector
	 * Size -> 0x0040
	 */
	struct FDBDOutlineRenderStrategySelector
	{
	public:
		unsigned char                                              UnknownData_GW2Z[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              _actorForStrategy;                                       // 0x0008(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UBaseOutlineRenderStrategy*                          _selectedStrategy;                                       // 0x0010(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ANVG[0x28];                                  // 0x0018(0x0028) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.OutlineColourConfiguration
	 * Size -> 0x0010
	 */
	struct FOutlineColourConfiguration
	{
	public:
		struct FLinearColor                                        ColourValue;                                             // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.GamePersistentData
	 * Size -> 0x0108
	 */
	struct FGamePersistentData
	{
	public:
		int32_t                                                    PlayerCount;                                             // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    spectatorCount;                                          // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGamePresetData                                     GamePresetData;                                          // 0x0008(0x0090) NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_86FY[0x70];                                  // 0x0098(0x0070) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerLoadoutData
	 * Size -> 0x0098
	 */
	struct FPlayerLoadoutData
	{
	public:
		class FName                                                Item;                                                    // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ES77[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        ItemAddOns;                                              // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FName>                                        CamperPerks;                                             // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            CamperPerkLevels;                                        // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                CamperFavor;                                             // 0x0040(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                Power;                                                   // 0x004C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                        PowerAddOns;                                             // 0x0058(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FName>                                        SlasherPerks;                                            // 0x0068(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            SlasherPerkLevels;                                       // 0x0078(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                SlasherFavor;                                            // 0x0088(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DVQU[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerSavedProfileDataShared
	 * Size -> 0x0068
	 */
	struct FPlayerSavedProfileDataShared
	{
	public:
		class FString                                              playerName;                                              // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SelectedCamperIndex;                                     // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SelectedSlasherIndex;                                    // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FEquippedPlayerCustomization                        SelectedCharacterCustomization;                          // 0x0018(0x0038) NativeAccessSpecifierPublic
		int32_t                                                    CamperStreak;                                            // 0x0050(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShowPortraitBorder;                                      // 0x0054(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasActiveSubscription;                                   // 0x0055(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0SDK[0x2];                                   // 0x0056(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              PlatformId;                                              // 0x0058(0x0010) ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct DeadByDaylight.DailyRitualSaveData
	 * Size -> 0x0008
	 */
	struct FDailyRitualSaveData
	{
	public:
		struct FDateTime                                           LastRitualPopupDate;                                     // 0x0000(0x0008) ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.UIViewFlagSaveData
	 * Size -> 0x0050
	 */
	struct FUIViewFlagSaveData
	{
	public:
		TMap<class FString, bool>                                  CharactersFirstBloodweb;                                 // 0x0000(0x0050) SaveGame, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.FearMarketItemInstance
	 * Size -> 0x0030
	 */
	struct FFearMarketItemInstance
	{
	public:
		class FName                                                ItemId;                                                  // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BloodpointConversion;                                    // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Purchased;                                               // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JCCJ[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DiscountPercentage;                                      // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_88YZ[0x18];                                  // 0x0018(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.FearMarketOfferingInstance
	 * Size -> 0x0020
	 */
	struct FFearMarketOfferingInstance
	{
	public:
		TArray<struct FFearMarketItemInstance>                     ObjectsForSale;                                          // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		struct FDateTime                                           starttime;                                               // 0x0010(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           EndTime;                                                 // 0x0018(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodwebNodeProperties
	 * Size -> 0x0020
	 */
	struct FBloodwebNodeProperties
	{
	public:
		EBloodwebNodeContentType                                   ContentType;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZBQN[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FString>                                      Tags;                                                    // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    characterId;                                             // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VU6N[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodwebNodeGate
	 * Size -> 0x0000 (FullSize[0x0008] - InheritedSize[0x0008])
	 */
	struct FBloodwebNodeGate : public FDBDTableRowBase
	{	};

	/**
	 * ScriptStruct DeadByDaylight.BloodwebChest
	 * Size -> 0x0030 (FullSize[0x0038] - InheritedSize[0x0008])
	 */
	struct FBloodwebChest : public FDBDTableRowBase
	{
	public:
		class FName                                                ID;                                                      // 0x0008(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                EventId;                                                 // 0x0014(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBloodchestType                                            ChestType;                                               // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x0021(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XIMY[0x6];                                   // 0x0022(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              GivenItemRarity;                                         // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodwebNode
	 * Size -> 0x0090
	 */
	struct FBloodwebNode
	{
	public:
		struct FBloodwebNodeProperties                             Properties;                                              // 0x0000(0x0020) NativeAccessSpecifierPublic
		TArray<struct FBloodwebNodeGate>                           Gates;                                                   // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		EBloodwebNodeState                                         State;                                                   // 0x0030(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O22H[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              nodeId;                                                  // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ContentId;                                               // 0x0048(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SN0M[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBloodwebChest                                      BloodwebChest;                                           // 0x0058(0x0038) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodWebRingPersistentData
	 * Size -> 0x0010
	 */
	struct FBloodWebRingPersistentData
	{
	public:
		TArray<struct FBloodwebNode>                               NodeData;                                                // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.BloodWebPersistentData
	 * Size -> 0x0050
	 */
	struct FBloodWebPersistentData
	{
	public:
		int32_t                                                    VersionNumber;                                           // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Level;                                                   // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FBloodWebRingPersistentData>                 RingData;                                                // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FName>                                        Paths;                                                   // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class FString                                              EntityCurrentNode;                                       // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           GenerationDate;                                          // 0x0038(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Seed;                                                    // 0x0040(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterCustomizationPreset
	 * Size -> 0x0038
	 */
	struct FCharacterCustomizationPreset
	{
	public:
		class FName                                                Head;                                                    // 0x0000(0x000C) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                TorsoOrBody;                                             // 0x000C(0x000C) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                LegsOrWeapon;                                            // 0x0018(0x000C) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XNRR[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FCharmIdSlot>                                Charms;                                                  // 0x0028(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterCustomizationPresetsList
	 * Size -> 0x0018
	 */
	struct FCharacterCustomizationPresetsList
	{
	public:
		int32_t                                                    characterId;                                             // 0x0000(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ActivePreset;                                            // 0x0004(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCharacterCustomizationPreset>               Presets;                                                 // 0x0008(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterLoadoutPreset
	 * Size -> 0x0040
	 */
	struct FCharacterLoadoutPreset
	{
	public:
		class FName                                                PowerOrItem;                                             // 0x0000(0x000C) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LE5O[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        addons;                                                  // 0x0010(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
		TArray<class FName>                                        Perks;                                                   // 0x0020(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
		class FName                                                Favor;                                                   // 0x0030(0x000C) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V81U[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterLoadoutPresetsList
	 * Size -> 0x0018
	 */
	struct FCharacterLoadoutPresetsList
	{
	public:
		int32_t                                                    characterId;                                             // 0x0000(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ActivePreset;                                            // 0x0004(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCharacterLoadoutPreset>                     Presets;                                                 // 0x0008(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerSavedProfileCumulativeData
	 * Size -> 0x0038
	 */
	struct FPlayerSavedProfileCumulativeData
	{
	public:
		bool                                                       FirstTimePlaying;                                        // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_94MN[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CumulativeMatches;                                       // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CumulativeMatchesAsSurvivor;                             // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CumulativeMatchesAsKiller;                               // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CumulativeMatchesAsSurvivorNoFriends;                    // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CumulativeMatchesAsKillerNoFriends;                      // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastMatchTimestamp;                                      // 0x0018(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastSessionTimestamp;                                    // 0x0020(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CumulativeSessions;                                      // 0x0028(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WASG[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTimespan                                           CumulativePlaytime;                                      // 0x0030(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.SavedStatsData
	 * Size -> 0x0014
	 */
	struct FSavedStatsData
	{
	public:
		uint32_t                                                   Version;                                                 // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                Name;                                                    // 0x0004(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      value;                                                   // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterSavedInventoryData
	 * Size -> 0x0010
	 */
	struct FCharacterSavedInventoryData
	{
	public:
		uint32_t                                                   Version;                                                 // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                Name;                                                    // 0x0004(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AssignedPerkProperties
	 * Size -> 0x0014
	 */
	struct FAssignedPerkProperties
	{
	public:
		class FName                                                perkId;                                                  // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    PerkLevel;                                               // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsTeachable;                                             // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VAN4[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SavedCharacterLevelData
	 * Size -> 0x0018
	 */
	struct FSavedCharacterLevelData
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasPerksBeenSelected;                                    // 0x0004(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasPerkSelectionBeenGenerated;                           // 0x0005(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H9EP[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAssignedPerkProperties>                     PerkSelection;                                           // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterSavedProfileData
	 * Size -> 0x0190
	 */
	struct FCharacterSavedProfileData
	{
	public:
		int32_t                                                    BloodWebLevel;                                           // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TimesConfronted;                                         // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FDateTime>                                   PrestigeEarnedDates;                                     // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		struct FBloodWebPersistentData                             BloodWebData;                                            // 0x0018(0x0050) NativeAccessSpecifierPublic
		struct FPlayerLoadoutData                                  CharacterLoadoutData;                                    // 0x0068(0x0098) NativeAccessSpecifierPublic
		struct FEquippedPlayerCustomization                        CurrentCustomization;                                    // 0x0100(0x0038) NativeAccessSpecifierPublic
		TArray<class FName>                                        UniquePerksAdded;                                        // 0x0138(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       CharacterBloodwebMigrationIsDone;                        // 0x0148(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ELHD[0x7];                                   // 0x0149(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FCharacterSavedInventoryData>                InventoryData;                                           // 0x0150(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<struct FSavedCharacterLevelData>                    CharacterLevelData;                                      // 0x0160(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<struct FSavedStatsData>                             StatProgression;                                         // 0x0170(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		int32_t                                                    PrestigeLevel;                                           // 0x0180(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    LegacyPrestigeLevel;                                     // 0x0184(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    CharacterExperience;                                     // 0x0188(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_D67U[0x4];                                   // 0x018C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.SpecialEventSavedData
	 * Size -> 0x0002
	 */
	struct FSpecialEventSavedData
	{
	public:
		bool                                                       EventEntryScreenOpened;                                  // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       EventSplashScreenSeen;                                   // 0x0001(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ReleaseSavedData
	 * Size -> 0x0001
	 */
	struct FReleaseSavedData
	{
	public:
		bool                                                       NewChapterPopupSeen;                                     // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerSavedProfileDataLocal
	 * Size -> 0x04C0
	 */
	struct FPlayerSavedProfileDataLocal
	{
	public:
		int32_t                                                    Tokens;                                                  // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P5JV[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        offerings;                                               // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TMap<class FName, bool>                                    PageVisited;                                             // 0x0018(0x0050) NativeAccessSpecifierPublic
		TMap<class FName, bool>                                    ChatVisible;                                             // 0x0068(0x0050) NativeAccessSpecifierPublic
		TMap<class FName, bool>                                    OnboardingCompleted;                                     // 0x00B8(0x0050) NativeAccessSpecifierPublic
		int32_t                                                    ConsecutiveMatchStreak;                                  // 0x0108(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Wins;                                                    // 0x010C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Losses;                                                  // 0x0110(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IQ1P[0x4];                                   // 0x0114(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint64_t                                                   CurrentSeasonTicks;                                      // 0x0118(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDailyRitualSaveData                                DailyRitualSaveData;                                     // 0x0120(0x0008) NoDestructor, NativeAccessSpecifierPublic
		struct FUIViewFlagSaveData                                 UIViewFlags;                                             // 0x0128(0x0050) NativeAccessSpecifierPublic
		struct FFearMarketOfferingInstance                         FearMarket;                                              // 0x0178(0x0020) NativeAccessSpecifierPublic
		struct FPlayerLoadoutData                                  LastConnectedLoadout;                                    // 0x0198(0x0098) NativeAccessSpecifierPublic
		int32_t                                                    LastConnectedCharacterIndex;                             // 0x0230(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_657O[0x4];                                   // 0x0234(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDateTime                                           DisconnectPenaltyTime;                                   // 0x0238(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastMatchEndTime;                                        // 0x0240(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastMatchStartTime;                                      // 0x0248(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastKillerMatchEndTime;                                  // 0x0250(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           LastSurvivorMatchEndTime;                                // 0x0258(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FBloodWebPersistentData                             BloodStoreKillers;                                       // 0x0260(0x0050) NativeAccessSpecifierPublic
		struct FBloodWebPersistentData                             BloodStoreSurvivors;                                     // 0x02B0(0x0050) NativeAccessSpecifierPublic
		bool                                                       CrossplayAllowed;                                        // 0x0300(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoDeclineFriendInvites;                                // 0x0301(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IN5B[0x6];                                   // 0x0302(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FCharacterCustomizationPresetsList>          CharacterCustomizationPresets;                           // 0x0308(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FCharacterLoadoutPresetsList>                CharacterLoadoutPresets;                                 // 0x0318(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		struct FPlayerSavedProfileCumulativeData                   _cumulativeData;                                         // 0x0328(0x0038) NoDestructor, NativeAccessSpecifierPrivate
		TArray<struct FSavedStatsData>                             _savedPlayerStats;                                       // 0x0360(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		bool                                                       _hasBeenGivenKillerTutorialEndReward;                    // 0x0370(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasBeenGivenSurvivorTutorialEndReward;                  // 0x0371(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasSeenBloodpointsOnboardingCurrencyPopup;              // 0x0372(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasSeenAuricCellsOnboardingCurrencyPopup;               // 0x0373(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasSeenIridescentShardsOnboardingCurrencyPopup;         // 0x0374(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasSeenLightSensitivity;                                // 0x0375(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasSeenMainMenu;                                        // 0x0376(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ZC4G[0x1];                                   // 0x0377(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<int32_t, struct FCharacterSavedProfileData>           _characterData;                                          // 0x0378(0x0050) NativeAccessSpecifierPrivate
		TMap<class FName, struct FSpecialEventSavedData>           _specialEvent;                                           // 0x03C8(0x0050) NativeAccessSpecifierPrivate
		unsigned char                                              _seenCinematics[0x50];                                   // 0x0418(0x0050) UNKNOWN PROPERTY: SetProperty
		TMap<class FString, struct FReleaseSavedData>              _releases;                                               // 0x0468(0x0050) NativeAccessSpecifierPrivate
		bool                                                       _hasBeginnerTooltipsBeenDisabledAtLevel;                 // 0x04B8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_329Q[0x7];                                   // 0x04B9(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ConsoleUserSettings
	 * Size -> 0x00D0
	 */
	struct FConsoleUserSettings
	{
	public:
		unsigned char                                              UnknownData_NJ22[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FInputActionKeyMapping>                      ActionMappings;                                          // 0x0008(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
		TArray<struct FInputAxisKeyMapping>                        AxisMappings;                                            // 0x0018(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
		int32_t                                                    MenuScaleFactor;                                         // 0x0028(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HudScaleFactor;                                          // 0x002C(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SkillCheckScaleFactor;                                   // 0x0030(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LargeText;                                               // 0x0034(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       BloodwebInteractionBehaviour;                            // 0x0035(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       TerrorRadiusVisualFeedback;                              // 0x0036(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8E1Q[0x1];                                   // 0x0037(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Gamma;                                                   // 0x0038(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HUDPlayerNamesVisibility;                                // 0x003C(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HUDScoreEventsVisibility;                                // 0x003D(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HUDKillerHookCountVisibility;                            // 0x003E(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SurvivorSpecificPingIcon;                                // 0x003F(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LegacyPrestigePortraits;                                 // 0x0040(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ChallengeProgression;                                    // 0x0041(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ChallengeCompletion;                                     // 0x0042(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WM7B[0x1];                                   // 0x0043(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MainVolume;                                              // 0x0044(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MenuMusicVolume;                                         // 0x0048(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseHeadphones;                                           // 0x004C(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MuteOnFocusLost;                                         // 0x004D(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HapticsVibrationPS5;                                     // 0x004E(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1DQ8[0x1];                                   // 0x004F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    KillerMouseSensitivity;                                  // 0x0050(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SurvivorMouseSensitivity;                                // 0x0054(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    KillerControllerSensitivity;                             // 0x0058(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SurvivorControllerSensitivity;                           // 0x005C(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InvertY;                                                 // 0x0060(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SurvivorInvertY;                                         // 0x0061(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       KillerToggleInteractions;                                // 0x0062(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SurvivorToggleInteractions;                              // 0x0063(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SprintToCancel;                                          // 0x0064(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9TLJ[0x3];                                   // 0x0065(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    HighestWeightSeenNews;                                   // 0x0068(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseAtlantaCustomizedHuds;                                // 0x006C(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseAtlantaSurvivorQuickTurn;                             // 0x006D(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseAtlantaKillerQuickTurn;                               // 0x006E(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KWXL[0x1];                                   // 0x006F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAtlantaCustomizedHudSettings>               AtlantaCustomizedHuds;                                   // 0x0070(0x0010) ZeroConstructor, SaveGame, NativeAccessSpecifierPublic
		bool                                                       HasAcceptedCrossplayPopup;                               // 0x0080(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasAcceptedProgressionSystemInfoPopup;                   // 0x0081(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasAcceptedCrossProgressionPopup;                        // 0x0082(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8DHW[0x5];                                   // 0x0083(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBonusTierTooltipVisibility                         BonusTierTooltipVisibility;                              // 0x0088(0x0018) SaveGame, NativeAccessSpecifierPublic
		class FString                                              PartyPrivacyState;                                       // 0x00A0(0x0010) ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ColorBlindMode;                                          // 0x00B0(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ColorBlindModeIntensity;                                 // 0x00B4(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       BeginnerMode;                                            // 0x00B8(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Subtitles;                                               // 0x00B9(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3LEA[0x2];                                   // 0x00BA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    SubtitlesBackgroundOpacity;                              // 0x00BC(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SubtitlesSize;                                           // 0x00C0(0x0004) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAnonymousMode;                                         // 0x00C4(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HideYourName;                                            // 0x00C5(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HideOtherNames;                                          // 0x00C6(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HiddenMatchmakingDelay;                                  // 0x00C7(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasAcceptedHapticsVibrationPopup;                        // 0x00C8(0x0001) ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_86EO[0x7];                                   // 0x00C9(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerSavedProfileData
	 * Size -> 0x0608
	 */
	struct FPlayerSavedProfileData
	{
	public:
		class FString                                              PlayerUID;                                               // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FPlayerSavedProfileDataShared                       SharedData;                                              // 0x0010(0x0068) NativeAccessSpecifierPublic
		struct FPlayerSavedProfileDataLocal                        LocalData;                                               // 0x0078(0x04C0) NativeAccessSpecifierPublic
		struct FConsoleUserSettings                                ConsoleUserSettings;                                     // 0x0538(0x00D0) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerPersistentData
	 * Size -> 0x0828
	 */
	struct FPlayerPersistentData
	{
	public:
		EPlayerRole                                                GameRole;                                                // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0F0H[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPlayerLoadoutData                                  StartingLoadout;                                         // 0x0008(0x0098) Transient, NativeAccessSpecifierPublic
		struct FPlayerLoadoutData                                  CurrentLoadout;                                          // 0x00A0(0x0098) Transient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZQ40[0x98];                                  // 0x0138(0x0098) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPlayerSavedProfileData                             SavedData;                                               // 0x01D0(0x0608) NativeAccessSpecifierPublic
		EPlatformFlag                                              PlayerPlatform;                                          // 0x07D8(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3EDB[0x3];                                   // 0x07D9(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		EProviderFlag                                              PlayerProvider;                                          // 0x07DC(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6TQC[0x3];                                   // 0x07DD(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_IDGP[0x48];                                  // 0x07E0(0x0048) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.CloudInventoryItem
	 * Size -> 0x0010
	 */
	struct FCloudInventoryItem
	{
	public:
		int32_t                                                    DefinitionId;                                            // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5NQH[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint64_t                                                   InstanceId;                                              // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.CharacterStateData
	 * Size -> 0x0020
	 */
	struct FCharacterStateData
	{
	public:
		int32_t                                                    _pips;                                                   // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                _powerId;                                                // 0x0004(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class FName>                                        _addonIds;                                               // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerStateData
	 * Size -> 0x0038
	 */
	struct FPlayerStateData
	{
	public:
		int32_t                                                    CharacterLevel;                                          // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                EquipedFavorId;                                          // 0x0004(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                        EquipedPerkIds;                                          // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            EquipedPerkLevels;                                       // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		EGameState                                                 _playerGameState;                                        // 0x0030(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_XDJ2[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    _prestigeLevel;                                          // 0x0034(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.AwardedScore
	 * Size -> 0x0010
	 */
	struct FAwardedScore
	{
	public:
		class FName                                                ScoreTypeId;                                             // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BloodpointsAwarded;                                      // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AwardedScores
	 * Size -> 0x0010
	 */
	struct FAwardedScores
	{
	public:
		TArray<struct FAwardedScore>                               Array;                                                   // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.UserGameStats
	 * Size -> 0x00B0
	 */
	struct FUserGameStats
	{
	public:
		bool                                                       Disconnected;                                            // 0x0000(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WL47[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    FearTokens;                                              // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Skulls;                                                  // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5XHS[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<EDBDScoreCategory, int32_t>                           BonusBloodpoints;                                        // 0x0010(0x0050) Transient, NativeAccessSpecifierPublic
		TMap<EDBDScoreCategory, int32_t>                           _bloodpoints;                                            // 0x0060(0x0050) Transient, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.OngoingScoreData
	 * Size -> 0x0030
	 */
	struct FOngoingScoreData
	{
	public:
		EDBDScoreTypes                                             scoreType;                                               // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ILBV[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        scoreTypeTag;                                            // 0x0004(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeSinceScore;                                          // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ApplyScoreTimeout;                                       // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AccumulatedPercent;                                      // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UQ74[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              Target;                                                  // 0x0020(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             CustomObjectParameter;                                   // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.StreamerModePlayerData
	 * Size -> 0x0008
	 */
	struct FStreamerModePlayerData
	{
	public:
		bool                                                       IsAnonymousMode;                                         // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3I62[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    AnonymousSuffix;                                         // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AtlantaRitualDifficulty
	 * Size -> 0x000C
	 */
	struct FAtlantaRitualDifficulty
	{
	public:
		float                                                      Threshold;                                               // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DisplayThreshold;                                        // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AtlantaRitualInstance
	 * Size -> 0x0060
	 */
	struct FAtlantaRitualInstance
	{
	public:
		class FName                                                RitualKey;                                               // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    characterId;                                             // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPlayerRole                                                Role;                                                    // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IT8I[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<EDBDScoreTypes>                                     TrackedEvents;                                           // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FString>                                      TrackedGameEvents;                                       // 0x0028(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class UAtlantaRitualEvaluatorBase*                         Evaluator;                                               // 0x0038(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAtlantaRitualDifficulty                            Difficulty;                                              // 0x0040(0x000C) NoDestructor, NativeAccessSpecifierPublic
		float                                                      Progress;                                                // 0x004C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Active;                                                  // 0x0050(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E0WF[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDateTime                                           ExpiryDate;                                              // 0x0058(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.AtlantaRitualSet
	 * Size -> 0x0038
	 */
	struct FAtlantaRitualSet
	{
	public:
		TArray<struct FAtlantaRitualInstance>                      Instances;                                               // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FRewardItem>                                 RewardItems;                                             // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_524P[0x18];                                  // 0x0020(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DailyRitualInstance
	 * Size -> 0x0078
	 */
	struct FDailyRitualInstance
	{
	public:
		class FString                                              ritualId;                                                // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<EDBDScoreTypes>                                     TrackedEvents;                                           // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                TrackedGameEvents;                                       // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            CharacterIDs;                                            // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<EPlayerRole>                                        Roles;                                                   // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      Progress;                                                // 0x0050(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Threshold;                                               // 0x0054(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DisplayThreshold;                                        // 0x005C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExpReward;                                               // 0x0060(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Active;                                                  // 0x0064(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsTemporary;                                             // 0x0065(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OYYY[0x2];                                   // 0x0066(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDateTime                                           DateAssigned;                                            // 0x0068(0x0008) ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class URitualEvaluatorBase*                                Evaluator;                                               // 0x0070(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.DialogClipSettings
	 * Size -> 0x0028
	 */
	struct FDialogClipSettings
	{
	public:
		class UAkAudioEvent*                                       Clip;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ConditionClass;                                          // 0x0008(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDialogHandlerCondition*                             Condition;                                               // 0x0010(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Priority;                                                // 0x0018(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Weight;                                                  // 0x001C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsOnlyPlayingOnce;                                       // 0x0020(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X6LF[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DialogEventSettings
	 * Size -> 0x0030
	 */
	struct FDialogEventSettings
	{
	public:
		struct FGameplayTag                                        GameEventTrigger;                                        // 0x0000(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EIBH[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FDialogClipSettings>                         Clips;                                                   // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       OverrideCurrentAudio;                                    // 0x0020(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_29P5[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DelayUntilPlay;                                          // 0x0024(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PlayProbability;                                         // 0x0028(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NXVU[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.GeneratorQueryHandlePair
	 * Size -> 0x0028
	 */
	struct FGeneratorQueryHandlePair
	{
	public:
		unsigned char                                              UnknownData_HGF3[0x28];                                  // 0x0000(0x0028) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.EffectsLocatorTargets
	 * Size -> 0x0008
	 */
	struct FEffectsLocatorTargets
	{
	public:
		class UClass*                                              TargetActorClass;                                        // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.GameEventData
	 * Size -> 0x0028
	 */
	struct FGameEventData
	{
	public:
		class ADBDPlayer*                                          Instigator;                                              // 0x0000(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              Target;                                                  // 0x0008(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CustomValue;                                             // 0x0010(0x0004) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H23D[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UObject*                                             CustomObjectParameter;                                   // 0x0018(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CustomIntValue;                                          // 0x0020(0x0004) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z0S5[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.DamageData
	 * Size -> 0x0020
	 */
	struct FDamageData
	{
	public:
		bool                                                       _isRegressing;                                           // 0x0000(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _isIntense;                                              // 0x0001(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_A80M[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class ADBDPlayer>                           _lastDamageChangeSource;                                 // 0x0004(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_BJY4[0x14];                                  // 0x000C(0x0014) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PlayerFloatTuple
	 * Size -> 0x0010
	 */
	struct FPlayerFloatTuple
	{
	public:
		class ACharacter*                                          Player;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      value;                                                   // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OO0U[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.ReflectionCaptureTwoStates
	 * Size -> 0x0030
	 */
	struct FReflectionCaptureTwoStates
	{
	public:
		struct FComponentReference                                 ComponentReference;                                      // 0x0000(0x0030) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.InboxMessageUIData
	 * Size -> 0x0060
	 */
	struct FInboxMessageUIData
	{
	public:
		class FString                                              MessageId;                                               // 0x0000(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           ReceivedTime;                                            // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInboxMessageUIType                                        MessageType;                                             // 0x0018(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CTNZ[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              MessageTitle;                                            // 0x0020(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              MessageBody;                                             // 0x0030(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInboxMessageUIState                                       MessageState;                                            // 0x0040(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GPY6[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FClaimableInboxMessage                              AttachedClaimable;                                       // 0x0048(0x0018) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.ObjectLock
	 * Size -> 0x0008
	 */
	struct FObjectLock
	{
	public:
		TWeakObjectPtr<class UObject>                              _lockingObject;                                          // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadByDaylight.LandingPageTabData
	 * Size -> 0x0058
	 */
	struct FLandingPageTabData
	{
	public:
		class FText                                                DefaultText;                                             // 0x0000(0x0018) Edit, NativeAccessSpecifierPublic
		unsigned char                                              DefaultImage[0x10];                                      // 0x0018(0x0010) UNKNOWN PROPERTY: InterfaceProperty
		struct FSlateColor                                         BannerBackgroudColor;                                    // 0x0028(0x0028) Edit, NativeAccessSpecifierPublic
		bool                                                       IsButtonEnabled;                                         // 0x0050(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G4ZP[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.LevelReadyToPlayRequirements
	 * Size -> 0x0010
	 */
	struct FLevelReadyToPlayRequirements
	{
	public:
		class ADBDPlayer*                                          Player;                                                  // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              perkCount;                                               // 0x0008(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              itemCount;                                               // 0x0009(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              addonCount;                                              // 0x000A(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9BAH[0x5];                                   // 0x000B(0x0005) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.LightingSpecifics
	 * Size -> 0x0030
	 */
	struct FLightingSpecifics
	{
	public:
		unsigned char                                              LightBlueprint[0x30];                                    // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.SceneLightingDescription
	 * Size -> 0x00D0
	 */
	struct FSceneLightingDescription
	{
	public:
		class FName                                                ThemeName;                                               // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7RJH[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLightingSpecifics                                  LightingDetailsLowMedium;                                // 0x0010(0x0030) Edit, NativeAccessSpecifierPublic
		struct FLightingSpecifics                                  LightingDetailsHighUltra;                                // 0x0040(0x0030) Edit, NativeAccessSpecifierPublic
		struct FLightingSpecifics                                  LightingAtlanta;                                         // 0x0070(0x0030) Edit, NativeAccessSpecifierPublic
		unsigned char                                              TextureCube[0x30];                                       // 0x00A0(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	};

	/**
	 * ScriptStruct DeadByDaylight.LoudNoiseIndicatorData
	 * Size -> 0x0020
	 */
	struct FLoudNoiseIndicatorData
	{
	public:
		class UStaticMeshComponent*                                MeshMask;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                DistortionMesh;                                          // 0x0008(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x0010(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RemainingTime;                                           // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.TileProperties
	 * Size -> 0x0078
	 */
	struct FTileProperties
	{
	public:
		unsigned char                                              UnknownData_26BE[0x78];                                  // 0x0000(0x0078) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.MontageInstanceInfo
	 * Size -> 0x0030
	 */
	struct FMontageInstanceInfo
	{
	public:
		unsigned char                                              UnknownData_959Z[0x30];                                  // 0x0000(0x0030) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.RarityTexture
	 * Size -> 0x0030
	 */
	struct FRarityTexture
	{
	public:
		class FName                                                Type;                                                    // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LLVF[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     Texture;                                                 // 0x0010(0x0020) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.OfferingTypeTexture
	 * Size -> 0x0030
	 */
	struct FOfferingTypeTexture
	{
	public:
		class FName                                                Type;                                                    // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S93W[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     TextureBack;                                             // 0x0010(0x0020) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.OfferingRevealDelays
	 * Size -> 0x0008
	 */
	struct FOfferingRevealDelays
	{
	public:
		EOfferingSequenceState                                     RevealState;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TJX6[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Delay;                                                   // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.OnScreenDebugInfo
	 * Size -> 0x0028
	 */
	struct FOnScreenDebugInfo
	{
	public:
		class FString                                              Message;                                                 // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FColor                                              Color;                                                   // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OL7Q[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint64_t                                                   Key;                                                     // 0x0018(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeToDisplay;                                           // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M6ZB[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadByDaylight.PalletPushSettings
	 * Size -> 0x0002
	 */
	struct FPalletPushSettings
	{
	public:
		bool                                                       IgnorePlayerExecutingPulldown;                           // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPalletPushSideStrategy                                    PalletPushSideStrategy;                                  // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.SpecialEventUIInfo
	 * Size -> 0x0060
	 */
	struct FSpecialEventUIInfo
	{
	public:
		class FString                                              EventId;                                                 // 0x0000(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EventBannerFrameLabel;                                   // 0x0010(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EventThemeFrameLabel;                                    // 0x0020(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                EventName;                                               // 0x0030(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic
		bool                                                       IsPastEvent;                                             // 0x0048(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PK07[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              BloodwebCollectSoundEvent;                               // 0x0050(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadByDaylight.InventorySlotData
	 * Size -> 0x0128
	 */
	struct FInventorySlotData
	{
	public:
		class FName                                                ItemId;                                                  // 0x0000(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BF0C[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              IconFilePath;                                            // 0x0010(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              DisplayName;                                             // 0x0020(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ParentDisplayName;                                       // 0x0030(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ParentTypeDisplayName;                                   // 0x0040(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsParentAvailable;                                       // 0x0050(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6S5G[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              Description;                                             // 0x0058(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<EPerkCategory>                                      PerkCategory;                                            // 0x0068(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic
		EOfferingCategory                                          OfferingCategory;                                        // 0x0078(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInventoryItemType                                         ItemType;                                                // 0x0079(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x007A(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EStatusEffectType                                          StatusEffectType;                                        // 0x007B(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
