#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLungeAttackEndCosmetic
	 */
	struct UPounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic_Params
	{
	public:
		class ADBDPlayer*                                          SlasherPlayer;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLocallyObservedChangedCosmetic
	 */
	struct UPounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic_Params
	{
	public:
		class ADBDPlayer*                                          SlasherPlayer;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLungeAttackStartCosmetic
	 */
	struct UPounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic_Params
	{
	public:
		class ADBDPlayer*                                          SlasherPlayer;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP
	 */
	struct UPounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_CM1M[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
