#pragma once

/**
 * Name: dbd
 * Version: 6711
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class TheK25.Addon_K25Power_17
	 * Size -> 0x0018 (FullSize[0x02D0] - InheritedSize[0x02B8])
	 */
	class UAddon_K25Power_17 : public UItemAddon
	{
	public:
		unsigned char                                              UnknownData_YI09[0x18];                                  // 0x02B8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.AISkill_FindCollectable_LamentConfiguration
	 * Size -> 0x0020 (FullSize[0x0150] - InheritedSize[0x0130])
	 */
	class UAISkill_FindCollectable_LamentConfiguration : public UAISkill_FindCollectable
	{
	public:
		struct FAITunableParameter                                 StopChainHuntGoalWeight;                                 // 0x0130(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 PreemptiveFindLamentGoalWeight;                          // 0x0140(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.AISkill_InteractionBreakFreeFromChains
	 * Size -> 0x0028 (FullSize[0x01A8] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionBreakFreeFromChains : public UAISkill_Interaction
	{
	public:
		struct FDBDTunableRowHandle                                _breakFreeFromChainsMaxCharge;                           // 0x0180(0x0028) Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.AISkill_InteractionUseItem_LamentConfiguration
	 * Size -> 0x0038 (FullSize[0x01C0] - InheritedSize[0x0188])
	 */
	class UAISkill_InteractionUseItem_LamentConfiguration : public UAISkill_InteractionUseItem
	{
	public:
		struct FAITunableParameter                                 SolveLamentThreshold;                                    // 0x0188(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FDBDTunableRowHandle                                _solveLamentMaxCharge;                                   // 0x0198(0x0028) Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.ChainAttachedGateBlockerEffect
	 * Size -> 0x0028 (FullSize[0x03B0] - InheritedSize[0x0388])
	 */
	class UChainAttachedGateBlockerEffect : public UGateBlockerEffect
	{
	public:
		struct FDBDTunableRowHandle                                _blockGateLingeringTimeDyingState;                       // 0x0388(0x0028) Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void OnSurvivorDamageStateChanged(ECamperDamageState oldState, ECamperDamageState NewState);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.IsChainHuntActive
	 * Size -> 0x0028 (FullSize[0x0110] - InheritedSize[0x00E8])
	 */
	class UIsChainHuntActive : public UEventDrivenModifierCondition
	{
	public:
		unsigned char                                              UnknownData_CVGH[0x28];                                  // 0x00E8(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25AnimInstance
	 * Size -> 0x0010 (FullSize[0x0610] - InheritedSize[0x0600])
	 */
	class UK25AnimInstance : public UKillerAnimInstance
	{
	public:
		bool                                                       _isTeleporting;                                          // 0x0600(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isPossessingGateway;                                    // 0x0601(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isSelectingGatewayLocation;                             // 0x0602(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HNRR[0xD];                                   // 0x0603(0x000D) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25AttackSubAnimInstance
	 * Size -> 0x0010 (FullSize[0x0630] - InheritedSize[0x0620])
	 */
	class UK25AttackSubAnimInstance : public UKillerAttackSubAnimInstance
	{
	public:
		unsigned char                                              UnknownData_BQZB[0x10];                                  // 0x0620(0x0010) MISSED OFFSET (PADDING)

	public:
		void OnAttackStart(EAttackType attackType);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25Chain
	 * Size -> 0x0200 (FullSize[0x0430] - InheritedSize[0x0230])
	 */
	class AK25Chain : public AActor
	{
	public:
		unsigned char                                              UnknownData_MZ2E[0x8];                                   // 0x0230(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnAcquiredChanged;                                       // 0x0238(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class UCurveFloat*                                         _attachedToProjectileInfluenceCurve;                     // 0x0248(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         _reelbackInfluenceCurve;                                 // 0x0250(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         _offsetMultiplierInfluenceCurve;                         // 0x0258(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KDG9[0x50];                                  // 0x0260(0x0050) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDBDTunableRowHandle                                _reelingBackSpeed;                                       // 0x02B0(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _chainOffsetMinValue;                                    // 0x02D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _chainOffsetMaxValue;                                    // 0x02DC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _reelbackChainOffsetMinValue;                            // 0x02E0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _reelbackChainOffsetMaxValue;                            // 0x02E4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _chainInstanceSpacing;                                   // 0x02E8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _quickChainOffsetTimerLength;                            // 0x02EC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _reachingSurvivorAnchorTime;                             // 0x02F0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FVector                                             _chainScale;                                             // 0x02F4(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _chainOffsetTimerLength;                                 // 0x0300(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_U35K[0x4];                                   // 0x0304(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FVector>                                     _currentChainPoints;                                     // 0x0308(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		bool                                                       _isAcquiredFromPool;                                     // 0x0318(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_4W9H[0x3];                                   // 0x0319(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _sphereTraceRadius;                                      // 0x031C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             _chainStartPosition;                                     // 0x0320(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             _reelBackPosition;                                       // 0x032C(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             _reelbackStartPosition;                                  // 0x0338(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_V25V[0x4];                                   // 0x0344(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AK25Projectile*                                      _projectileAttachedTo;                                   // 0x0348(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor>    _survivorAnchorAttachedTo;                               // 0x0350(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor>    _targetAnchorToReach;                                    // 0x0358(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USplineComponent*                                    _chainSplineComponent;                                   // 0x0360(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UInstancedStaticMeshComponent*                       _chainInstancedMesh;                                     // 0x0368(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCurveFloat*                                         _currentInfluenceCurve;                                  // 0x0370(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             _chainCurveOffset;                                       // 0x0378(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		EK25ChainState                                             _chainState;                                             // 0x0384(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_O6EI[0x3];                                   // 0x0385(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FFastTimer                                          _curveOffsetStrengthTimer;                               // 0x0388(0x0030) Transient, NativeAccessSpecifierPrivate
		struct FFastTimer                                          _reelbackTimer;                                          // 0x03B8(0x0030) Transient, NativeAccessSpecifierPrivate
		struct FFastTimer                                          _reachSurvivorAnchorPositionTimer;                       // 0x03E8(0x0030) Transient, NativeAccessSpecifierPrivate
		TArray<struct FVector>                                     _forcedPositions;                                        // 0x0418(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		EK25ChainCreationStrategy                                  _chainCreationStrategy;                                  // 0x0428(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_TTRE[0x7];                                   // 0x0429(0x0007) MISSED OFFSET (PADDING)

	public:
		void SetSplineComponent(class USplineComponent* Component);
		void SetInstancedMeshComponent(class UInstancedStaticMeshComponent* InstancedMesh);
		bool IsAttachedToControlledProjectile();
		class AK25SurvivorChainAttachmentAnchor* GetSurvivorChainAttachmentAnchor();
		struct FVector GetChainStartLocation();
		struct FVector GetChainEndLocation();
		void Cosmetic_OnSurvivorStoppedRemovingChainSFX(bool hasRemovedChainDueToInteraction);
		void Cosmetic_OnSurvivorStartedRemovingChainSFX();
		void Cosmetic_OnInstantChainUnleashedTowardsAttachmentPointFX();
		void Cosmetic_OnChainUnleashedWithProjectile();
		void Cosmetic_OnChainStartedToReelback();
		void Cosmetic_OnChainDisappears();
		void Cosmetic_OnChainDetachedFromSurvivor(EK25ChainDetachmentReason detachmentReason);
		void Cosmetic_OnChainAttachedToSurvivor(bool wasReachingSurvivorAnchorPoint);
		void Cosmetic_OnChainAppears();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainAttachedStatusEffect
	 * Size -> 0x0018 (FullSize[0x0368] - InheritedSize[0x0350])
	 */
	class UK25ChainAttachedStatusEffect : public UStatusEffect
	{
	public:
		class UCurveFloat*                                         _percentageReductionSpeedPerChainCurve;                  // 0x0350(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UK25SurvivorChainAttachmentComponent*                _chainAttachmentComponent;                               // 0x0358(0x0008) ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    _cachedNumberOfChainsAttached;                           // 0x0360(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_METV[0x4];                                   // 0x0364(0x0004) MISSED OFFSET (PADDING)

	public:
		void OnRep_ChainAttachementComponent();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainAttachmentReplicationComponent
	 * Size -> 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
	 */
	class UK25ChainAttachmentReplicationComponent : public UActorComponent
	{
	public:
		void Multicast_StartChainReelback(class AK25Chain* chainToAttach);
		void Multicast_LaunchInstantHitChainTowardsSurvivor(class AK25Chain* newChainToAttach, class AK25SurvivorChainAttachmentAnchor* targetAnchor, const struct FVector& StartPosition);
		void Multicast_DetachChains(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, TArray<class AK25Chain*> chainsToDetach, EK25ChainDetachmentReason detachmentReason, TArray<class AK25Chain*> chainsAttached);
		void Multicast_AttachChainToAnchor(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, class AK25Chain* chainToAttach, class AK25SurvivorChainAttachmentAnchor* anchorPoint);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainHuntEffectsComponent
	 * Size -> 0x0038 (FullSize[0x00F0] - InheritedSize[0x00B8])
	 */
	class UK25ChainHuntEffectsComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_INDT[0x38];                                  // 0x00B8(0x0038) MISSED OFFSET (PADDING)

	public:
		class ADBDPlayer* GetOwningPlayer();
		void Cosmetic_TriggerChainHuntActivationSFX();
		void Cosmetic_DeactivateChainHuntEffects();
		void Cosmetic_ActivateChainHuntEffects(bool hasChainHuntStarted);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainLocomotionSurvivorAnimInstance
	 * Size -> 0x0188 (FullSize[0x06D0] - InheritedSize[0x0548])
	 */
	class UK25ChainLocomotionSurvivorAnimInstance : public UBaseSurvivorAnimInstance
	{
	public:
		unsigned char                                              UnknownData_5EB3[0x8];                                   // 0x0548(0x0008) Fix Super Size
		bool                                                       _hasChainsAttached;                                      // 0x0550(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isPerformingBreakChainInteraction;                      // 0x0551(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_5PQ3[0x2];                                   // 0x0552(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _forwardDirectionDotProductResult;                       // 0x0554(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _lateralDirectionDotProductResult;                       // 0x0558(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2CXO[0x4];                                   // 0x055C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AK25Chain*                                           _currentChainBeingDetached;                              // 0x0560(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _leftHandAttachmentData;                                 // 0x0568(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _rightHandAttachmentData;                                // 0x0580(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _leftShoulderAttachmentData;                             // 0x0598(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _rightShoulderAttachmentData;                            // 0x05B0(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _stomachAttachmentData;                                  // 0x05C8(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FK25ChainAnchorAnimationData                        _backAttachmentData;                                     // 0x05E0(0x0018) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		EK25ChainAnchorPointDirection                              _chainDirection;                                         // 0x05F8(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _hasBrokenFreeFromChain;                                 // 0x05F9(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_F1ZD[0x2];                                   // 0x05FA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _hasBrokenFreeTime;                                      // 0x05FC(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _hasBeenHitByChain;                                      // 0x0600(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isIdle;                                                 // 0x0601(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isCrouched;                                             // 0x0602(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isMale;                                                 // 0x0603(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isBeingCarried;                                         // 0x0604(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_W5T8[0x3];                                   // 0x0605(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _hasBeenHitByChainTime;                                  // 0x0608(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FName                                                _hitChainName;                                           // 0x060C(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FName                                                _detachedChainAnchorName;                                // 0x0618(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_OI44[0xAC];                                  // 0x0624(0x00AC) MISSED OFFSET (PADDING)

	public:
		void OnChainDetached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor, EK25ChainDetachmentReason detachmentReason);
		void OnChainAttached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainPool
	 * Size -> 0x0000 (FullSize[0x00F0] - InheritedSize[0x00F0])
	 */
	class UK25ChainPool : public UAuthoritativeActorPoolComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrike_IsGatewayOrientationTimerExpired
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UK25ChainStrike_IsGatewayOrientationTimerExpired : public UFSM_Condition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrike_IsGatewayPlacementValidCondition
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UK25ChainStrike_IsGatewayPlacementValidCondition : public UFSM_Condition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrike_IsPlayerPressingInputCondition
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UK25ChainStrike_IsPlayerPressingInputCondition : public UFSM_Condition
	{
	public:
		EInputInteractionType                                      _inputType;                                              // 0x0038(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_RS8T[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeBaseState
	 * Size -> 0x0050 (FullSize[0x00C8] - InheritedSize[0x0078])
	 */
	class UK25ChainStrikeBaseState : public UFSM_State
	{
	public:
		unsigned char                                              _secondaryInteractionIDs[0x50];                          // 0x0078(0x0050) UNKNOWN PROPERTY: SetProperty

	public:
		class ADBDPlayer* GetPlayerOwner();
		class AK25Power* GetK25Power();
		class AK25Gateway* GetK25Gateway();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeImmunityEffect
	 * Size -> 0x0028 (FullSize[0x03A8] - InheritedSize[0x0380])
	 */
	class UK25ChainStrikeImmunityEffect : public UActivateOnEventTimedStatusEffect
	{
	public:
		struct FDBDTunableRowHandle                                _chainStrikeImmunityDuration;                            // 0x0380(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeInteraction
	 * Size -> 0x0230 (FullSize[0x0970] - InheritedSize[0x0740])
	 */
	class UK25ChainStrikeInteraction : public UChargeableInteractionDefinition
	{
	public:
		class UClass*                                              _chainStrikeStateMachineclass;                           // 0x0740(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _repossessFadeOutTime;                                   // 0x0748(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_G2FB[0x4];                                   // 0x074C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDBDTunableRowHandle                                _repossessFadeInTime;                                    // 0x0750(0x0028) Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCurveFloat*                                         _gatewayPossessionFovModifierCurve;                      // 0x0778(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCurveFloat*                                         _controlledProjectilePossessionFovModifierCurve;         // 0x0780(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _chargeTimeAfterGatewayPlacementCancelled;               // 0x0788(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _chargeTimeAfterGatewayPossessionCancelled;              // 0x07B0(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _chargeTimeAfterControlledChainShot;                     // 0x07D8(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _gatewayPossessionFovChangeDuration;                     // 0x0800(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _gatewayPossessionCameraPanTime;                         // 0x0828(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _controlledProjectilePossessionCameraPanTime;            // 0x0850(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _controlledProjectilePossessionFovTimeChangeDuration;    // 0x0878(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UFiniteStateMachine*                                 _stateMachine;                                           // 0x08A0(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _authority_shouldIncrementChargeableComponent;           // 0x08A8(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_XWAC[0x68];                                  // 0x08A9(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EChainStrikeCameraViewTarget                               _chainStrikeCameraViewTarget;                            // 0x0911(0x0001) Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _hasHitSurvivor;                                         // 0x0912(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LNI9[0x5D];                                  // 0x0913(0x005D) MISSED OFFSET (PADDING)

	public:
		void Server_UpdateCameraViewTargetForObservers(EChainStrikeCameraViewTarget NewViewTarget);
		void Server_SetShouldIncrementChargeableComponent(bool shouldIncrement);
		void Server_SetFallbackEndReason(EChainStrikeEndReason chainStrikeEndReason);
		void Server_RemoveStateTagFromPlayer(const struct FGameplayTag& Tag);
		void Server_AddStateTagToPlayer(const struct FGameplayTag& Tag);
		void OnRep_ChainStrikeCameraViewTarget();
		void Multicast_SetFallbackEndReason(EChainStrikeEndReason chainStrikeEndReason);
		void Multicast_RemoveStateTagFromPlayer(const struct FGameplayTag& Tag);
		void Multicast_AddStateTagToPlayer(const struct FGameplayTag& Tag);
		void Cosmetic_TriggerKillerRepossessionFadeOutEffects(class ASlasherPlayer* killer, bool preventAudioTriggers);
		void Cosmetic_TriggerKillerRepossessionFadeInEffects(class ASlasherPlayer* killer, bool hasHitSurvivor, bool preventAudioTriggers);
		void Cosmetic_TriggerGatewayPossessionEffects(float TransitionTime);
		void Cosmetic_ResetAllVignetteValues(class ASlasherPlayer* killer);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeReplicationComponent
	 * Size -> 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
	 */
	class UK25ChainStrikeReplicationComponent : public UActorComponent
	{
	public:
		void Server_EndChainStrike(class UK25ChainStrikeInteraction* Interaction, EChainStrikeEndReason endReason);
		void Multicast_EndChainStrike(class UK25ChainStrikeInteraction* Interaction, EChainStrikeEndReason endReason);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_EndChainStrike
	 * Size -> 0x0008 (FullSize[0x00D0] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_EndChainStrike : public UK25ChainStrikeBaseState
	{
	public:
		EChainStrikeEndReason                                      _chainStrikeEndReason;                                   // 0x00C8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_5SY7[0x7];                                   // 0x00C9(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_GatewayPlacement
	 * Size -> 0x0000 (FullSize[0x00C8] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_GatewayPlacement : public UK25ChainStrikeBaseState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_OutOfBodyState
	 * Size -> 0x0028 (FullSize[0x00F0] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_OutOfBodyState : public UK25ChainStrikeBaseState
	{
	public:
		struct FDBDTunableRowHandle                                _fovTimeChangeDuration;                                  // 0x00C8(0x0028) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_PossessGateway
	 * Size -> 0x0010 (FullSize[0x00D8] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_PossessGateway : public UK25ChainStrikeBaseState
	{
	public:
		unsigned char                                              UnknownData_MC3W[0x10];                                  // 0x00C8(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_SelectGatewayOrientation
	 * Size -> 0x0018 (FullSize[0x00E0] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_SelectGatewayOrientation : public UK25ChainStrikeBaseState
	{
	public:
		unsigned char                                              UnknownData_ULL4[0x18];                                  // 0x00C8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ChainStrikeState_ShootControlledProjectile
	 * Size -> 0x0040 (FullSize[0x0108] - InheritedSize[0x00C8])
	 */
	class UK25ChainStrikeState_ShootControlledProjectile : public UK25ChainStrikeBaseState
	{
	public:
		float                                                      _minimumThrottleTimeForInputServerCall;                  // 0x00C8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _inputResetSpeed;                                        // 0x00CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AC7V[0x38];                                  // 0x00D0(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25CheatComponent
	 * Size -> 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
	 */
	class UK25CheatComponent : public UActorComponent
	{
	public:
		void DBD_K25TriggerUncontrolledChainsOnLocalSurvivor(int32_t numbChains);
		void DBD_K25TriggerUncontrolledChainsOnClosestsSurvivorToPosition(float X, float Y, float Z, int32_t numbChains);
		void DBD_K25TriggerUncontrolledChainsOnAllSurvivors(int32_t numbChains);
		void DBD_K25ShowAllLamentConfigurationSpawnPoints(float timeDisplayed);
		void DBD_K25SetPowerNoCooldown(bool noCooldown);
		void DBD_K25RevealLamentConfigurationLocation(float timeDisplayed);
		void DBD_K25ForceRespawnLamentConfiguration();
		void DBD_K25ForceRemoveAllChainsOnLocalSurvivor();
		void DBD_K25ForceRemoveAllChainsOnClosestsSurvivorToPosition(float X, float Y, float Z);
		void DBD_K25ForceRemoveAllChainsOnAllSurvivors();
		void DBD_K25ComeToPositionLamentConfiguration(float X, float Y, float Z);
		void DBD_K25ComeToMeLamentConfiguration();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25CollectLamentConfigurationInteraction
	 * Size -> 0x0010 (FullSize[0x0650] - InheritedSize[0x0640])
	 */
	class UK25CollectLamentConfigurationInteraction : public UCollectItemInteraction
	{
	public:
		unsigned char                                              UnknownData_LPM9[0x10];                                  // 0x0640(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25Projectile
	 * Size -> 0x00F8 (FullSize[0x0430] - InheritedSize[0x0338])
	 */
	class AK25Projectile : public AKillerProjectile
	{
	public:
		unsigned char                                              UnknownData_50MG[0x48];                                  // 0x0338(0x0048) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UStaticMeshComponent*                                _staticMesh;                                             // 0x0380(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UPrimitiveComponent*                                 _characterCollider;                                      // 0x0388(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UPrimitiveComponent*                                 _environmentCollider;                                    // 0x0390(0x0008) Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UKillerProjectileDodgeComponent*                     _projectileDodgeComponent;                               // 0x0398(0x0008) Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FLaunchInfo                                         _launchInfo;                                             // 0x03A0(0x001C) Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Z6S7[0x4];                                   // 0x03BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AK25Chain*                                           _attachedChain;                                          // 0x03C0(0x0008) Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _timeIgnoreSlasherCollision;                             // 0x03C8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _isActive;                                               // 0x03CC(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_8OK8[0x3];                                   // 0x03CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FK25ProjectileDeactivationData                      _lastDeactivationData;                                   // 0x03D0(0x0020) Transient, NoDestructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_VFFA[0x40];                                  // 0x03F0(0x0040) MISSED OFFSET (PADDING)

	public:
		void Server_RequestDisableProjectile(EK25ProjectileDeactivateReason deactivateReason);
		void OnProjectileStopped(const struct FHitResult& Result);
		class UDBDProjectileMovementComponent* GetMovementComponent();
		struct FVector GetChainAttachmentLocation();
		void Cosmetic_OnProjectileDeactivated(const struct FK25ProjectileDeactivationData& deactivationData);
		void Cosmetic_OnProjectileActivated();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ControlledProjectile
	 * Size -> 0x0270 (FullSize[0x06A0] - InheritedSize[0x0430])
	 */
	class AK25ControlledProjectile : public AK25Projectile
	{
	public:
		unsigned char                                              UnknownData_06LU[0x8];                                   // 0x0430(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UStaticMeshComponent*                                _killerViewProjectileStaticMesh;                         // 0x0438(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USpringArmComponent*                                 _killerSpringArm;                                        // 0x0440(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCameraComponent*                                    _killerCameraPlacement;                                  // 0x0448(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _pitchClampAngle;                                        // 0x0450(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_SWNI[0x4];                                   // 0x0454(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTunableStat                                        _maximumYawTurnRate;                                     // 0x0458(0x0080) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTunableStat                                        _maximumPitchTurnRate;                                   // 0x04D8(0x0080) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _cameraRollSpeedMultiplier;                              // 0x0558(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _cameraRollGoBackSpeedMultiplier;                        // 0x0580(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _cameraMaximumRollDegree;                                // 0x05A8(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTunableStat                                        _numbExtraChainsOnControlledProjectileHit;               // 0x05D0(0x0080) Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UK25ControlledProjectileMovementComponent*           _controlledProjectileMovementComponent;                  // 0x0650(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _currentRoll;                                            // 0x0658(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _targetRoll;                                             // 0x065C(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5LXP[0x30];                                  // 0x0660(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector_NetQuantize                                 _lastAppliedAngularVelocity;                             // 0x0690(0x000C) Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7NYP[0x4];                                   // 0x069C(0x0004) MISSED OFFSET (PADDING)

	public:
		void Server_ProcessYawInput(float DeltaTime, float scaledInput);
		void Server_ProcessPitchInput(float DeltaTime, float scaledInput);
		void OnRep_AngularVelocity();
		void Cosmetic_OnKillerPossessProjectileEffects();
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25ControlledProjectileMovementComponent
	 * Size -> 0x0140 (FullSize[0x03A0] - InheritedSize[0x0260])
	 */
	class UK25ControlledProjectileMovementComponent : public UPhysicsBasedProjectileMovementComponent
	{
	public:
		struct FDBDTunableRowHandle                                _projectileBaseSpeed;                                    // 0x0260(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _baseProjectileMaximumDistance;                          // 0x0288(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _projectileSpeedIncreaseTime;                            // 0x02B0(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTunableStat                                        _maximumTravelDistanceStat;                              // 0x02D8(0x0080) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCurveFloat*                                         _projectileSpeedIncreaseMultiplier;                      // 0x0358(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _totaldistanceTravelled;                                 // 0x0360(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_MOCN[0x3C];                                  // 0x0364(0x003C) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25EscapeLamentConfigurationGrasp
	 * Size -> 0x0010 (FullSize[0x0750] - InheritedSize[0x0740])
	 */
	class UK25EscapeLamentConfigurationGrasp : public UChargeableInteractionDefinition
	{
	public:
		unsigned char                                              UnknownData_6RV0[0x10];                                  // 0x0740(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25Gateway
	 * Size -> 0x02A0 (FullSize[0x04D0] - InheritedSize[0x0230])
	 */
	class AK25Gateway : public AActor
	{
	public:
		unsigned char                                              UnknownData_NYB4[0x20];                                  // 0x0230(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _rayCastZOffet;                                          // 0x0250(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _rayCastLength;                                          // 0x0254(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<float>                                              _distancePercentLocations;                               // 0x0258(0x0010) Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		float                                                      _survivorGatewayRotationSpeed;                           // 0x0268(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _minimumIndicatorVelocity;                               // 0x026C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _indicatorVelocityEasingFactor;                          // 0x0270(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _minimumTimeBeforeTargetLocationMulticast;               // 0x0274(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_R5FJ[0x8];                                   // 0x0278(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _gatewayNoiseEventTimeInterval;                          // 0x0280(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      _gatewayNoiseEventRange;                                 // 0x0284(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _minDistanceFromPlayer;                                  // 0x0288(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTunableStat                                        _maxDistanceFromPlayer;                                  // 0x02B0(0x0080) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _gatewayPlacementSpeed;                                  // 0x0330(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _pitchLevelChangeAngleThreshold;                         // 0x0358(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _pitchLevelChangeZoneThreshold;                          // 0x0380(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _maximumCameraPitchOrientationAngle;                     // 0x03A8(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _minimumCameraPitchOrientationAngle;                     // 0x03D0(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FDBDTunableRowHandle                                _maxGatewayPossessionDuration;                           // 0x03F8(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UActorComponent*                                     _visualComponent;                                        // 0x0420(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             _targetLocation;                                         // 0x0428(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5AO0[0x14];                                  // 0x0434(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCameraComponent*                                    _cameraPlacementComponent;                               // 0x0448(0x0008) Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _isGatewayPossessed;                                     // 0x0450(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_TZYQ[0x1B];                                  // 0x0451(0x001B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       _isBeingPositionned;                                     // 0x046C(0x0001) Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_0LH4[0x1B];                                  // 0x046D(0x001B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FFastTimer                                          _possessionTimer;                                        // 0x0488(0x0030) Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_3ITA[0x10];                                  // 0x04B8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAIPerceptionStimuliSourceComponent*                 _perceptionStimuliComponent;                             // 0x04C8(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void Server_StartGatewayPossession(const struct FVector& possessionLocation, const struct FRotator& gatewayRotation);
		void Server_SetIsGatewayBeingPositionned(bool isBeingPositionned);
		void Server_SetGatewayTargetLocation(const struct FVector& targetLocation, bool isValidLocation);
		void Server_SetGatewayOrientation(const struct FRotator& Rotation);
		void Server_EndGatewayPossession();
		void OnRep_IsGatewayPossessed();
		void OnRep_IsBeingPositionned();
		void Multicast_SetGatewayTargetLocation(const struct FVector& targetLocation, bool isValidLocation);
		void Multicast_SetGatewayOrientation(const struct FRotator& Rotation);
		void Multicast_SetGatewayLocation(const struct FVector& possessionLocation);
		bool IsGatewayPossessed();
		class UCameraComponent* GetCameraComponent();
		void Cosmetic_TriggerInvalidGatewayPlacementSFX();
		void Cosmetic_TriggerGatewayUnpossessedEffects();
		void Cosmetic_TriggerGatewayPossessionCancel();
		void Cosmetic_TriggerGatewayPossessedEffects(float TransitionTime);
		void Cosmetic_TriggerGatewayPlacementStop();
		void Cosmetic_TriggerGatewayPlacementStart();
		void Cosmetic_TriggerGatewayPlacementCancel();
		void Cosmetic_SetKillerVisualVisibility(bool IsVisible);
		void Cosmetic_SetIsGatewayPositionValid(bool isGatewayPlacementValid);
		static UClass* StaticClass();
	};

	/**
	 * Class TheK25.K25Husk
	 * Size -> 0x0040 (FullSize[0x05A0] - InheritedSize[0x0560])
	 */
	class AK25Husk : public ADBDBasePlayer
	{
	public:
		class UCustomizedSkeletalMesh*                             _customizedSkeletalMeshComponent;                        // 0x0560(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAnimationMontageSlave*                              _montageFollower;                                        // 0x0568(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UMontagePlayer*                                      _montagePlayer;                                          // 0x0570(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
